{
  "name": "jupyter-collaboration",
  "version": "4.2.1",
  "summary": "JupyterLab/Jupyter Notebook 7+ Real Time Collaboration extension (metapackage)",
  "license": "# Licensing terms\n        \n        This project is licensed under the terms of the Modified BSD License\n        (also known as New or Revised or 3-Clause BSD), as follows:\n        \n        - Copyright (c) 2021-, Jupyter Development Team\n        \n        All rights reserved.\n        \n        Redistribution and use in source and binary forms, with or without\n        modification, are permitted provided that the following conditions are met:\n        \n        Redistributions of source code must retain the above copyright notice, this\n        list of conditions and the following disclaimer.\n        \n        Redistributions in binary form must reproduce the above copyright notice, this\n        list of conditions and the following disclaimer in the documentation and/or\n        other materials provided with the distribution.\n        \n        Neither the name of the Jupyter Development Team nor the names of its\n        contributors may be used to endorse or promote products derived from this\n        software without specific prior written permission.\n        \n        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\n        ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\n        WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n        DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE\n        FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n        DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n        SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\n        CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\n        OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n        OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n        \n        ## About the Jupyter Development Team\n        \n        The Jupyter Development Team is the set of all contributors to the Jupyter project.\n        This includes all of the Jupyter subprojects.\n        \n        The core team that coordinates development on GitHub can be found here:\n        https://github.com/jupyter/.\n        \n        ## Our Copyright Policy\n        \n        Jupyter uses a shared copyright model. Each contributor maintains copyright\n        over their contributions to Jupyter. But, it is important to note that these\n        contributions are typically only changes to the repositories. Thus, the Jupyter\n        source code, in its entirety is not the copyright of any single person or\n        institution. Instead, it is the collective copyright of the entire Jupyter\n        Development Team. If individual contributors want to maintain a record of what\n        changes/contributions they have specific copyright on, they should indicate\n        their copyright in the commit message of the change, when they commit the\n        change to one of the Jupyter repositories.\n        \n        With this in mind, the following banner should be used in any source code file\n        to indicate the copyright and license terms:\n        \n            # Copyright (c) Jupyter Development Team.\n            # Distributed under the terms of the Modified BSD License.",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/jupyterlab/jupyter-collaboration/tree/main/projects/jupyter-collaboration",
  "repository_source": "project_urls.source",
  "download": null,
  "download_source": null,
  "pub_date": 1770305492,
  "project_urls": {
    "Issues": "https://github.com/jupyterlab/jupyter-collaboration/issues/new/choose",
    "Source": "https://github.com/jupyterlab/jupyter-collaboration/tree/main/projects/jupyter-collaboration",
    "Changelog": "https://jupyterlab-realtime-collaboration.readthedocs.io/en/latest/changelog.html",
    "Documentation": "https://jupyterlab-realtime-collaboration.readthedocs.io/",
    "Repository": "https://github.com/jupyterlab/jupyter-collaboration"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": true,
  "has_setup_cfg": false
}