{
  "name": "metalearning-class",
  "version": "0.1.0",
  "summary": "A library for meta-learning in Python with neural networks and transformers.",
  "license": "# Sofon Client Library & Vendor License (SCLVL)\n        \n        Version 1.3 — © 2026 Panaceia\n        \n        This License governs the use of the Sofon Client Library (\"the Library\"), its Extensions, and any accompanying components.\\\n        By using the Library, the Licensee agrees to all provisions below.\n        \n        ---\n        \n        # 1. Ownership and Rights\n        \n        1.1. The Library, its source code, architecture, API design, protocol specifications, and all related intellectual property are the exclusive property of Panaceia.\n        \n        1.2. Panaceia retains **unrestricted rights** to:\n        \n        - use, modify, extend, sublicense, commercialize, and integrate the Library,\n        - use any Extensions or Modifications made by third parties for internal or commercial purposes,\\\n          regardless of whether these Extensions are publicly released.\n        \n        1.3. This License does **not** transfer ownership of the Library to the Licensee.\n        \n        ---\n        \n        # 2. Definitions\n        \n        - **Library**: The Sofon Python client library and all its components.\n        - **Extension**: Any modification, adaptation, plugin, integration, or derived code that interacts with or extends the Library.\n        - **Backend**: The Sofon Meta-Learning Platform, including APIs, servers, data pipelines, cloud infrastructure, and metadata systems.\n        - **Metadata**: Architectural information, hyperparameters, performance logs, problem descriptions, challenge submissions, or other data generated by the use of the Backend and library.\n        \n        ---\n        \n        # 3. Permitted Use\n        \n        3.1. The Licensee may:\n        \n        - use the Library locally for research or commercial purposes,\n        - train models locally using the Library,\n        - commercialize models trained locally,\n        - integrate the Library into internal workflows, products, or research pipelines.\n        \n        3.2. Local use is permitted **as long as it does not use, imitate, or replicate the Backend** outside Panaceia’s platform.\n        \n        ---\n        \n        # 4. Restrictions on Commercial Use\n        \n        4.1. The Licensee **may not** use the Library, Extensions, or any derived works to:\n        \n        - build a meta-learning platform, marketplace, automated model selector, AutoML system, or\\\n          competitive product similar to Panaceia’s Sofon platform,\n        - enable, support, integrate with, or provide services to any other meta-learning framework, backend, or platform,\n        - create interoperable or competing APIs or systems.\n        \n        4.2. The Library **may not be sold, licensed, or offered as a meta-learning solution**.\n        \n        ---\n        \n        # 5. Extension and Derivative Work Rules\n        \n        5.1. Any Extension or Modification of the Library:\n        \n        - **must retain this License**,\n        - may remain private and does **not** need to be published publicly,\n        - may only be distributed under this same License.\n        \n        5.2. Extensions may depend on third-party open-source components **only if** their licenses are compatible with this License.\n        \n        5.3. An Extension may not include or depend on software that would force the Library to be distributed under a different license.\n        \n        ---\n        \n        # 6. API and Architecture Protection\n        \n        6.1. The Licensee shall **not**:\n        \n        - copy, replicate, reimplement, or imitate the Library’s API design, structure, or behavior\\\n          for creating competing, interoperable, or substitutive products,\n        - reverse-engineer the Library for competitive use,\n        - extract algorithms, heuristics, or meta-learning logic for use in another product.\n        \n        6.2. “Inspiration” clauses are clarified:\\\n        General conceptual inspiration is unavoidable, but **no code, design, structure, protocol, or functional equivalence** may be reproduced for competitive use.\n        \n        ---\n        \n        # 7. Backend Usage and Metadata Rights\n        \n        7.1. The Backend is not licensed under this License.\\\n        Use of the Backend requires acceptance of Sofon’s Terms & Conditions.\n        \n        7.2. **Models trained locally** belong exclusively to the Licensee.\n        \n        7.3. Models or Metadata submitted to the Backend:\n        \n        - may be used, analyzed, stored, or commercialized by Panaceia,\n        - may be offered on the Sofon marketplace or integrated into the Meta-Learning system according to the challenges rules or terms and conditions.\n        - shall be governed byfollow the challenges rules or terms and conditions of Sofon platform.\n        \n        7.4. Any model whose **weights, metadata, or architecture** that are submitted to Panaceia\\\n        must follow the challenges rules or terms and conditions of Sofon platform upon submission or upload.\n        \n        ---\n        \n        # 8. Prohibition of Third-Party Meta-Learning Systems\n        \n        8.1. The Licensee may not integrate the Library with:\n        \n        - third-party meta-learning servers,\n        - AutoML frameworks with backend components,\n        - other model selection or model marketplace systems.\n        \n        8.2. The Library may be used with other ML libraries **only locally**, and only if not used to feed or integrate another meta-learning backend.\n        \n        ---\n        \n        # 9. Termination\n        \n        Violation of any clause automatically terminates this License.\\\n        Upon termination, the Licensee must stop using the Library and destroy all copies.\n        \n        ---\n        \n        # 10. No Warranty\n        \n        The Library is provided \"AS IS\".\\\n        Panaceia disclaims all warranties.\n        \n        ---\n        \n        # 11. Governing Law\n        \n        This License is governed by the laws of Brazil, Federal district, Brasília.\n        \n        ---\n        \n        **© 2025 Panaceia – All Rights Reserved**",
  "license_expression": null,
  "home_page": "https://github.com/panaceia/metalearning",
  "home_page_source": "project_urls.homepage",
  "maintainer": "Panaceia",
  "author": "Gabriel Alves Castro, João Bizzo Brandt, Lucca Huguet",
  "repository": "https://github.com/panaceia/metalearning",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1769797789,
  "project_urls": {
    "Changelog": "https://github.com/panaceia/metalearning/releases",
    "Homepage": "https://github.com/panaceia/metalearning",
    "Documentation": "https://github.com/panaceia/metalearning#readme",
    "Bug_Tracker": "https://github.com/panaceia/metalearning/issues"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}