{
  "name": "teadata",
  "version": "0.0.118",
  "summary": "Pythonic data engine for Texas education datasets",
  "license": "Business Source License 1.1\n        \n        Parameters\n        Licensor: Alejandro Peña\n        Licensed Work: teadata\n        Additional Use Grant: You may use, copy, modify, and distribute this software for personal, educational, or non-commercial research purposes.\n        \n        Terms\n        The Licensor hereby grants you the right to copy, modify, create derivative works, redistribute, and make non-production use of the Licensed Work. The licensee is prohibited from using the Licensed Work in production or in any commercial product or service without obtaining a separate commercial license from the Licensor.\n        \n        For clarity, “production use” includes any use of the Licensed Work, or a modified version of it, in a way that provides a service or product to others for compensation or in support of business operations.\n        \n        THE LICENSED WORK IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, OR NON-INFRINGEMENT. IN NO EVENT SHALL THE LICENSOR BE LIABLE FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT, OR OTHERWISE, ARISING FROM, OUT OF, OR IN CONNECTION WITH THE LICENSED WORK OR THE USE OR OTHER DEALINGS IN THE LICENSED WORK.",
  "license_expression": null,
  "home_page": "https://github.com/adpena/teadata",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/adpena/teadata",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1771975158,
  "project_urls": {
    "Homepage": "https://github.com/adpena/teadata",
    "Bug Tracker": "https://github.com/adpena/teadata/issues"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}