{
  "name": "auto-coder",
  "version": "3.0.1",
  "summary": "AutoCoder: AutoCoder",
  "license": "\n        专有软件许可协议\n        PROPRIETARY SOFTWARE LICENSE AGREEMENT\n        \n        版权所有 (c) 2024 auto-coder 项目所有者。保留所有权利。\n        \n        重要提示：本软件受版权法和国际条约保护。未经授权的复制或分发本程序或其任何部分，可能导致严重的民事和刑事处罚，并将在法律允许的最大范围内受到起诉。\n        \n        许可条款和条件\n        \n        1. 定义\n           \"软件\"是指 auto-coder 项目的所有源代码、目标代码、文档、数据和相关材料。\n           \"许可方\"是指本软件的版权所有者。\n           \"被许可方\"是指获得本许可的个人或法人实体。\n        \n        2. 许可限制\n           \n           2.1 禁止商业使用\n               本软件严格禁止用于任何商业目的，包括但不限于：\n               - 直接或间接的商业销售\n               - 作为商业服务的一部分提供\n               - 用于商业产品开发\n               - 用于为第三方提供有偿服务\n               - 任何形式的商业化运营\n           \n           2.2 源代码访问限制\n               - 未经许可方书面授权，严禁查看、访问、复制或分发本软件的源代码\n               - 禁止对本软件进行反向工程、反编译或反汇编\n               - 禁止尝试从目标代码推导源代码\n               - 仅授权用户可在获得特殊书面许可后访问源代码\n           \n           2.3 使用限制\n               - 本软件仅供个人学习和研究使用\n               - 必须在封闭的、非公开的环境中使用\n               - 禁止将本软件或其任何部分公开发布或共享\n               - 禁止创建衍生作品\n        \n        3. 知识产权\n           - 本软件的所有权利、所有权和利益均归许可方所有\n           - 本许可不授予被许可方任何知识产权\n           - 被许可方不得删除或修改任何版权声明\n        \n        4. 保密义务\n           被许可方同意：\n           - 对本软件的所有信息严格保密\n           - 不向任何第三方披露本软件的任何内容\n           - 采取合理的安全措施保护本软件\n        \n        5. 终止\n           - 违反本许可的任何条款将自动终止许可\n           - 许可终止后，被许可方必须立即销毁所有软件副本\n        \n        6. 免责声明\n           本软件按\"原样\"提供，不提供任何形式的保证，无论是明示的还是暗示的。\n           许可方不对因使用或无法使用本软件而造成的任何损害承担责任。\n        \n        7. 法律责任\n           违反本许可协议可能导致：\n           - 民事诉讼和损害赔偿\n           - 刑事起诉\n           - 禁令救济\n           - 律师费和诉讼费用的赔偿\n        \n        8. 管辖法律\n           本许可受中华人民共和国法律管辖，并按其解释。\n        \n        9. 完整协议\n           本许可构成双方之间关于本软件的完整协议，取代所有先前的协议或谅解。\n        \n        10. 联系方式\n            如需获得特殊许可或有任何问题，请联系许可方。\n        \n        严正声明：\n        任何未经授权的使用、复制、分发或查看本软件源代码的行为都将被视为侵权，\n        并将受到法律追究。\n        \n        ---\n        \n        PROPRIETARY SOFTWARE LICENSE AGREEMENT\n        \n        Copyright (c) 2024 auto-coder Project Owner. All Rights Reserved.\n        \n        IMPORTANT: This software is protected by copyright laws and international treaties. \n        Unauthorized reproduction or distribution of this program, or any portion of it, \n        may result in severe civil and criminal penalties, and will be prosecuted to the \n        maximum extent possible under the law.\n        \n        LICENSE TERMS AND CONDITIONS\n        \n        1. DEFINITIONS\n           \"Software\" means all source code, object code, documentation, data, and \n           related materials of the auto-coder project.\n           \"Licensor\" means the copyright owner of this Software.\n           \"Licensee\" means the individual or legal entity receiving this license.\n        \n        2. LICENSE RESTRICTIONS\n           \n           2.1 NO COMMERCIAL USE\n               This Software is strictly prohibited for any commercial purposes, including but not limited to:\n               - Direct or indirect commercial sale\n               - Provision as part of commercial services\n               - Use in commercial product development\n               - Use in providing paid services to third parties\n               - Any form of commercial operation\n           \n           2.2 SOURCE CODE ACCESS RESTRICTIONS\n               - Viewing, accessing, copying, or distributing the source code is strictly \n                 prohibited without written authorization from the Licensor\n               - Reverse engineering, decompilation, or disassembly of this Software is prohibited\n               - Attempting to derive source code from object code is prohibited\n               - Only authorized users may access source code with special written permission\n           \n           2.3 USE RESTRICTIONS\n               - This Software is for personal learning and research only\n               - Must be used in a closed, non-public environment\n               - Publishing or sharing this Software or any part thereof is prohibited\n               - Creating derivative works is prohibited\n        \n        3. INTELLECTUAL PROPERTY\n           - All rights, title, and interest in the Software remain with the Licensor\n           - This license grants no intellectual property rights to the Licensee\n           - Licensee may not remove or modify any copyright notices\n        \n        4. CONFIDENTIALITY\n           The Licensee agrees to:\n           - Keep all information about the Software strictly confidential\n           - Not disclose any content of the Software to third parties\n           - Take reasonable security measures to protect the Software\n        \n        5. TERMINATION\n           - Violation of any terms of this license automatically terminates the license\n           - Upon termination, Licensee must immediately destroy all copies of the Software\n        \n        6. DISCLAIMER\n           This Software is provided \"AS IS\" without warranty of any kind, express or implied.\n           The Licensor is not liable for any damages arising from use or inability to use the Software.\n        \n        7. LEGAL LIABILITY\n           Violation of this license agreement may result in:\n           - Civil litigation and damages\n           - Criminal prosecution\n           - Injunctive relief\n           - Compensation for attorney fees and litigation costs\n        \n        8. GOVERNING LAW\n           This license is governed by and construed in accordance with the laws of the \n           People's Republic of China.\n        \n        9. ENTIRE AGREEMENT\n           This license constitutes the entire agreement between the parties regarding \n           the Software and supersedes all prior agreements or understandings.\n        \n        10. CONTACT\n            For special licensing or any questions, please contact the Licensor.\n        \n        STRICT NOTICE:\n        Any unauthorized use, copying, distribution, or viewing of the source code of this \n        Software will be considered infringement and will be prosecuted under the law.\n        ",
  "license_expression": null,
  "home_page": "https://github.com/allwefantasy/auto-coder",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "allwefantasy",
  "repository": "https://github.com/allwefantasy/auto-coder",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1770563416,
  "project_urls": {
    "Homepage": "https://github.com/allwefantasy/auto-coder"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": false,
  "has_setup_py": true,
  "has_setup_cfg": false
}