{
  "name": "autourgos-llmagentkit",
  "version": "1.0.0",
  "summary": "An advanced LLM agent framework supporting ReAct and Tool Calling paradigms.",
  "license": "Copyright (c) 2026 Autourgos. All rights reserved.\r\n        \r\n        PROPRIETARY LICENSE\r\n        \r\n        This software and associated documentation files (the \"Software\") are the proprietary property of Autourgos.\r\n        \r\n        1. Non-Commercial Use Only:\r\n           The Software is provided for personal, educational, and internal research purposes only. Commercial use, including but not limited to using the Software to provide paid services, selling the Software, or integrating the Software into a commercial product, is strictly prohibited without a separate commercial license agreement.\r\n        \r\n        2. No Resale:\r\n           You may not sell, rent, lease, sublicense, or otherwise distribute the Software or any derivative works for a fee.\r\n        \r\n        3. Redistribution:\r\n           Redistribution of the Software in source or binary forms is permitted provided that:\r\n           - The above copyright notice and this permission notice appear in all copies.\r\n           - The Software is not sold or used for commercial gain.\r\n        \r\n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\r\n        ",
  "license_expression": null,
  "home_page": "https://github.com/autourgos/autourgos-llmagentkit",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/autourgos/autourgos-llmagentkit",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1771856425,
  "project_urls": {
    "Repository": "https://github.com/autourgos/autourgos-llmagentkit",
    "Homepage": "https://github.com/autourgos/autourgos-llmagentkit",
    "Bug Tracker": "https://github.com/autourgos/autourgos-llmagentkit/issues"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}