{
  "name": "autobyteus",
  "version": "1.2.3",
  "summary": "Multi-Agent framework",
  "license": "MIT License with Additional Terms for Commercial Use\n        \n        Permission is hereby granted, free of charge, to any person or organization obtaining a copy of this software and associated documentation files (the \"Software\"), to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, subject to the following conditions:\n        \n        1. Commercial Use: The use of the Software for commercial purposes requires the payment of a licensing fee. For details regarding licensing and fees, please contact ryan.zheng at ryan.zheng.work@gmail.com.\n        \n        2. Redistributions: Redistributions of the Software in source code or other forms must include the above copyright notice, this list of conditions, and the following disclaimer.\n        \n        3. Patent Grant: The provisions of the Apache 2.0 License regarding patent grants apply to this License.\n        \n        4. No Warranty/Liability: The Software is provided \"as is,\" without warranty of any kind, express or implied, including but not limited to the warranties of merchantability, fitness for a particular purpose, and non-infringement. In no event shall the authors or copyright holders be liable for any claim, damages, or other liability, whether in an action of contract, tort, or otherwise, arising from, out of, or in connection with the Software or the use or other dealings in the Software.\n        \n        AutoByteus\n        17.07.2023\n        ",
  "license_expression": null,
  "home_page": "https://github.com/AutoByteus/autobyteus",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/AutoByteus/autobyteus",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1769943056,
  "project_urls": {
    "Homepage": "https://github.com/AutoByteus/autobyteus"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}