{
  "name": "est",
  "version": "2.0.1",
  "summary": "Spectroscopy workflows",
  "license": "The est library goal is to provide some usefull process for acquisition/reconstruction automation.\n        \n        est is distributed under the MIT license.\n        \n        est is using the Qt library. A word of caution is to be provided. If users develop and distribute software using modules accessing Qt by means of Riverbank Computing Qt bindings PyQt4 or PyQt5, those users will be conditioned by the license of their PyQt4/5 software (GPL or commercial). If the end user does not own a commercial license of PyQt4 or PyQt5 and wishes to be free of any distribution condition, (s)he should be able to use PySide because it uses the LGPL license.\n        \n        It can also be used as an Orange3 add-on. If you wan't to distribute Orange you must stick to there license (GNU [GPL-3.0]+ license)\n        \n        The MIT license follows:\n        \n        Copyright (c) European Synchrotron Radiation Facility (ESRF)\n        \n        Permission is hereby granted, free of charge, to any person obtaining a copy of\n        this software and associated documentation files (the \"Software\"), to deal in\n        the Software without restriction, including without limitation the rights to\n        use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of\n        the Software, and to permit persons to whom the Software is furnished to do so,\n        subject to the following conditions:\n        \n        The above copyright notice and this permission notice shall be included in all\n        copies or substantial portions of the Software.\n        \n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS\n        FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR\n        COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER\n        IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\n        CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n        ",
  "license_expression": null,
  "home_page": "https://gitlab.esrf.fr/workflow/ewoksapps/est/",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://gitlab.esrf.fr/workflow/ewoksapps/est/",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1771238641,
  "project_urls": {
    "Documentation": "https://ewoksest.readthedocs.io/",
    "Homepage": "https://gitlab.esrf.fr/workflow/ewoksapps/est/",
    "Changelog": "https://gitlab.esrf.fr/workflow/ewoksapps/est/-/blob/main/CHANGELOG.md",
    "Repository": "https://gitlab.esrf.fr/workflow/ewoksapps/est/",
    "Issues": "https://gitlab.esrf.fr/workflow/ewoksapps/est/issues"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}