{
  "name": "django-dbreqresp",
  "version": "0.1.0",
  "summary": null,
  "license": "This License grants rights to study, execute, modify and redistribute the\n        Software or its derivatives to any Licensee, but reserve the commercial use of\n        these rights to the only entities defined in Article 3. Any redistribution or\n        online interaction with the Software or its derivative must be done\n        accordingly to the License’s conditions.\n        \n        1. Definitions\n        \n        “This License” refers to the CoopCycle License.\n        \n        “Copyright” also means copyright-like laws that apply to other kinds of works,\n        such as semiconductor masks.\n        \n        “The Program” refers to any copyrightable work licensed under this License.\n        Each licensee is addressed as “you”. “Licensees” and “recipients” may be\n        individuals or organizations.\n        \n        To “modify” a work means to copy from or adapt all or part of the work in a\n        fashion requiring copyright permission, other than the making of an exact\n        copy. The resulting work is called a “modified version” of the earlier work or\n        a work “based on” the earlier work.\n        \n        A “covered work” means either the unmodified Program or a work based on the\n        Program.\n        \n        To “propagate” a work means to do anything with it that, without permission,\n        would make you directly or secondarily liable for infringement under\n        applicable copyright law, except executing it on a computer or modifying a\n        private copy. Propagation includes copying, distribution (with or without\n        modification), making available to the public, and in some countries other\n        activities as well. To “convey” a work means any kind of propagation that\n        enables other parties to make or receive copies. Mere interaction with a user\n        through a computer network, with no transfer of a copy, is not conveying.\n        \n        An interactive user interface displays “Appropriate Legal Notices” to the\n        extent that it includes a convenient and prominently visible feature that (1)\n        displays an appropriate copyright notice, and (2) tells the user that there is\n        no warranty for the work (except to the extent that warranties are provided),\n        that licensees may convey the work under this License, and how to view a copy\n        of this License. If the interface presents a list of user commands or options,\n        such as a menu, a prominent item in the list meets this criterion.\n        \n        2. Source Code\n        \n        The “source code” for a work means the preferred form of the work for making\n        modifications to it. “Object code” means any non-source form of a work.\n        \n        A “Standard Interface” means an interface that either is an official standard\n        defined by a recognized standards body, or, in the case of interfaces\n        specified for a particular programming language, one that is widely used among\n        developers working in that language.\n        \n        The “System Libraries” of an executable work include anything, other than the\n        work as a whole, that (a) is included in the normal form of packaging a Major\n        Component, but which is not part of that Major Component, and (b) serves only\n        to enable use of the work with that Major Component, or to implement a\n        Standard Interface for which an implementation is available to the public in\n        source code form. A “Major Component”, in this context, means a major\n        essential component (kernel, window system, and so on) of the specific\n        operating system (if any) on which the executable work runs, or a compiler\n        used to produce the work, or an object code interpreter used to run it. The\n        “Corresponding Source” for a work in object code form means all the source\n        code needed to generate, install, and (for an executable work) run the object\n        code and to modify the work, including scripts to control those activities.\n        However, it does not include the work's System Libraries, or general-purpose\n        tools or generally available free programs which are used unmodified in\n        performing those activities but which are not part of the work. For example,\n        Corresponding Source includes interface definition files associated with\n        source files for the work, and the source code for shared libraries and\n        dynamically linked subprograms that the work is specifically designed to\n        require, such as by intimate data communication or control flow between those\n        subprograms and other parts of the work.\n        \n        The Corresponding Source need not include anything that users can regenerate\n        automatically from other parts of the Corresponding Source.\n        \n        The Corresponding Source for a work in source code form is that same work.\n        \n        3. Commercial use\n        \n        Commercial use of the rights granted by this License is exclusively granted to\n        the entities satisfying the following : 1° Matching with the social and common\n        company’s criteria as define by their national law, or by the European\n        Commission in its October 25th, 2011 communication, or by default by the\n        Article 1 of the French law n°2014-856 of July 31st, 2014 “relative à\n        l’économie sociale et solidaire” 2° Using a cooperative model in which workers\n        are employees\n        \n        As an exception to point I.2° of this Article, the rights previously stated\n        are also granted to: individual workers using wage portage entities working\n        with such workers; if they don’t also work with sole proprietors or\n        freelancers.\n        \n        Form a commercial use of the rights to study, execute, modify or distribute\n        any use aiming to acquire an economical advantage or a financial compensation.\n        \n        Are also considered as commercial the following uses : any use of the software\n        by an entity which purpose is to make profits any trade, online or otherwise,\n        of the software against another work protected by IP rights, only if\n        advertising or sponsorship revenues are produced, directly or indirectly, or\n        if a payment of any nature is made in relation to this trade.\n        \n        4. Basic Permissions\n        \n        All rights granted under this License are granted for the term of copyright on\n        the Program, and are irrevocable provided the stated conditions are met. This\n        License explicitly affirms your unlimited permission to run the unmodified\n        Program. The output from running a covered work is covered by this License\n        only if the output, given its content, constitutes a covered work. This\n        License acknowledges your rights of fair use or other equivalent, as provided\n        by copyright law.\n        \n        You may make, run and propagate covered works that you do not convey, without\n        conditions so long as your license otherwise remains in force. You may convey\n        covered works to others for the sole purpose of having them make modifications\n        exclusively for you, or provide you with facilities for running those works,\n        provided that you comply with the terms of this License in conveying all\n        material for which you do not control copyright. Those thus making or running\n        the covered works for you must do so exclusively on your behalf, under your\n        direction and control, on terms that prohibit them from making any copies of\n        your copyrighted material outside their relationship with you.\n        \n        Conveying under any other circumstances is permitted solely under the\n        conditions stated below. Sublicensing is not allowed; section 10 makes it\n        unnecessary.\n        \n        5. Protecting Users' Legal Rights From Anti-Circumvention Law\n        \n        No covered work shall be deemed part of an effective technological measure\n        under any applicable law fulfilling obligations under article 11 of the WIPO\n        copyright treaty adopted on 20 December 1996, or similar laws prohibiting or\n        restricting circumvention of such measures.\n        \n        When you convey a covered work, you waive any legal power to forbid\n        circumvention of technological measures to the extent such circumvention is\n        effected by exercising rights under this License with respect to the covered\n        work, and you disclaim any intention to limit operation or modification of the\n        work as a means of enforcing, against the work's users, your or third parties'\n        legal rights to forbid circumvention of technological measures.\n        \n        6. Conveying Verbatim Copies\n        \n        You may convey verbatim copies of the Program's source code as you receive it,\n        in any medium, provided that you conspicuously and appropriately publish on\n        each copy an appropriate copyright notice; keep intact all notices stating\n        that this License and any non-permissive terms added in accord with section 7\n        apply to the code; keep intact all notices of the absence of any warranty; and\n        give all recipients a copy of this License along with the Program.\n        \n        You may charge any price or no price for each copy that you convey, and you\n        may offer support or warranty protection for a fee.\n        \n        7. Conveying Modified Source Versions\n        \n        You may convey a work based on the Program, or the modifications to produce it\n        from the Program, in the form of source code under the terms of section 4,\n        provided that you also meet all of these conditions:\n        • a) The work must carry prominent notices stating that you modified it, and\n        giving a relevant date.\n        • b) The work must carry prominent notices stating that it is released under\n        this License and any conditions added under section 7. This requirement\n        modifies the requirement in section 4 to “keep intact all notices”.\n        • c) You must license the entire work, as a whole, under this License to\n        anyone who comes into possession of a copy. This License will therefore apply,\n        along with any applicable section 7 additional terms, to the whole of the\n        work, and all its parts, regardless of how they are packaged. This License\n        gives no permission to license the work in any other way, but it does not\n        invalidate such permission if you have separately received it.\n        • d) If the work has interactive user interfaces, each must display\n        Appropriate Legal Notices; however, if the Program has interactive interfaces\n        that do not display Appropriate Legal Notices, your work need not make them do\n        so.\n        \n        A compilation of a covered work with other separate and independent works,\n        which are not by their nature extensions of the covered work, and which are\n        not combined with it such as to form a larger program, in or on a volume of a\n        storage or distribution medium, is called an “aggregate” if the compilation\n        and its resulting copyright are not used to limit the access or legal rights\n        of the compilation's users beyond what the individual works permit. Inclusion\n        of a covered work in an aggregate does not cause this License to apply to the\n        other parts of the aggregate.\n        \n        8. Conveying Non-Source Forms\n        \n        You may convey a covered work in object code form under the terms of sections\n        4 and 5, provided that you also convey the machine-readable Corresponding\n        Source under the terms of this License, in one of these ways:\n        • a) Convey the object code in, or embodied in, a physical product (including\n        a physical distribution medium), accompanied by the Corresponding Source fixed\n        on a durable physical medium customarily used for software interchange.\n        • b) Convey the object code in, or embodied in, a physical product (including\n        a physical distribution medium), accompanied by a written offer, valid for at\n        least three years and valid for as long as you offer spare parts or customer\n        support for\n        that product model, to give anyone who possesses the object code either (1) a\n        copy of the Corresponding Source for all the software in the product that is\n        covered by this License, on a durable physical medium customarily used for\n        software interchange, for a price no more than your reasonable cost of\n        physically performing this conveying of source, or (2) access to copy the\n        Corresponding Source from a network server at no charge.\n        • c) Convey individual copies of the object code with a copy of the written\n        offer to provide the Corresponding Source. This alternative is allowed only\n        occasionally and noncommercially, and only if you received the object code\n        with such an offer, in accord with subsection 6b.\n        • d) Convey the object code by offering access from a designated place (gratis\n        or for a charge), and offer equivalent access to the Corresponding Source in\n        the same way through the same place at no further charge. You need not require\n        recipients to copy the Corresponding Source along with the object code. If the\n        place to copy the object code is a network server, the Corresponding Source\n        may be on a different server (operated by you or a third party) that supports\n        equivalent copying facilities, provided you maintain clear directions next to\n        the object code saying where to find the Corresponding Source. Regardless of\n        what server hosts the Corresponding Source, you remain obligated to ensure\n        that it is available for as long as needed to satisfy these requirements.\n        • e) Convey the object code using peer-to-peer transmission, provided you\n        inform other peers where the object code and Corresponding Source of the work\n        are being offered to the general public at no charge under subsection 6d.\n        \n        A separable portion of the object code, whose source code is excluded from the\n        Corresponding Source as a System Library, need not be included in conveying\n        the object code work.\n        \n        A “User Product” is either (1) a “consumer product”, which means any tangible\n        personal property which is normally used for personal, family, or household\n        purposes, or (2) anything designed or sold for incorporation into a dwelling.\n        In determining whether a product is a consumer product, doubtful cases shall\n        be resolved in favor of coverage. For a particular product received by a\n        particular user, “normally used” refers to a typical or common use of that\n        class of product, regardless of the status of the particular user or of the\n        way in which the particular user actually uses, or expects or is expected to\n        use, the product. A product is a consumer product regardless of whether the\n        product has substantial commercial, industrial or non-consumer uses, unless\n        such uses represent the only significant mode of use of the product.\n        \n        “Installation Information” for a User Product means any methods, procedures,\n        authorization keys, or other information required to install and execute\n        modified versions of a covered work in that User Product from a modified\n        version of its Corresponding Source. The information must suffice to ensure\n        that the continued functioning of the modified object code is in no case\n        prevented or interfered with solely because modification has been made.\n        \n        If you convey an object code work under this section in, or with, or\n        specifically for use in, a User Product, and the conveying occurs as part of a\n        transaction in which the right of possession and use of the User Product is\n        transferred to the recipient in perpetuity or for a fixed term (regardless of\n        how the transaction is characterized), the Corresponding Source conveyed under\n        this section must be accompanied by the Installation Information. But this\n        requirement does not apply if neither you nor any third party retains the\n        ability to install modified object code on the User Product (for example, the\n        work has been installed in ROM).\n        \n        The requirement to provide Installation Information does not include a\n        requirement to continue to provide support service, warranty, or updates for a\n        work that has been modified or installed by the recipient, or for the User\n        Product in which it has been modified or installed. Access to a network may be\n        denied when the modification itself materially and adversely affects the\n        operation of the network or violates the rules and protocols for communication\n        across the network.\n        \n        Corresponding Source conveyed, and Installation Information provided, in\n        accord with this section must be in a format that is publicly documented (and\n        with an implementation available to the public in source code form), and must\n        require no special password or key for unpacking, reading or copying.\n        \n        9. Additional Terms\n        \n        “Additional permissions” are terms that supplement the terms of this License\n        by making exceptions from one or more of its conditions. Additional\n        permissions that are applicable to the entire Program shall be treated as\n        though they were included in this License, to the extent that they are valid\n        under applicable law. If additional permissions apply only to part of the\n        Program, that part may be used separately under those permissions, but the\n        entire Program remains governed by this License without regard to the\n        additional permissions.\n        \n        When you convey a copy of a covered work, you may at your option remove any\n        additional permissions from that copy, or from any part of it. (Additional\n        permissions may be written to require their own removal in certain cases when\n        you modify the work.) You may place additional permissions on material, added\n        by you to a covered work, for which you have or can give appropriate copyright\n        permission.\n        \n        Notwithstanding any other provision of this License, for material you add to a\n        covered work, you may (if authorized by the copyright holders of that\n        material) supplement the terms of this License with terms:\n        • a) Disclaiming warranty or limiting liability differently from the terms of\n        sections 15 and 16 of this License; or\n        • b) Requiring preservation of specified reasonable legal notices or author\n        attributions in that material or in the Appropriate Legal Notices displayed by\n        works containing it; or\n        • c) Prohibiting misrepresentation of the origin of that material, or\n        requiring that modified versions of such material be marked in reasonable ways\n        as different from the original version; or\n        • d) Limiting the use for publicity purposes of names of licensors or authors\n        of the material; or\n        • e) Declining to grant rights under trademark law for use of some trade\n        names, trademarks, or service marks; or\n        • f) Requiring indemnification of licensors and authors of that material by\n        anyone who conveys the material (or modified versions of it) with contractual\n        assumptions of liability to the recipient, for any liability that these\n        contractual assumptions directly impose on those licensors and authors.\n        \n        All other non-permissive additional terms are considered “further\n        restrictions” within the meaning of section 10. If the Program as you received\n        it, or any part of it, contains a notice stating that it is governed by this\n        License along with a term that is a further restriction, you may remove that\n        term. If a license document contains a further restriction but permits\n        relicensing or conveying under this License, you may add to a covered work\n        material governed by the terms of that license document, provided that the\n        further restriction does not survive such relicensing or conveying.\n        \n        If you add terms to a covered work in accord with this section, you must\n        place, in the relevant source files, a statement of the additional terms that\n        apply to those files, or a notice indicating where to find the applicable\n        terms.\n        \n        Additional terms, permissive or non-permissive, may be stated in the form of a\n        separately written license, or stated as exceptions; the above requirements\n        apply either way.\n        \n        10. Termination\n        \n        You may not propagate or modify a covered work except as expressly provided\n        under this License. Any attempt otherwise to propagate or modify it is void,\n        and will automatically terminate your rights under this License (including any\n        patent licenses granted under the third paragraph of section 11).\n        \n        However, if you cease all violation of this License, then your license from a\n        particular copyright holder is reinstated (a) provisionally, unless and until\n        the copyright holder explicitly and finally terminates your license, and (b)\n        permanently, if the copyright holder fails to notify you of the violation by\n        some reasonable means prior to 60 days after the cessation.\n        \n        Moreover, your license from a particular copyright holder is reinstated\n        permanently if the copyright holder notifies you of the violation by some\n        reasonable means, this is the first time you have received notice of violation\n        of this License (for any work) from that copyright holder, and you cure the\n        violation prior to 30 days after your receipt of the notice.\n        \n        Termination of your rights under this section does not terminate the licenses\n        of parties who have received copies or rights from you under this License. If\n        your rights have been terminated and not permanently reinstated, you do not\n        qualify to receive new licenses for the same material under section 10.\n        \n        11. Acceptance Not Required for Having Copies\n        \n        You are not required to accept this License in order to receive or run a copy\n        of the Program. Ancillary propagation of a covered work occurring solely as a\n        consequence of using peer-to-peer transmission to receive a copy likewise does\n        not require acceptance. However, nothing other than this License grants you\n        permission to propagate or modify any covered work. These actions infringe\n        copyright if you do not accept this License. Therefore, by modifying or\n        propagating a covered work, you indicate your acceptance of this License to do\n        so.\n        \n        12. Automatic Licensing of Downstream Recipients\n        \n        Each time you convey a covered work, the recipient automatically receives a\n        license from the original licensors, to run, modify and propagate that work,\n        subject to this License. You are not responsible for enforcing compliance by\n        third parties with this License. An “entity transaction” is a transaction\n        transferring control of an organization, or substantially all assets of one,\n        or subdividing an organization, or merging organizations. If propagation of a\n        covered work results from an entity transaction, each party to that\n        transaction who receives a copy of the work also receives whatever licenses to\n        the work the party's predecessor in interest had or could give under the\n        previous paragraph, plus a right to possession of the Corresponding Source of\n        the work from the predecessor in interest, if the predecessor has it or can\n        get it with reasonable efforts.\n        \n        You may not impose any further restrictions on the exercise of the rights\n        granted or affirmed under this License. For example, you may not impose a\n        license fee, royalty, or other charge for exercise of rights granted under\n        this License, and you may not initiate litigation (including a cross-claim or\n        counterclaim in a lawsuit) alleging that any patent claim is infringed by\n        making, using, selling, offering for sale, or importing the Program or any\n        portion of it.\n        \n        13. Patents\n        \n        A “contributor” is a copyright holder who authorizes use under this License of\n        the Program or a work on which the Program is based. The work thus licensed is\n        called the contributor's “contributor version”.\n        \n        A contributor's “essential patent claims” are all patent claims owned or\n        controlled by the contributor, whether already acquired or hereafter acquired,\n        that would be infringed by some manner, permitted by this License, of making,\n        using, or selling its contributor version, but do not include claims that\n        would be infringed only as a consequence of further modification of the\n        contributor version. For purposes of this definition, “control” includes the\n        right to grant patent sublicenses in a manner consistent with the requirements\n        of this License.\n        \n        Each contributor grants you a non-exclusive, worldwide, royalty-free patent\n        license under the contributor's essential patent claims, to make, use, sell,\n        offer for sale, import and otherwise run, modify and propagate the contents of\n        its contributor version.\n        \n        In the following three paragraphs, a “patent license” is any express agreement\n        or commitment, however denominated, not to enforce a patent (such as an\n        express permission to practice a patent or covenant not to sue for patent\n        infringement). To “grant” such a patent license to a party means to make such\n        an agreement or commitment not to enforce a patent against the party.\n        \n        If you convey a covered work, knowingly relying on a patent license, and the\n        Corresponding Source of the work is not available for anyone to copy, free of\n        charge and under the terms of this License, through a publicly available\n        network server or other readily accessible means, then you must either (1)\n        cause the Corresponding Source to be so available, or (2) arrange to deprive\n        yourself of the benefit of the patent license for this particular work, or (3)\n        arrange, in a manner consistent with the requirements of this License, to\n        extend the patent license to downstream recipients. “Knowingly relying” means\n        you have actual knowledge that, but for the patent license, your conveying the\n        covered work in a country, or your recipient's use of the covered work in a\n        country, would infringe one or more identifiable patents in that country that\n        you have reason to believe are valid.\n        \n        If, pursuant to or in connection with a single transaction or arrangement, you\n        convey, or propagate by procuring conveyance of, a covered work, and grant a\n        patent license to some of the parties receiving the covered work authorizing\n        them to use, propagate, modify or convey a specific copy of the covered work,\n        then the patent license you grant is automatically extended to all recipients\n        of the covered work and works based on it. A patent license is\n        “discriminatory” if it does not include within the scope of its coverage,\n        prohibits the exercise of, or is conditioned on the non-exercise of one or\n        more of the rights that are specifically granted under this License. You may\n        not convey a covered work if you are a party to an arrangement with a third\n        party that is in the business of distributing software, under which you make\n        payment to the third party based on the extent of your activity of conveying\n        the work, and under which the third party grants, to any of the parties who\n        would receive the covered work from you, a discriminatory patent license (a)\n        in connection with copies of the covered work conveyed by you (or copies made\n        from those copies), or (b) primarily for and in connection with specific\n        products or compilations that contain the covered work, unless you entered\n        into that arrangement, or that patent license was granted, prior to 28 March\n        2007.\n        \n        Nothing in this License shall be construed as excluding or limiting any\n        implied license or other defenses to infringement that may otherwise be\n        available to you under applicable patent law.\n        \n        14. No Surrender of Others' Freedom\n        \n        If conditions are imposed on you (whether by court order, agreement or\n        otherwise) that contradict the conditions of this License, they do not excuse\n        you from the conditions of this License. If you cannot convey a covered work\n        so as to satisfy simultaneously your obligations under this License and any\n        other pertinent obligations, then as a consequence you may not convey it at\n        all. For example, if you agree to terms that obligate you to collect a royalty\n        for further conveying from those to whom you convey the Program, the only way\n        you could satisfy both those terms and this License would be to refrain\n        entirely from conveying the Program.\n        \n        15. Disclaimer of Warranty\n        \n        THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE\n        LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR\n        OTHER PARTIES PROVIDE THE PROGRAM “AS IS” WITHOUT WARRANTY OF ANY KIND, EITHER\n        EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n        MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO\n        THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU. SHOULD THE PROGRAM\n        PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR\n        CORRECTION.\n        \n        16. Limitation of Liability\n        \n        IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY\n        COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS THE PROGRAM\n        AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL,\n        SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR\n        INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR\n        DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR\n        A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH\n        HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n        \n        17. Interpretation of Sections 15 and 16\n        \n        If the disclaimer of warranty and limitation of liability provided above\n        cannot be given local legal effect according to their terms, reviewing courts\n        shall apply local law that most closely approximates an absolute waiver of all\n        civil liability in connection with the Program, unless a warranty or\n        assumption of liability accompanies a copy of the Program in return for a fee.\n        ",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": null,
  "repository": null,
  "repository_source": null,
  "download": null,
  "download_source": null,
  "pub_date": 1769683575,
  "project_urls": {},
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}