{
  "name": "bumps",
  "version": "1.0.4b0",
  "summary": "Data fitting with bayesian uncertainty analysis",
  "license": "Bumps is in the public domain.\n        \n        Code in individual files has copyright and license set by individual authors.\n        \n        bumps.gui, bumps.quasinewton\n        ----------------------------\n        \n        Copyright (C) 2006-2011, University of Maryland\n        \n        Permission is hereby granted, free of charge, to any person obtaining a copy\n        of this software and associated documentation files (the \"Software\"), to deal\n        in the Software without restriction, including without limitation the rights\n        to use, copy, modify, merge, publish, distribute, sublicense, and/ or sell\n        copies of the Software, and to permit persons to whom the Software is\n        furnished to do so, subject to the following conditions:\n        \n        The above copyright notice and this permission notice shall be included in\n        all copies or substantial portions of the Software.\n        \n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n        FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n        AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n        LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n        OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\n        THE SOFTWARE.\n        \n        \n        DREAM\n        -----\n        \n        Copyright (c) 2008, Los Alamos National Security, LLC\n        All rights reserved.\n        \n        Copyright 2008. Los Alamos National Security, LLC. This software was produced under U.S.\n        Government contract DE-AC52-06NA25396 for Los Alamos National Laboratory (LANL), which is\n        operated by Los Alamos National Security, LLC for the U.S. Department of Energy. The U.S.\n        Government has rights to use, reproduce, and distribute this software.\n        \n        NEITHER THE GOVERNMENT NOR LOS ALAMOS NATIONAL SECURITY, LLC MAKES A NY WARRANTY, EXPRESS OR\n        IMPLIED, OR ASSUMES ANY LIABILITY FOR THE USE OF THIS SOFTWARE.  If software is modified to\n        produce derivative works, such modified software should be clearly marked, so as not to\n        confuse it with the version available from LANL.\n        \n        Additionally, redistribution and use in source and binary forms, with or without\n        modification, are permitted provided that the following conditions are met:\n        \n        * Redistributions of source code must retain the above copyright notice, this list of\n          conditions and the following disclaimer.\n        * Redistributions in binary form must reproduce the above copyright notice, this list of\n          conditions and the following disclaimer in the documentation and/or other materials\n          provided with the distribution.\n        * Neither the name of Los Alamos National Security, LLC, Los Alamos National Laboratory, LANL\n          the U.S. Government, nor the names of its contributors may be used to endorse or promote\n          products derived from this software without specific prior written permission.\n        \n        THIS SOFTWARE IS PROVIDED BY LOS ALAMOS NATIONAL SECURITY, LLC AND CONTRIBUTORS \"AS IS\" AND\n        ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\n        OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL LOS\n        ALAMOS NATIONAL SECURITY, LLC OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n        SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n        SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n        HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n        (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,\n        EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n        \n        Random123\n        ---------\n        \n        Copyright 2010-2012, D. E. Shaw Research.\n        All rights reserved.\n        \n        Redistribution and use in source and binary forms, with or without\n        modification, are permitted provided that the following conditions are\n        met:\n        \n        * Redistributions of source code must retain the above copyright\n          notice, this list of conditions, and the following disclaimer.\n        \n        * Redistributions in binary form must reproduce the above copyright\n          notice, this list of conditions, and the following disclaimer in the\n          documentation and/or other materials provided with the distribution.\n        \n        * Neither the name of D. E. Shaw Research nor the names of its\n          contributors may be used to endorse or promote products derived from\n          this software without specific prior written permission.\n        \n        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n        \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n        LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n        A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n        OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n        SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n        LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n        DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n        THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n        (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n        OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n        \n        MPFit\n        -----\n        \n        The original version of this software, called LMFIT, was written in FORTRAN\n        as part of the MINPACK-1 package by XXX.\n        \n        Craig Markwardt converted the FORTRAN code to IDL.  The information for the\n        IDL version is:\n        \n             Craig B. Markwardt, NASA/GSFC Code 662, Greenbelt, MD 20770\n             craigm@lheamail.gsfc.nasa.gov\n             UPDATED VERSIONs can be found on my WEB PAGE:\n        \n                http://cow.physics.wisc.edu/~craigm/idl/idl.html\n        \n        Mark Rivers created this Python version from Craig's IDL version.\n            Mark Rivers, University of Chicago\n            Building 434A, Argonne National Laboratory\n            9700 South Cass Avenue, Argonne, IL 60439\n            rivers@cars.uchicago.edu\n            Updated versions can be found at http://cars.uchicago.edu/software\n        \n        bumps.simplex\n        -------------\n        \n        ::\n        \n            # ******NOTICE***************\n            # From optimize.py module by Travis E. Oliphant\n            #\n            # You may copy and use this module as you see fit with no\n            # guarantee implied provided you keep this notice in all copies.\n            # *****END NOTICE************\n        \n        bumps.cli.warn_with_traceback\n        -----------------------------\n        \n        From http://stackoverflow.com/questions/22373927/get-traceback-of-warnings\n        answered by mgab (2014-03-13)\n        edited by Gareth Rees (2015-11-28)\n        \n        \n        bumps.dream.entropy.Timer\n        -------------------------\n        \n        Based on: Eli Bendersky https://stackoverflow.com/a/5849861\n        Extended with tic/toc by Paul Kienzle\n        \n        bumps.dream.entropy.MultivariateT.rvs\n        -------------------------------------\n        \n        From farhawa on stack overflow\n        https://stackoverflow.com/questions/29798795/multivariate-student-t-distribution-with-python\n        \n        \n        bumps.lsqerror.comb\n        -------------------\n        \n        From dheerosaur\n        https://stackoverflow.com/questions/4941753/is-there-a-math-ncr-function-in-python/4941932#4941932\n        ",
  "license_expression": null,
  "home_page": "https://bumps.readthedocs.io",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/bumps/bumps",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1770749128,
  "project_urls": {
    "documentation": "https://bumps.readthedocs.io",
    "homepage": "https://bumps.readthedocs.io",
    "repository": "https://github.com/bumps/bumps"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}