{
  "name": "bitpulse",
  "version": "0.1.1",
  "summary": "Automatically capture and send LLM trace data from GraphBit applications to your observability API endpoint",
  "license": "# GRAPHBIT FRAMEWORK LICENSE\n        \n        Copyright © 2023–2025 InfinitiBit GmbH. All rights reserved.\n        \n        By downloading, installing, or using the GraphBit framework (the “framework”), you agree to this License.\n        \n        ## 1. Parties\n        \n        Licensor: **InfinitiBit GmbH**, Heiglhofstr. 90, 81377 Munich, Germany.\n        Licensee: The individual or legal entity using the framework.\n        \n        ## 2. Definitions\n        \n        * **framework**: The complete source code and related materials provided by Licensor, including the Rust core, Python wrapper, scripts, libraries, and configuration described in the GraphBit documentation.\n        * **Outputs**: Results, data, and artifacts generated by the framework.\n        * **Enterprise Use**: Any use not expressly permitted under Model A or Model B, including but not limited to: (i) use by organizations with more than ten (10) employees or more than ten (10) active users, (ii) embedding in commercial products/services, or (iii) offering the framework or derivative works as a hosted service (e.g., API, SaaS, managed platform).\n        * **Active Users**: All persons using the framework, including employees, contractors, and/or end users accessing a product or service built on the framework.\n        \n        ## 3. License Models\n        \n        Any use not covered by Model A or Model B requires **Model C (Enterprise)** and a separate, executed license.\n        \n        ### Model A — Free Use\n        \n        **Eligibility:** Natural persons, academic/research institutions, and companies/startups with up to ten (10) employees **and** up to ten (10) Active Users.\n        **Grant:** Non-exclusive, revocable, non-transferable right to install and use the framework.\n        **Restrictions:** Redistribution (modified or unmodified) is **prohibited**.\n        \n        ### Model B — Free Trial (Evaluation Only)\n        \n        **Eligibility:** Legal entities/companies.\n        **Grant:** Non-exclusive, revocable, non-transferable right to install and use the framework **solely for internal evaluation** for up to thirty (30) consecutive days.\n        **Restrictions:** Redistribution and any commercial or production use are **prohibited**.\n        \n        ### Model C — Enterprise License (Paid)\n        \n        **Eligibility:** Anyone not covered by Model A or B.\n        **Grant:** Rights for commercial/production use are available **only** under a separately executed Enterprise License with agreed fees and terms.\n        **Restrictions:** **No** redistribution rights are granted by this public License. **Any** redistribution or sublicensing (modified or unmodified) must be expressly permitted in the separate Enterprise License.\n        \n        ## 4. Ownership of Outputs\n        \n        You own your **Outputs**. However, Outputs, logs, artifacts, or derived model weights may **not** be used to train, fine-tune, or distill any **competing large language model** without an Enterprise License.\n        \n        ## 5. Responsible Use (Prohibited Uses)\n        \n        You shall not use the framework or Outputs for:\n        \n        * illegal activities;\n        * surveillance without lawful authority;\n        * military or autonomous weapon systems;\n        * disinformation;\n        * life-critical systems (including medical devices, aviation, nuclear) **without** an Enterprise License;\n        * any use reasonably expected to cause material harm to individuals, society, or the environment.\n        \n        ## 6. Additional Restrictions\n        \n        Except as expressly permitted above, you shall **not**:\n        \n        * copy, distribute, publish, sublicense, rent, lease, or otherwise make the framework available to third parties;\n        * modify, adapt, or create derivative works **for any form of distribution**;\n        * remove or alter any copyright, attribution, or proprietary notices.\n        \n        ## 7. Attribution & Trademarks\n        \n        If you publicly reference or showcase the framework (e.g., in documentation, UI credits, research papers, product pages) where such use is **permitted under this License or a separate Enterprise License**, include the attribution:\n        \n        > “Based on GraphBit by InfinitiBit GmbH https://graphbit.ai\n        \n        No rights are granted to use the Licensor’s names, logos, or trademarks beyond the attribution above. **This clause does not grant any right to distribute the framework.**\n        \n        ## 8. Termination\n        \n        Licensor may terminate this License with one month’s notice to the end of the following month. Either party may terminate for cause without notice if the other party materially breaches this License and fails to cure within a reasonable period after written notice, or upon the Licensee’s insolvency, or in case of actions likely to cause significant reputational damage to Licensor.\n        Upon termination, you must immediately stop using the framework and destroy all copies. Unauthorized Enterprise Use obligates Licensee to pay retroactive license fees and damages.\n        \n        ## 9. Warranty Disclaimer\n        \n        THE FRAMEWORK IS PROVIDED “AS IS,” as described in the GraphBit documentation, **without** warranties of any kind, express or implied, including merchantability, fitness for a particular purpose, or non-infringement.\n        \n        ## 10. Limitation of Liability\n        \n        Licensor is liable only for defects and damages caused by intentional or grossly negligent conduct, and for damages resulting from injury to life, limb, or health, in accordance with applicable law.\n        \n        ## 11. Governing Law & Jurisdiction\n        \n        This License is governed by the laws of the Federal Republic of Germany. Exclusive jurisdiction lies with the competent courts of Munich, Germany.\n        \n        ## 12. Contact\n        \n        For Enterprise Licensing or commercial inquiries:\n        [accounting@infinitibit.com](mailto:accounting@infinitibit.com) — [https://graphbit.ai](https://graphbit.ai)\n        ",
  "license_expression": null,
  "home_page": "https://github.com/InfinitiBit/bitpulse",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/InfinitiBit/bitpulse",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1770734560,
  "project_urls": {
    "Homepage": "https://github.com/InfinitiBit/bitpulse",
    "Repository": "https://github.com/InfinitiBit/bitpulse",
    "Bug Tracker": "https://github.com/InfinitiBit/bitpulse/issues",
    "Documentation": "https://docs.graphbit.ai"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}