{
  "name": "agentify-toolkit",
  "version": "0.15.0",
  "summary": "Python Toolkit for Declarative AI Agent Development",
  "license": "Apache License\n                                   Version 2.0, January 2004\n                                http://www.apache.org/licenses/\n        \n        TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n        \n        1.  Definitions.\n            \"License\" shall mean the terms and conditions for use, reproduction,\n            and distribution as defined by Sections 1 through 9 of this document.\n        \n            \"Licensor\" shall mean the copyright owner or entity authorized by\n            the copyright owner that is granting the License.\n        \n            \"Legal Entity\" shall mean the union of the acting entity and all\n            other entities that control, are controlled by, or are under common\n            control with that entity.\n        \n            \"You\" (or \"Your\") shall mean an individual or Legal Entity\n            exercising permissions granted by this License.\n        \n            \"Source\" form shall mean the preferred form for making modifications,\n            including but not limited to software source code, documentation\n            source, and configuration files.\n        \n            \"Object\" form shall mean any form resulting from mechanical\n            transformation or translation of a Source form, including but\n            not limited to compiled object code, generated documentation,\n            and conversions to other media types.\n        \n            \"Work\" shall mean the work of authorship, whether in Source or\n            Object form, made available under the License, as indicated by a\n            copyright notice that is included in or attached to the work.\n        \n            \"Derivative Works\" shall mean any work, whether in Source or Object\n            form, that is based on (or derived from) the Work and for which the\n            editorial revisions, annotations, elaborations, or other modifications\n            represent, as a whole, an original work of authorship.\n        \n            \"Contribution\" shall mean any work of authorship, including\n            the original version of the Work and any modifications or additions\n            to that Work or Derivative Works thereof, that is intentionally\n            submitted to Licensor for inclusion in the Work by the copyright owner\n            or by an individual or Legal Entity authorized to submit on behalf of\n            the copyright owner.\n        \n            \"Contributor\" shall mean Licensor and any individual or Legal Entity\n            on behalf of whom a Contribution has been received by Licensor and\n            subsequently incorporated within the Work.\n        \n        2.  Grant of Copyright License.\n            Subject to the terms and conditions of this License, each Contributor\n            hereby grants to You a perpetual, worldwide, non-exclusive, no-charge,\n            royalty-free, irrevocable copyright license to reproduce, prepare\n            Derivative Works of, publicly display, publicly perform, sublicense,\n            and distribute the Work and such Derivative Works in Source or Object\n            form.\n        \n        3.  Grant of Patent License.\n            Subject to the terms and conditions of this License, each Contributor\n            hereby grants to You a perpetual, worldwide, non-exclusive, no-charge,\n            royalty-free, irrevocable patent license to make, have made, use,\n            offer to sell, sell, import, and otherwise transfer the Work.\n        \n        4.  Redistribution.\n            You may reproduce and distribute copies of the Work or Derivative\n            Works thereof in any medium, with or without modifications, provided\n            that You meet the following conditions:\n        \n            (a) You must give any other recipients of the Work or\n            Derivative Works a copy of this License; and\n        \n            (b) You must cause any modified files to carry prominent notices\n            stating that You changed the files; and\n        \n            (c) You must retain, in the Source form of any Derivative Works,\n            all copyright, patent, trademark, and attribution notices.\n        \n        5.  Submission of Contributions.\n            Unless You explicitly state otherwise, any Contribution intentionally\n            submitted for inclusion in the Work shall be under the terms and\n            conditions of this License.\n        \n        6.  Trademarks.\n            This License does not grant permission to use the trade names,\n            trademarks, service marks, or product names of the Licensor.\n        \n        7.  Disclaimer of Warranty.\n            Unless required by applicable law or agreed to in writing, Licensor\n            provides the Work on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS\n            OF ANY KIND.\n        \n        8.  Limitation of Liability.\n            In no event shall any Contributor be liable for any damages arising\n            from the use of the Work.\n        \n        9.  Accepting Warranty or Additional Liability.\n            While redistributing the Work, You may choose to offer support or\n            warranty obligations on Your own behalf.\n        \n        END OF TERMS AND CONDITIONS\n        ",
  "license_expression": null,
  "home_page": "https://github.com/backplane-cloud/agentify-toolkit",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/backplane-cloud/agentify-toolkit",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1769633405,
  "project_urls": {
    "Issues": "https://github.com/backplane-cloud/agentify-toolkit/issues",
    "Homepage": "https://github.com/backplane-cloud/agentify-toolkit"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}