{
  "name": "psevencore",
  "version": "2026.2.11",
  "summary": "pSeven Core is an integrated toolkit for design space exploration, optimization, and predictive modeling.",
  "license": "# End-User License Agreement\n        \n        By installing this Software You confirm that You are the Authorized User, and\n        that You have read and accept the terms and conditions of this End-User License\n        Agreement (**\"Agreement\"**).\n        \n        BY CLICKING ON THE \"AGREE\" BUTTON AND/OR BY USING THIS SOFTWARE, YOU CONFIRM,\n        THAT YOU HAVE READ, UNDERSTOOD AND AGREE TO AND UNDERTAKE TO OBSERVE THE TERMS\n        AND CONDITIONS OF THIS AGREEMENT. IF YOU ARE NOT THE AUTHORIZED USER AND/OR DO\n        NOT AGREE WITH THIS AGREEMENT, PLEASE CEASE INSTALLATION AND DO NOT USE THE\n        SOFTWARE. FOR A FULL REFUND, YOU SHOULD IMMEDIATELY RETURN THE SOFTWARE TOGETHER\n        WITH THE PURCHASE CONFIRMATION DOCUMENTS TO THE COMPANY OR TO THE AUTHORIZED\n        DEALER FROM WHOM YOU HAVE PURCHASED THE SOFTWARE LICENSE.\n        \n        \n        ## 1. Definitions\n        \n        **\"You\"** and **\"Yours\"** in all forms refers to the purchaser of Software\n        indicated in Purchase Confirmation Documents in accordance with this Agreement\n        and may refer to either an individual or a legal entity of any organizational\n        form.\n        \n        **\"Company\"** (or **\"Licensor\"**) refers to \"pSeven SAS\" (SIREN 821900115),\n        incorporated and acting in accordance with the legislation of France,\n        registered and located at 42 AV DU GENERAL DE CROUTTE 31100 TOULOUSE, and its\n        affiliated companies.\n        \n        **\"Authorized Dealer\"** refers to a third party which has been authorized by\n        the Company to distribute Software in any way allowed by applicable legislation,\n        sublicensing inclusive.\n        \n        **\"Authorized User\"** means (i) You, if You are a natural person who has\n        purchased License for Your personal needs not related with business activities\n        (**\"Individual User\"**), (ii) Your employees, if the License is purchased by\n        a legal entity or individual entrepreneur (\"**Corporate User**\"), including\n        employees of Your divisions which are not legal entities, but excluding\n        employees of other legal entities or individual entrepreneurs (including\n        employees of any affiliated legal entity or legal entity which is part of\n        the group of affiliated legal entities); and Your consultants, agents and\n        contractors working on the territory of Your enterprise, provided that they\n        are not competitors of the Company and agreed in writing with the terms and\n        conditions of Software use and confidentiality. At that, confidentiality\n        obligations should be no less strict than those provided for by this Agreement.\n        \n        **\"Documentation\"** refers to materials and documents, manual and technical\n        specifications inclusive, that are provided by the Company for purposes of\n        the Software use.\n        \n        **\"Computer Identifier\"** refers to a unique computer identifier or any other\n        information required by the Company for License Key creation purposes.\n        \n        **\"License Key\"** refers to a unique file created on the basis of Computer\n        Identifier submitted by You, to ensure access of Authorized Users to the\n        Software modules in respect of which the License was obtained, as well as\n        to limit the possibility of simultaneous access to the relevant Software\n        modules to the number of Authorized Users that conforms to the type of the\n        License granted.\n        \n        **\"License\"** refers to the right to use the Software provided under License\n        or Sublicense Agreement pursuant to Paragraph 2.1 hereof.\n        \n        **\"Purchase Confirmation Documents\"** refers to invoice, deed of acceptance or\n        any other documents confirming purchase and payment that may be drawn up by\n        the Company or Authorized Dealer in electronic or written form. Purchase\n        Confirmation Documents are an integral part of the License.\n        \n        **\"Software\"** refers to the software, exclusive rights to which belong to\n        the Company, and which is listed in specification provided in Exhibit 1 hereto,\n        as well as in Purchase Confirmation Documents.\n        \n        **\"Taxes\"** means all federal, state, local and other taxes, including sales\n        tax, use and property taxes related to this Agreement, Your use of the Software\n        or any services provided to You and related to the Software, excluding taxes\n        to be paid due to the Company net income.\n        \n        **\"Territory\"** refers to the territory of countries that are covered by\n        the License. The list of such countries is provided in Purchase Confirmation\n        Documents.\n        \n        **\"Type of License\"** refers to the type of license granted to You and\n        indicated in Purchase Confirmation Documents and in Section 5 hereof,\n        including limitations of the number of Authorized Users indicated there.\n        \n        \n        ## 2. The License and the Agreement\n        \n        2.1. The right to use the Software is provided to You under:\n        \n        -   license contract between You (Individual User or Corporate User) and the\n            Company, which consists of the Agreement and Purchase Confirmation\n            Documents (**\"License Agreement\"**), or\n        -   sublicense agreement between You and the Authorized Dealer\n            (**\"Sublicense Agreement\"**).\n        \n        2.2. This Agreement contains terms and conditions of the Software use specified\n        by the Company as a Software right holder and shall be binding upon both\n        Authorized Users and Authorized Dealers, irrespective of whether the Agreement\n        is a part of the License Agreement or is included in the text of or as a\n        reference to in the Sublicense Agreement. In the case of any discrepancy between\n        the Agreement and the Sublicense Agreement, the terms and conditions of the\n        Agreement shall prevail, unless otherwise expressly provided for by Purchase\n        Confirmation Documents.\n        \n        2.3. The Company shall have the right to amend the content of this Agreement\n        at any time and notify You thereof by publishing the updated version of the\n        Agreement on the website https://www.pseven.io/permalink/pseven-eula. You accept\n        and undertake to observe the terms and conditions of the amended Agreement if\n        You continue using the Software after publication of the amendments thereto on\n        the website indicated in this paragraph above. If You do not agree with the\n        terms and conditions of the amended Agreement, You should immediately remove\n        the Software from all media and refer to the Company or Authorized Dealer for\n        the refund of fees paid for the provided rights for the remaining time period.\n        \n        \n        ## 3. Rights to the Software and Documentation\n        \n        3.1. You acknowledge that the Company owns all proprietary rights to the\n        Software, including, but not limited to, all patent rights, copyrights, rights\n        to trade secret, trade name, names, software keys, audio-, sound- and visual\n        effects, themes, characters, character names, stories, dialogs, artworks,\n        graphics, musical works, moral rights of the author, both registered and\n        unregistered, and other proprietary rights, in and to the Software and any\n        corrections, bug fixes, enhancements, updates or other modifications, including\n        custom modifications in accordance with Your individual requirements. Exclusive\n        rights to the Software and Documentation (as an object of copyright) shall\n        belong to the Company. Software and Documentation may contain some parts\n        belonging to third parties that have entered into license agreements for the\n        use of these parts as part of the Software and/or Documentation.\n        \n        3.2. The Software and Documentation are protected by the applicable national\n        legislation, copyright laws and international agreements on intellectual\n        property. Rights to this Software and to any of its copies, as well as all\n        intellectual property rights to the Software, in any case shall at all times\n        remain with the Company or with the relevant third parties.\n        \n        \n        ## 4. Grant of License\n        \n        4.1. The License is granted to You as a simple (non-exclusive), nontransferable\n        (except as may be required by the applicable law) license for the Software with\n        the right to allow Authorized Users to use the Software in the Territory in\n        accordance with the Agreement and Documentation. This License is granted to You\n        without the right to sublicense and without the right to assign Your rights and\n        obligations under the Agreement to any third parties.\n        \n        4.2. This Agreement shall cover only the Software and does not grant a license\n        to any other intellectual property of the Company or its suppliers and\n        contractors, including inventions, utility models, industrial designs, know-how,\n        company names and trademarks.\n        \n        4.3. If there is a possibility that the number of Authorized Users of the\n        Software may exceed the number provided for by the license, You should implement\n        the mechanism or process which would guarantee that the number of Authorized\n        Users of this Software does not exceed the number allowed by the license\n        purchased by You. The Software is considered used by one user each time when\n        it or any of its parts is loaded into the memory of PC. The Software is not\n        considered used by one user for the purposes of this Section, if an original\n        or a copy of the Software is kept on a server or is available through a server\n        with the only purpose of use by network computers.\n        \n        4.4. The Company shall have the right to integrate means of protection into\n        the Software that are aimed to confirm Your use of the Software in accordance\n        with this Agreement. Such means of protection may process data on the use of\n        the Software by Authorized Users, record the number of copies of the Software,\n        as well as transfer received data to the Company through any available means\n        of communication.\n        \n        4.5. The Company shall retain the right to use license management software\n        and/or License Keys to exercise control of Your use of the Software. You shall\n        not have the right to undertake any steps aimed against the use by the Company\n        of the abovementioned means of protection and control. Use of the Software\n        without the License Key provided by the Company after the payment of license\n        fee thereunder is prohibited and shall be regarded as violation of intellectual\n        property rights and prosecuted in accordance with the applicable legislation,\n        up to the imposition of criminal liability.\n        \n        4.6. If the Software is purchased for upgrade purposes or is provided by the\n        Company as an upgrade of the previous version of the Software, such Software\n        may be used solely as a substitution for the previous version and cannot be\n        used separately from or simultaneously with previous versions of the Software.\n        \n        4.7. The Company shall have the right to correct errors and make amendments to\n        the Software, including changes in its functionality, issue upgrades and new\n        versions without Your preliminary notification. New versions issued by the\n        Company may contain correction of errors and/or new or improved set of\n        functions. A new version may be a \"correcting release\" marked by change of the\n        first right digit in the release number (e.g. from V1.0.0 to V1.0.1), \"minor\n        release\" marked by the change of the second right digit in the release number\n        (e.g. from V1.0.0 to V1.1.0), or \"major release\" marked by the change of the\n        first left digit in the release number (e.g. from V1.0.0 to V2.0.0). \"Major\n        release\" here and later on shall be referred to as \"Main Release\", while\n        \"correcting release\" and \"minor release\" here and later on shall be referred to\n        as \"Updated Version\". Updated Version may contain corrections of known errors\n        and minor functionality changes. Main Release is a new version of the Software\n        containing fundamentally new or improved set of functions. You shall have the\n        right to receive Updated Versions and Main Releases of the Software provided\n        that You have paid the maintenance fee according to Paragraph 6.2. This right\n        shall not cover releases, modules, options, future products or improved\n        functionality or work characteristics of the Software created by the Company\n        as individual products for an individual client, as well as licenses offered\n        not as an upgrade within the Software maintenance provided to clients, as a\n        separate product.\n        \n        4.8. You shall have the right to create and store one backup copy of the\n        Software. You shall keep and accurately reproduce all notifications of\n        intellectual property rights on all originals and copies of the Software.\n        All exclusive rights to originals and copies of the Software shall belong to\n        the Company, and any use thereof shall be governed by this Agreement.\n        \n        4.9. You shall not have the right to publish or transfer the Software or\n        License Key to any third parties. After installation and successful launch of\n        a new version of the Software, the previous version of the Software in Your\n        possession (including any backup copies) should be removed from all media\n        within ten (10) calendar days without any possibility of recovery.\n        \n        4.10. You shall keep record of the Software licensed under the License,\n        locations of all the originals and copies and identifying features of\n        working places and servers on which the Software is installed.\n        \n        4.11. The Company and/or Authorized Dealer shall have the right to conduct\n        audit to check Your observance of the Agreement during working hours and with\n        preliminary notification. You shall not interfere with such an audit and shall\n        provide the Company or its authorized representative with access to premises,\n        working places, computers, servers, and documents. At that, the Company shall\n        have the right to determine the list of authorized persons at its discretion\n        and to notify You thereof in any way, including notifications via e-mail.\n        \n        \n        ## 5. Types of Licenses\n        \n        5.1. Below You shall find possible types of Software licenses which may be\n        granted to You under the License. Type of license shall be indicated in\n        Purchase Confirmation Documents and, except for special types of licenses,\n        shall be determined by sum of the following conditions:\n        \n        -   Type of license depending on the period of use;\n        -   Type of license depending on the way of binding.\n        \n        5.2. Types of licenses depending on the period of use:\n        \n        5.2.1. **\"Perpetual\"** license shall be granted for an unlimited time\n        period which does not exceed the period of validity of exclusive rights to\n        the Software.\n        \n        5.2.2. **\"One-year Subscription\"** license is limited by one year from the\n        date of Your receipt of the License Key. Upon expiration of the mentioned time\n        period, the validity term of One-Year Subscription license may be repeatedly\n        extended for the next year upon agreement of the parties. One-year Subscription\n        license may be by no means exchanged for Perpetual license. The Company shall\n        have the right to cease granting one-year subscription licenses with respect\n        to some of its products.\n        \n        5.3. Types of licenses depending on the way of binding:\n        \n        5.3.1. **\"Node-locked\"** license shall mean that the use of the Software will be\n        restricted to a single workstation specified by You and indicated in Purchase\n        Confirmation Documents. This type of license shall be accompanied by provision\n        of License Key for the mentioned workstation to ensure that established\n        limitations are observed.\n        \n        5.3.2. **\"Floating\"** license means that access to the Software at any given\n        moment will be limited to the maximum number of concurrent users indicated in\n        Purchase Confirmation Documents and for whom licenses have been validly acquired\n        under this Agreement. This type of license is accompanied by provision of\n        License Key for a server of license keys provided together with the Software.\n        \n        5.4. Special types of licenses:\n        \n        5.4.1. **\"Academic Educational\"** license is provided for the use of the\n        Software by educational institutions solely for educational purposes, without\n        making profit, provided that limitations established in Section 8 of this\n        Agreement are observed.\n        \n        5.4.2. **\"Academic Research\"** license is provided for the use of the Software\n        by educational institutions for the sole purpose of conducting research for\n        dissertation and theses, without making profit, provided that limitations\n        established by Section 8 are observed.\n        \n        5.4.3. **\"Student\"** license is granted to Individual Users only and requires\n        You to be a student of an educational institution and to use the Software with\n        observance of limitations established by Section 9 of this Agreement.\n        \n        5.4.4. **\"Trial\"** license is limited by the time period of ninety (90) calendar\n        days and is provided for the limited use of the Software solely for the purposes\n        of its testing, provided that limitations established by Section 10 of this\n        Agreement are observed.\n        \n        \n        ## 6. License Fee and Technical Maintenance Fee\n        \n        6.1. License Fee.\n        \n        6.1.1. Unless otherwise directly indicated in Purchase Confirmation Documents,\n        the License is granted to You on an indemnity basis. The amount and procedure\n        of license fee payment shall be indicated in the invoice being part of Purchase\n        Confirmation Documents, which are an integral part of the License.\n        \n        6.2. Technical Maintenance Fee.\n        \n        6.2.1. The Company shall not charge You any Technical Maintenance Fee within\n        the first year from the Software use according to Section 12.\n        \n        6.2.2. You agree that if You suspend and then resume purchase of the standard\n        technical maintenance services, You shall be obliged to fully compensate the\n        Company for the technical maintenance services within the entire suspension\n        period, as well as to pay for the technical maintenance services for the period\n        of their resumed provision.\n        \n        6.2.3. You undertake to pay the Company for Charged for Enhancements, Custom\n        Programming Services, On-Site Technical Support and Training in the amount and\n        pursuant to the terms and conditions set forth in the separate agreements for\n        such services rendering.\n        \n        6.2.4. Payment Terms.\n        \n        6.2.4.1. Fee Amount. You shall pay the Company for the technical maintenance in\n        the amount set forth in Purchase Confirmation Documents, as well as Taxes due\n        to standard technical maintenance services rendered by the Company hereunder,\n        in the amount specified in the invoice for the services and in compliance with\n        the terms and conditions provided in this Section hereof.\n        \n        6.2.4.2. Payment procedure. You undertake to pay the fee for the technical\n        maintenance to the Company no later than the technical maintenance fee due\n        date set forth in Purchase Confirmation Documents. You shall pay all other\n        amounts due to the Company for services hereunder in accordance with the\n        payment schedule set forth in the invoice for the services.\n        \n        6.2.4.3. Initial and Renewal Fees. Purchase of Software maintenance services\n        will be subject to the purchase of such services for all Software modules\n        supported by the Company. The fees for the Software maintenance services will\n        be set forth in the quotation of the Company for such services. For each of\n        the first two renewal terms following the initial term, the Company may adjust\n        the Software maintenance fees provided that: (i) the Company provides a written\n        notice to You at least 60 days prior to the end of the current term, (ii) the\n        fee adjustment becomes effective upon expiration of the current term, and (iii)\n        the percentage of the fee adjustment does not exceed a cap of three percent (3%)\n        per year. Following the first two renewal terms, the Company's ability to\n        increase maintenance fees shall not be subject to the cap requirements;\n        provided, however, that the Company provides a written notice to You at least\n        60 days prior to the end of the current term.\n        \n        If You purchase additional Software licenses during the term of this Agreement,\n        the Company reserves the right to adjust the annual maintenance term and pro\n        rate the annual maintenance fees for such add-on Software to be coterminous\n        with the initial Software maintenance term and billing cycle.\n        \n        \n        ## 7. Your Responsibilities\n        \n        7.1. Confidentiality.\n        \n        7.1.1. You undertake to use the Software solely for Your own needs with the\n        purpose of processing Your own data and have no right to render services and\n        process data for any third parties, except where Your main business is the\n        development and provision of computer mathematic models and product designs.\n        \n        7.1.2. You shall not have the right to reverse engineer or conduct analysis\n        of the Software for purposes of development or creation of software or any\n        other product competing with the Company products. Any testing, comparison,\n        benchmarking, or analysis of the Software unrelated to its installation,\n        elimination of errors or usual use for intended purposes shall be conducted\n        only with the preliminary written consent of the Company. Any results of\n        testing, comparison, benchmarking, or analysis cannot be published or\n        transferred to any third parties without a preliminary written consent\n        of the Company.\n        \n        7.2. Remarketing of Software.\n        \n        7.2.1. You shall not have the right: (i) to demonstrate the Software and\n        transfer information thereof to any person who is not an Authorized User,\n        to provide access to the Software or the right of its use to any person who\n        is not an Authorized User, (ii) to allow temporary use or publishing of\n        the Software to any third parties, to transfer to any third party the right\n        to use the Software (through sale, exchange, as a gift, by law or on any other\n        grounds), fully and partially, *inter alia* by means of sublicensing which is\n        allowed to Authorized Dealers only; and (iii) to use the Software for rendering\n        services to third parties.\n        \n        7.3. Assignment of Rights.\n        \n        7.3.1. You shall have no right to fully or partially encumber, assign or in any\n        other way alienate or transfer any rights and obligations under this Agreement\n        to any third party without the preliminary written consent of the Company.\n        \n        7.4. Reverse Engineering or Modification of the Software.\n        \n        7.4.1. You shall have no right to introduce any changes to the Software or\n        source code of the Software. You shall have no right to amend the Software or\n        any part thereof, including extraction of its source code, decompiling,\n        translation, processing, disassembling or any other efforts aimed at\n        identification of the source code of the Software. You shall have no right\n        to modify in any other way, change, adapt, publish or merge the Software.\n        \n        7.4.2. Any of Your actions with the Software, which are not directly allowed\n        by this Agreement or applicable legislation, shall be conducted only with the\n        preliminary written consent of the Company.\n        \n        7.5. Ways of the Software Use.\n        \n        7.5.1. You shall have the right to use the Software for Your own needs only,\n        *inter alia* to reproduce the Software by uploading one original of the\n        Software, as well as by making one backup copy. Any use of the Software under\n        this Agreement is limited by the following purposes:\n        \n        -   Automation of engineering processes;\n        -   Automation of data processing;\n        -   Predictive modelling;\n        -   Multidisciplinary design optimization.\n        \n        You shall have no right to use the Software by ways which are not directly\n        provided for by the Agreement or beyond the purposes indicated in this\n        Agreement.\n        \n        7.6. Use outside the Territory.\n        \n        7.6.1. You shall not have the right to use the Software, including preparation\n        for use, uploading, storage or import of originals or copies of Software\n        outside the Territory indicated in Purchase Confirmation Documents.\n        \n        7.7. Computer Identifier.\n        \n        7.7.1. You shall undertake to provide the Company with Computer Identifier to\n        make it possible for the Company to generate the License Key.\n        \n        7.8. Third party suppliers.\n        \n        7.8.1. You undertake to comply with provisions contained in this Agreement and\n        agree that the Company, as well as the third parties which products are used\n        in the Software shall have the right to enforce the fulfillment of the terms\n        and conditions of this Agreement from You and from any Authorized User, if the\n        respective claim is relevant to their product.\n        \n        7.9. Export.\n        \n        7.9.1. The Company shall have the right to terminate this Agreement at any\n        time, should it violate the rules of applicable legislation or international\n        law pertaining to export control or state secret. You shall have no right to\n        use the Software, as well as to conduct any other actions with the Software for\n        the development and manufacture of chemical, nuclear, biological and any other\n        weapons prohibited by international agreements and/or applicable legislation.\n        \n        7.10. Installation.\n        \n        7.10.1. You undertake to install all necessary updates for the purposes of\n        substantial defects elimination, minor bug fixing and Software updating,\n        including any enhancements of the Software in accordance with instructions of\n        the Company and in order of their receipt from the Company.\n        \n        7.11. Access to Facilities and Personnel.\n        \n        7.11.1. You shall provide the Company with access to Your facilities and\n        personnel concerned with the operation of the Software to enable the Company\n        to provide services.\n        \n        7.12. No Modification of the Software.\n        \n        7.12.1. You undertake not to modify, enhance or otherwise alter the Software,\n        unless and only to the extent specifically authorized in the Documentation or\n        the prior written consent of the Company is obtained.\n        \n        7.13. Errors Documentation.\n        \n        7.13.1. Upon detection of any error in the Software You, as requested by the\n        Company, shall provide the Company with a list of output and any other data,\n        including databases and backup systems, which may be reasonably requested by\n        the Company in order to reproduce operating conditions similar to those present\n        when the error occurred.\n        \n        \n        ## 8. Special Terms Applicable to Academic Educational and Academic Research Licenses\n        \n        If the Software is provided on the basis of Academic Educational or Academic\n        Research licenses, in addition to other terms and conditions of this Agreement\n        the following terms and conditions shall apply:\n        \n        8.1. You shall not have the right to use the Software: (i) for the purposes of\n        any education or consulting if such education or consulting is conducted outside\n        the frameworks of educational or research programs indicated by You in Purchase\n        Confirmation Documents; (ii) for the purposes of education or training of third\n        parties who are Company Software licensees; (iii) for purposes of deriving\n        profit including but not limited to commercial processing of information of\n        any third parties, affiliates inclusive; and (iv) for the development of\n        software for sale and licensing purposes.\n        \n        8.2. Professors, graduate and undergraduate students who are directly related\n        to teaching, education, educational programs, as well as research work conducted\n        within Your educational program, shall be considered Authorized Users of the\n        Software under Academic Educational and Academic Research licenses.\n        \n        8.3. The Software should be used for a standard educational program in the\n        course of regular classes held at least annually. You should obtain a\n        preliminary written approval from the Company with respect to all documents\n        You plan to publish, if such documents pertain to capabilities, functionality\n        and/or methodology of the Software.\n        \n        \n        ## 9. Special Terms Applicable to Student Licenses\n        \n        If the Software is provided on the basis of a Student license, in addition to\n        other terms and conditions of this Agreement the following terms and conditions\n        shall apply:\n        \n        9.1. Use of the Software under Student license is limited by purposes which are\n        directly linked to education of an Individual User in an educational institution\n        within the relevant educational program.\n        \n        \n        ## 10. Special Terms Applicable to Trial License\n        \n        If the Software is provided on the basis of Trial license, in addition to other\n        terms and conditions of this Agreement the following terms and conditions shall\n        apply:\n        \n        10.1. The Software is provided in a trial mode solely for the purposes of\n        testing of its capabilities and functionality. The Software should not be used\n        for commercial, professional or industrial purposes, for the purposes of paid\n        education or consultations, as well as for other purposes which are associated\n        with deriving of profit, testing, analysis and evaluation inclusive.\n        \n        10.2. The term of validity of Trial license shall be sixty (60) calendar days\n        from the moment the License Key is received by the User.\n        \n        \n        ## 11. Term and Termination\n        \n        11.1. All licenses for the Software (One-Year Subscription and Trial exclusive)\n        come into force at the moment of receipt of the License Key by You, and, unless\n        otherwise directly indicated in Purchase Confirmation Documents, shall be\n        considered perpetual and granted for the whole period of validity of exclusive\n        rights to the Software.\n        \n        11.2. The Company shall not be held responsible, if the Authorized User fails\n        to duly activate the License Key or obtain the License Key for any reason that\n        does not depend on the Company. You agree that any period of non-use of the\n        License Key or the Software for any reason shall not be grounds for extension\n        of the validity period for the Software license granted to You.\n        \n        11.3. If You violate any of the provisions of the Agreement, the Company shall\n        have the right at any time and at its own discretion unilaterally early and\n        extra judicially terminate this Agreement by sending You a written notification.\n        All license rights specified in the Agreement in relation to the Software shall\n        discontinue should You receive a notification of termination of this Agreement.\n        \n        11.4. Within ten (10) days after termination of the Agreement for any reason,\n        You undertake to destroy all originals and copies of the Software at Your own\n        expense and confirm this in writing to the Company.\n        \n        \n        ## 12. Technical Maintenance\n        \n        12.1. Within the term of license validity set forth in Paragraph 11.1 of the\n        Agreement the Company undertakes to transfer, for remuneration specified in\n        Paragraph 6.2 hereof, to You all necessary rights on the Software updates and\n        supplements. The Company shall transfer to You the rights to use the Software\n        from the moment of actual provision to You the ability to download the Software\n        updated versions from the Company web site located at the following address:\n        https://www.pseven.io/permalink/download.\n        \n        12.2. During the term of license validity set forth in Paragraph 11.1 of the\n        Agreement the Company undertakes to provide You with the following ancillary\n        services related to the Software: annual technical maintenance, enhancement in\n        compliance with Your individual requirements, on site technical support, and\n        training services, as set forth in Paragraphs 12.6 - 12.10 hereof.\n        \n        12.3. In compliance with the terms and conditions hereof, the Company shall\n        grant You a non-exclusive and non-transferable license for the access to and\n        use of the Software updates and supplements. Such license shall be issued for\n        the validity term of the Agreement.\n        \n        12.4. Under the terms and conditions of the Agreement, the Company may update\n        or supplement the Software, for which You hold the license. In this case You\n        may use such updates or supplements with the Software, subject to compliance\n        with any additional terms that accompany the respective update or supplement,\n        as set forth in the Agreement.\n        \n        12.5. The license covers the use of the Software updates and supplements solely\n        for the purposes of the Software use and use of the updates and supplements\n        solely with the Software. You agree and acknowledge that any use of the Software\n        and/or its updates and supplements, which is not expressly permitted by this\n        Agreement, is prohibited.\n        \n        12.6. Annual Technical Maintenance.\n        \n        12.6.1. During the term of license validity set forth in Paragraph 11.1 of the\n        Agreement, the Company undertakes to provide You with the following standard\n        ancillary services related to the Software technical support maintenance:\n        \n        -   *Error corrections.* An Error means the failure of the Software to conform\n            substantially to the Documentation (\"Error\"). You may report any suspected\n            Error to the Company or the applicable Authorized Dealer and, upon the\n            Company request, You shall provide the Company with a detailed, written\n            description and documentation of the suspected Error. The Company will\n            investigate the facts and circumstances related thereto and You shall\n            cooperate with the Company investigation. If the Company finds that the\n            Software contains an Error, it will use all commercially reasonable efforts\n            to correct the Error. An Error correction may consist of a separate patch,\n            a workaround or it may be included in a future release of the Software,\n            at the discretion of the Company;\n        -   *Periodic updates of the Software* that may provide for (A) elimination\n            of any Errors, (B) fixes of any minor bugs, and (C) at the sole discretion\n            of the Company, enhancements to the Software as defined in Paragraph 4.7\n            of the Agreement;\n        -   *Prompt technical support* in English via e-mail support@pseven.io, via\n            telephone +33 5 82-95-70-12, between 9:00 a.m. and 6:00 p.m. CET, Monday\n            through Friday, excluding official French holidays, in order to assist You\n            to use the Software.\n        \n            Prompt technical support does not include answering the questions not\n            related to the Software, such as general questions about data analysis\n            and optimization tasks, answering questions about the Software internal\n            functions, helping with the product design and rendering engineering\n            services.\n        \n        12.6.2. For the avoidance of doubt, the parties agree and acknowledge that the\n        standard technical maintenance services shall not include:\n        \n        -   services related to the Software enhancements according to Your needs;\n        -   programming services according to Your individual requirements;\n        -   on-site technical support;\n        -   training services;\n        -   supply of the hardware and Software instances;\n        -   any and all other services not explicitly mentioned in Paragraph 12.6.1\n            hereof.\n        \n        12.6.3. All services indicated in Paragraph 12.6.2 hereof may be rendered\n        to You by the Company. Terms and conditions of such additional services shall\n        be agreed by the parties in separate agreements.\n        \n        12.7. Charged For Enhancements.\n        \n        12.7.1. From time to time, at the Company sole discretion, the Company may\n        render to You services related to the paid-for Software enhancement. You may\n        purchase such services from the Company on the basis of additional license,\n        subject to the payment of the license fee established by the Company.\n        \n        12.8. Custom Programming Services according to Your individual requirements.\n        \n        12.8.1. The Company undertakes to provide You with the services related to\n        programming in accordance with Your individual requirements, as agreed by the\n        parties in separate agreements that specify the services related to programming\n        in accordance with Your individual requirements to be provided by the Company\n        and the fee to be paid for such services. The services related to programming\n        in accordance with Your individual requirements shall include, but are not\n        limited to, development of custom computer programs and their installation,\n        training and technical maintenance with respect to such computer programs.\n        \n        12.9. On-Site Technical Support.\n        \n        12.9.1. The Company, upon receipt of Your written request and within a mutually\n        agreed time period, shall provide You with on-site technical support. You agree\n        to reimburse to the Company all expenses associated with the provision of\n        on-site technical support in the amount and pursuant to the terms and conditions\n        set forth in the separate agreements for such services rendering, including,\n        but not limited to, expenses related to (i) services of the Company personnel,\n        (ii) payment of business trip, accommodation and other expenses, and (iii) Taxes\n        pursuant to Paragraph 6.2 hereof.\n        \n        12.10. Training.\n        \n        12.10.1. Upon receipt of a written request from You and within the time period\n        mutually agreed by the parties, the Company undertakes to provide the training\n        services at the Company office, unless the the Company assumed obligation to\n        render the training services elsewhere. You agree to reimburse to the Company\n        all expenses associated with the provision of training services, including, but\n        not limited to, expenses related to (i) services of the Company personnel, which\n        may include a surcharge for training conducted at Your location, (ii) payment\n        of business trip, accommodation and other expenses, and (iii) Taxes pursuant\n        to Paragraph 6.2 hereof.\n        \n        \n        ## 13. Warranties\n        \n        13.1. The Company guarantees that within the Warranty Period (as defined below)\n        the Software will have all the characteristics and functions indicated in\n        Documentation.\n        \n        **\"Warranty Period\"** shall be ninety (90) days from the day You receive the\n        License Key.\n        \n        13.2. Should You turn to the Company within the Warranty Period, the former\n        shall undertake one of the following actions at its sole discretion:\n        (i) eliminates the error, or (ii) finds a working solution allowing to bypass\n        the error, or (iii) reimburses the fee paid for the License.\n        \n        13.3. THE COMPANY MAKES NO OTHER WARRANTIES, AND NO WARRANTY IS GIVEN THAT THE\n        SOFTWARE IS ERROR-FREE OR THAT ITS USE WILL BE UNINTERRUPTED OR THAT IT WILL\n        WORK IN CONNECTION WITH ANY OTHER SOFTWARE. YOU DO NOT RECEIVE ANY WARRANTIES\n        WITH RESPECT TO THE SOFTWARE. ANY DECLARATIONS, ASSURANCES AND WARRANTIES WITH\n        RESPECT TO THE SOFTWARE OR ITS FUNCTIONS CONTAINED IN DOCUMENTATION OR ANY\n        CORRESPONDENCE WITH AUTHORIZED USER ARE TECHNICAL INFORMATION, NOT A DIRECT\n        WARRANTY OR UNDERTAKING. BESIDES, THE COMPANY EXPLICITLY REFUSES TO ACKNOWLEDGE\n        ANY OTHER WARRANTIES, INCLUDING ANY IMPLIED WARRANTIES OF EXISTENCE OF ANY\n        CHARACTERISTICS, SUITABILITY FOR ANY PURPOSES OR NON-VIOLATION OF INTELLECTUAL\n        PROPERTY RIGHTS OF THIRD PARTIES. THE COMPANY DOES NOT GUARANTEE SMOOTH AND\n        ERROR-FREE WORK OF THE SOFTWARE. BY USING THE SOFTWARE YOU ACKNOWLEDGE THAT\n        DATA USED FOR THE SOFTWARE MAY BE LOST OR DELETED *INTER ALIA* BY MISTAKE OF\n        AUTHORIZED USER OR DUE TO USE OF MALWARE.\n        \n        13.4. Any Company warranties have no legal force if defects or errors in\n        Software directly or indirectly resulted from unauthorized changes, attempt\n        to eliminate error inclusive, or from violation of terms and conditions of\n        Software use, including but not limited to use of Software with disregard of\n        technical conditions and system requirements indicated in Documentation.\n        \n        13.5. Authorized Dealers are not entitled to make amendments, clarifications\n        or additions to the Company warranties and Warranty Period provisions indicated\n        in this Agreement.\n        \n        13.6. The Company does not bear responsibility for any results obtained with\n        use of the Software. You are responsible for supervision, management and control\n        of the Software. This responsibility provides for *inter alia* choice of the\n        way of the Software use, as well as choice of the Software and other programs\n        and technical means needed to achieve the intended result. The entire risk of\n        satisfactory quality and performance resides with You. the Company does not\n        make, and hereby disclaim, any and all express, implied or statutory warranties,\n        including implied warranties of condition, uninterrupted use, accuracy of data,\n        merchantability, satisfactory quality, fitness for a particular purpose, and\n        warranties (if any) arising from a course of dealing, usage, or trade practice.\n        The Company does not warrant against interference with Your enjoyment of the\n        Software and/or any updates and/or supplements to the Software; that the\n        Software and/or any updates and/or supplements to the Software and/or the\n        services mentioned in this Agreement will meet Your requirements; that operation\n        of the Software and/or any of the updates and/or supplements to the Software\n        and/or the services mentioned in this Agreement will be uninterrupted or\n        error-free, or that the Software and/or any updates and/or supplements to the\n        Software and/or the services mentioned in this Agreement will interoperate or\n        be compatible with any other Company products or that any errors in the Software\n        and/or any updates and/or supplements to the Software and/or the services\n        mentioned in this Agreement will be corrected in future.\n        \n        \n        ## 14. Limitation of Liability\n        \n        14.1. The maximum amount of the Company liability for all claims with respect\n        to the Agreement or Software, regardless of the form and grounds for claim,\n        complaint or lawsuit, shall be limited and cannot exceed the fee paid by You\n        to the Company or Authorized Dealer under the License.\n        \n        14.2. The Company will by no means be liable for any amounts of lost profit,\n        loss resulted from lay-up (intervals in productions, exploitation, etc.), as\n        well as for any amounts of indirect, consequential, accidental, following,\n        punitive, fine or special loss or loss of third parties, even if the Company\n        was initially aware of the risk of such a loss; any claims for payment of such\n        damages shall not be accepted.\n        \n        14.3. This Section 14 shall not be interpreted as excluding any liability\n        which cannot be excluded by the Agreement in accordance with the applicable\n        legislation.\n        \n        14.4. Unless otherwise directly provided for by applicable legislation, the\n        User shall not have the right to submit claims, complaints or lawsuits upon\n        expiration of three (3) years after actions or occurrences that are grounds\n        for such claim, complaint or lawsuit took place.\n        \n        \n        ## 15. Indemnity for Infringement of Intellectual Property Rights\n        \n        15.1. Subject to Your timely notification, the Company at its own discretion\n        has the right to assist with settlement of any lawsuit filed with the relevant\n        court against You as defendant on the grounds that the use of the Software\n        within the License on the Territory leads to violation of third parties'\n        intellectual property rights.\n        \n        15.2. The Company or Authorized Dealer shall pay You reasonable and justified\n        expenses for court representative, as well as compensate for all loss\n        established by the final decision of the relevant court that was issued\n        against You, provided that the Company was immediately notified in writing of\n        such a lawsuit or claim and provided all necessary information, assistance and\n        powers necessary for court defense or extra judicial dispute resolution.\n        \n        15.3. The Company, at its options, shall ensure Your ability to continue using\n        the relevant Software, replace or modify the relevant Software so that it does\n        not violate intellectual property rights of third parties. If it is impossible\n        to fulfill the obligations mentioned above, the Company shall accept return of\n        the Software. The Company or Authorized Dealer shall reimburse the cost of the\n        Software use under Agreement in the amount determined based on straight-line\n        depreciation within sixty (60) months from the date of Purchase Confirmation\n        Documents.\n        \n        15.4. The Company does not have to fulfill its obligations under this Section\n        if the presumed violation of third parties' rights or any other violation\n        results from (i) use of Software together with other software which does not\n        belong to the Company, provided that such violation would not occur without\n        such combined use, or (ii) fulfillment by the Company of Your requirements,\n        specifications or directions.\n        \n        15.5. The Company shall not be liable to the other party for the lost profits,\n        indirect, special or consequential damages arising out of this Agreement, even\n        if such party has been notified of the possibility of such damages. Under no\n        circumstances the liability may exceed the amounts paid by You to the Company\n        hereunder.\n        \n        \n        ## 16. General Provisions\n        \n        16.1. Allocation of Risk.\n        \n        16.1.1. You bear all the risks pertaining to the choice of the Software,\n        upload, installation and work of the Software on Your equipment including the\n        risk pertaining to any hardware and software, data, or any other elements\n        subject to change as a result of installation, copying or use of the Software\n        including expenses for repair or replacement of any equipment, as well as\n        payment to technical support specialists.\n        \n        16.2. Purchase Orders.\n        \n        16.2.1. In case of any discrepancies between Purchase Confirmation Documents\n        and Agreement, terms and conditions contained in Purchase Confirmation Documents\n        shall prevail.\n        \n        16.3. Accept of Orders.\n        \n        16.3.1. The Company shall have a unilateral right to accept or decline any\n        order for the Software. If the Company accepts the order for the Software, the\n        Software will be provided, while the delivery of the Software indicated in\n        Purchase Confirmation Documents shall be considered accomplished when the\n        Company makes such Software available for downloading via electronic channel\n        at the address indicated by the Company, and provides the License Key.\n        \n        \n        ## 17. Governing Law\n        \n        17.1. The Agreement shall be governed and construed in accordance with the\n        legislation of France.\n        \n        \n        ## 18. Disputes Resolution\n        \n        18.1. The Parties undertake to resolve any disputes arising from this Agreement\n        through negotiations. If the Parties fail to resolve the dispute by means of\n        negotiations within thirty (30) days from the day of receipt of the first\n        written claim of one of the Parties, the dispute shall be transferred to\n        Toulouse Court for consideration.\n        \n        \n        ## 19. Severability\n        \n        19.1. If any provision contained in the Agreement is recognized as void or\n        unenforceable, including due to its contradiction with the applicable\n        legislation, this will not apply to any other provisions, and such provisions\n        shall remain valid and enforceable. Should unenforceable provisions be amended\n        and enforced by the court, such provisions shall be regarded thus amended in\n        this Agreement.\n        \n        \n        ## 20. Entire Agreement\n        \n        20.1. You confirm that You have read this Agreement, understood it and agreed\n        to be bound by all its terms and conditions. You further agree that this\n        Agreement, as well as Purchase Confirmation Documents, are a complete and\n        exclusive contract between You and the Company that supersedes any offer or\n        previous agreements, oral or written, and any other arrangements between the\n        Parties that are related to the subject matter hereof.\n        \n        \n        ## 21. Waiver\n        \n        21.1. The waiver or failure of the Company to exercise in any respect any\n        right provided for in this Agreement shall not be deemed a waiver of any other\n        rights under this Agreement.\n        \n        \n        ## 22. Force Majeure\n        \n        Except for the obligation of payment, neither party shall be liable for any\n        delay in performance of or failure to perform any of the provisions of this\n        License Agreement to be observed or performed by it, caused directly or\n        indirectly by a case of Force Majeure. Force Majeure denotes all events which\n        do not exist or whose existence is, despite the exercise of ordinary care,\n        unknown by the non-performing party at the date this License Agreement has been\n        signed, and which could not reasonably have been foreseen by the non-performing\n        party, the occurrence and effects of which cannot be prevented by reasonable\n        efforts of the non-performing party. Force Majeure could include, without\n        limitation, such events as epidemics, severe weather conditions, earthquakes,\n        strikes, lock-outs, acts of government, shortages of energy and non-delivery\n        or delays in delivery by any third party.\n        \n        \n        ## 23. Contact Information\n        \n        23.1. Should You have any questions, please contact pSeven SAS at: 42, avenue\n        du Gnral de Croutte, 31100 Toulouse, France. E-mail: info@pseven.io; phone:\n        +33 (0) 5 82-95-59-68.\n        \n        \n        ## Exhibit 1\n        \n        Software refers to one or several computer programs described below, optional\n        components (modules) inclusive, and listed in Purchase Confirmation Documents.\n        \n        1.  **pSeven Core** - a software library for intelligent data analysis and\n            optimization, which consists of the following modules (Generic Tools):\n        \n            - Generic Tool for Dimension Reduction (GTDR),\n            - Generic Tool for Approximation (GTApprox),\n            - Generic Tool for Design of Experiments (GTDoE),\n            - Generic Tool for Data Fusion (GTDF),\n            - Generic Tool for Sensitivity and Dependency Analysis (GTSDA), and\n            - Generic Tool for Optimization (GTOpt).\n        \n        2.  **pSeven** - cross-platform software package for automation of scientific\n            and engineering calculations, multidisciplinary engineering optimization\n            and intelligent data analysis. pSeven features include:\n        \n            - Visually construct workflows and execute them locally or by direct\n              interaction with queue management systems, such as Slurm, LSF, and\n              TorquePBS.\n            - Arrange for efficient interaction (data transfer) with third-party\n              CAD/CAE tools, such as SolidWorks, KOMPAS-3D, CATIA v5, Ansys CFX,\n              Ansys Fluent, etc.\n            - Solve various data analysis problems, e.g. correlation and regression\n              analysis, surrogate modeling, etc., single-objective and multi-objective\n              optimization problems (with the use of add-in modules based on the\n              pSeven Core library).\n            - Conduct visualization and analysis of obtained results.\n        \n        3.  **pSeven Enterprise** - low code cloud-native collaborative platform to\n            build, deploy and operate different models and processes at scale.\n            pSeven Enterprise features include:\n        \n            - All pSeven features - engineering process automation, design\n              optimization and predictive analytics - usable right in a web browser.\n            - Scale even resource-intensive massive trade-off studies.\n            - Easy team collaboration within organization and with suppliers\n              or partners.\n            - Deploy on premises or in a private cloud.\n            - Create and share workflow-powered web applications.\n            - Extend and integrate with simple and clean APIs.\n        ",
  "license_expression": null,
  "home_page": "https://www.pseven.io/product/pseven-core/",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://www.pseven.io/product/pseven-core/",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1770923240,
  "project_urls": {
    "Support": "https://www.pseven.io/support.html",
    "Changelog": "https://www.pseven.io/product/pseven-core/manual/latest/support/changelog.html",
    "Documentation": "https://www.pseven.io/product/pseven-core/manual/",
    "Homepage": "https://www.pseven.io/product/pseven-core/"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}