{
  "name": "nextpipe",
  "version": "0.6.1",
  "summary": "Framework for Decision Pipeline modeling and execution",
  "license": "# LICENSE\n        \n        Business Source License 1.1\n        \n        Parameters\n        \n        Licensor:             nextmv.io inc\n        Licensed Work:        nextpipe\n        \n        Change Date:          Four years from the date the Licensed Work is published.\n        Change License:       GPLv3\n        \n        For information about alternative licensing arrangements for the Software,\n        please email info@nextmv.io.\n        \n        Notice\n        \n        The Business Source License (this document, or the “License”) is not an Open\n        Source license. However, the Licensed Work will eventually be made available\n        under an Open Source License, as stated in this License.\n        \n        License text copyright © 2023 MariaDB plc, All Rights Reserved. “Business Source\n        License” is a trademark of MariaDB plc.\n        \n        -----------------------------------------------------------------------------\n        \n        ## Terms\n        \n        The Licensor hereby grants you the right to copy, modify, create derivative\n        works, redistribute, and make non-production use of the Licensed Work. The\n        Licensor may make an Additional Use Grant, above, permitting limited production\n        use.\n        \n        Effective on the Change Date, or the fourth anniversary of the first publicly\n        available distribution of a specific version of the Licensed Work under this\n        License, whichever comes first, the Licensor hereby grants you rights under the\n        terms of the Change License, and the rights granted in the paragraph above\n        terminate.\n        \n        If your use of the Licensed Work does not comply with the requirements currently\n        in effect as described in this License, you must purchase a commercial license\n        from the Licensor, its affiliated entities, or authorized resellers, or you must\n        refrain from using the Licensed Work.\n        \n        All copies of the original and modified Licensed Work, and derivative works of\n        the Licensed Work, are subject to this License. This License applies separately\n        for each version of the Licensed Work and the Change Date may vary for each\n        version of the Licensed Work released by Licensor.\n        \n        You must conspicuously display this License on each original or modified copy of\n        the Licensed Work. If you receive the Licensed Work in original or modified form\n        from a third party, the terms and conditions set forth in this License apply to\n        your use of that work.\n        \n        Any use of the Licensed Work in violation of this License will automatically\n        terminate your rights under this License for the current and all other versions\n        of the Licensed Work.\n        \n        This License does not grant you any right in any trademark or logo of Licensor\n        or its affiliates (provided that you may use a trademark or logo of Licensor as\n        expressly required by this License).TO THE EXTENT PERMITTED BY APPLICABLE LAW,\n        THE LICENSED WORK IS PROVIDED ON AN “AS IS” BASIS. LICENSOR HEREBY DISCLAIMS ALL\n        WARRANTIES AND CONDITIONS, EXPRESS OR IMPLIED, INCLUDING (WITHOUT LIMITATION)\n        WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE,\n        NON-INFRINGEMENT, AND TITLE. MariaDB hereby grants you permission to use this\n        License’s text to license your works, and to refer to it using the trademark\n        “Business Source License”, as long as you comply with the Covenants of Licensor\n        below.\n        \n        ## Covenants of Licensor\n        \n        In consideration of the right to use this License’s text and the “Business\n        Source License” name and trademark, Licensor covenants to MariaDB, and to all\n        other recipients of the licensed work to be provided by Licensor:\n        \n        To specify as the Change License the GPL Version 2.0 or any later version, or a\n        license that is compatible with GPL Version 2.0 or a later version, where\n        “compatible” means that software provided under the Change License can be\n        included in a program with software provided under GPL Version 2.0 or a later\n        version. Licensor may specify additional Change Licenses without limitation. To\n        either: (a) specify an additional grant of rights to use that does not impose\n        any additional restriction on the right granted in this License, as the\n        Additional Use Grant; or (b) insert the text “None” to specify a Change Date.\n        Not to modify this License in any other way.\n        \n        License text copyright © 2023 MariaDB plc, All Rights Reserved. “Business Source\n        License” is a trademark of MariaDB plc.",
  "license_expression": null,
  "home_page": "https://www.nextmv.io",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/nextmv-io/nextpipe",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1771950971,
  "project_urls": {
    "Documentation": "https://nextpipe.docs.nextmv.io/en/latest/",
    "Homepage": "https://www.nextmv.io",
    "Repository": "https://github.com/nextmv-io/nextpipe"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}