{
  "name": "pdfstructx",
  "version": "0.2.2",
  "summary": "Intelligent PDF parser with font-aware structure detection, table extraction, and multi-column support",
  "license": "pdfstruct - Personal Use License\r\n        \r\n        Copyright (c) 2026 Kyros Groupe. All rights reserved.\r\n        \r\n        Permission is hereby granted, free of charge, to any person obtaining a copy\r\n        of this software and associated documentation files (the \"Software\"), to use,\r\n        copy, modify, and distribute the Software for PERSONAL, EDUCATIONAL, and\r\n        NON-COMMERCIAL purposes only, subject to the following conditions:\r\n        \r\n        1. PERSONAL USE: You may use the Software for personal projects, learning,\r\n           research, and non-commercial open-source projects.\r\n        \r\n        2. COMMERCIAL USE PROHIBITED: You may NOT use the Software, in whole or in\r\n           part, for any commercial purpose without obtaining a separate commercial\r\n           license from Kyros Groupe. Commercial use includes, but is not limited to:\r\n           - Incorporating the Software into a product or service sold for profit\r\n           - Using the Software to provide paid services or SaaS offerings\r\n           - Using the Software within a for-profit business for internal operations\r\n           - Distributing the Software as part of a commercial product\r\n        \r\n        3. ATTRIBUTION: All copies or substantial portions of the Software must\r\n           include this license notice and the above copyright notice.\r\n        \r\n        4. NO SUBLICENSING: You may not sublicense the Software under different terms.\r\n        \r\n        5. MODIFICATIONS: You may modify the Software for personal use. Modified\r\n           versions must retain this license and cannot be distributed under\r\n           different terms.\r\n        \r\n        For commercial licensing inquiries, contact: licensing@kyros-groupe.com\r\n        \r\n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\r\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\r\n        FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\r\n        AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\r\n        LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\r\n        OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\r\n        SOFTWARE.\r\n        ",
  "license_expression": null,
  "home_page": "https://github.com/Kyros-Groupe-Ltd/pdfstruct",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "Kyros Groupe",
  "repository": "https://github.com/Kyros-Groupe-Ltd/pdfstruct",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1770667715,
  "project_urls": {
    "Issues": "https://github.com/Kyros-Groupe-Ltd/pdfstruct/issues",
    "Documentation": "https://github.com/Kyros-Groupe-Ltd/pdfstruct#readme",
    "Homepage": "https://github.com/Kyros-Groupe-Ltd/pdfstruct"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}