{
  "name": "urdu-g2p",
  "version": "2.0.0",
  "summary": "High-performance Urdu Grapheme-to-Phoneme converter",
  "license": "Urdu G2P - Non-Commercial License\n        ==================================\n        \n        Copyright (c) 2025 Humair Munir Awan <humairmunirawan@gmail.com>\n        \n        This software and associated data files (the \"Software\") are provided for \n        NON-COMMERCIAL USE ONLY.\n        \n        PERMISSIONS:\n        - Use for personal projects, academic research, and educational purposes\n        - Modify and create derivative works for non-commercial purposes\n        - Distribute copies for non-commercial purposes with attribution\n        \n        RESTRICTIONS:\n        - Commercial use of any kind is strictly prohibited without prior written \n          permission from the copyright holder\n        - Use in commercial products, services, or applications is not permitted\n        - Selling, licensing, or monetizing the Software or its derivatives is not \n          permitted\n        \n        CONDITIONS:\n        - The above copyright notice and this permission notice shall be included in \n          all copies or substantial portions of the Software\n        - Attribution must be given to the original author in any derivative works\n        - For commercial licensing inquiries, please contact: humairmunirawan@gmail.com\n        \n        DATA NOTICE:\n        The phoneme dictionary data included with this Software is also subject to \n        this non-commercial license. Commercial use of the data requires separate \n        licensing.\n        \n        DISCLAIMER:\n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n        FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n        AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n        LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n        OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n        SOFTWARE.\n        \n        For commercial licensing, please contact:\n        Humair Munir Awan\n        Email: humairmunirawan@gmail.com\n        ",
  "license_expression": null,
  "home_page": "https://github.com/humair-m/urdu-g2p",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/humair-m/urdu-g2p.git",
  "repository_source": "project_urls.repository",
  "pub_date": 1768856181,
  "project_urls": {
    "Issues": "https://github.com/humair-m/urdu-g2p/issues",
    "Repository": "https://github.com/humair-m/urdu-g2p.git",
    "Homepage": "https://github.com/humair-m/urdu-g2p"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false
}