{
  "name": "antares-devkit",
  "version": "0.4.0",
  "summary": "Provides tools and utility methods to write and debug ANTARES filters with Python.",
  "license": "Copyright (c) 2025 Association of Universities for Research in Astronomy, Inc. (AURA)\n         All rights reserved.\n         \n         Unless otherwise stated, the copyright of this software is owned by AURA.\n         Redistribution and use in source and binary forms, with or without modification,\n         are permitted provided that the following conditions are met:\n         \n         1) Redistributions of source code must retain the above copyright notice,\n           this list of conditions and the following disclaimer.\n         2) Redistributions in binary form must reproduce the above copyright notice,\n           this list of conditions and the following disclaimer in the documentation\n           and/or other materials provided with the distribution.\n         3) The names of AURA and its representatives may not be used to endorse or\n           promote products derived from this software without specific prior written\n           permission.\n         \n         THIS SOFTWARE IS PROVIDED BY AURA \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES,\n         INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\n         FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL AURA BE\n         LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n         CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE\n         GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n         HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n         LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF\n         THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
  "license_expression": null,
  "home_page": "https://gitlab.com/nsf-noirlab/csdc/antares/devkit",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://gitlab.com/nsf-noirlab/csdc/antares/devkit",
  "repository_source": "project_urls.source",
  "download": null,
  "download_source": null,
  "pub_date": 1769117519,
  "project_urls": {
    "Source": "https://gitlab.com/nsf-noirlab/csdc/antares/devkit",
    "Bug Reports": "https://gitlab.com/nsf-noirlab/csdc/antares/devkit/issues",
    "Homepage": "https://gitlab.com/nsf-noirlab/csdc/antares/devkit",
    "Documentation": "https://nsf-noirlab.gitlab.io/csdc/antares/devkit/"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": false,
  "has_dependabot": null,
  "has_pyproject_toml": false,
  "has_setup_py": false,
  "has_setup_cfg": false
}