{
  "name": "mlfastopt",
  "version": "0.0.9b4",
  "summary": "ML Fast Opt - Advanced ensemble optimization system for LightGBM hyperparameter tuning",
  "license": "GENX AI LAB COMMUNITY LICENSE AGREEMENT\n        Version 1.0\n        \n        Copyright (c) 2025 GenX AI Lab. All Rights Reserved.\n        \n        1. GRANT OF LICENSE\n        GenX AI Lab (\"Licensor\") hereby grants to you (\"Licensee\") a non-exclusive, non-transferable, revocable license to install and use the software \"mlfastopt\" (the \"Software\") for personal, educational, research, and internal business purposes, free of charge.\n        \n        2. RESTRICTIONS\n        You may NOT:\n        (a) Distribute, sub-license, rent, lease, or sell the Software or any derivative works thereof;\n        (b) Modify, reverse engineer, decompile, or disassemble the Software, except to the extent that such activity is expressly permitted by applicable law notwithstanding this limitation;\n        (c) Remove or alter any copyright, trademark, or other proprietary notices from the Software.\n        \n        3. OWNERSHIP\n        The Software is licensed, not sold. GenX AI Lab retains all ownership, title, copyright, and other intellectual property rights in the Software. This license does not grant you any rights to use GenX AI Lab's trademarks or service marks.\n        \n        4. DISCLAIMER OF WARRANTY\n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES, OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT, OR OTHERWISE, ARISING FROM, OUT OF, OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n        \n        5. TERMINATION\n        This license is effective until terminated. Your rights under this license will terminate automatically without notice from the Licensor if you fail to comply with any term(s) of this license. Upon termination, you shall cease all use of the Software and destroy all copies, full or partial, of the Software.\n        ",
  "license_expression": null,
  "home_page": "https://github.com/example/mlfastopt",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/example/mlfastopt",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1769237237,
  "project_urls": {
    "Issues": "https://github.com/example/mlfastopt/issues",
    "Homepage": "https://github.com/example/mlfastopt",
    "Documentation": "https://github.com/example/mlfastopt/docs",
    "Repository": "https://github.com/example/mlfastopt"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}