{
  "name": "ruleforge-python",
  "version": "0.1.1",
  "summary": "Python SDK for Ruleforge policy CLI orchestration and alert integrations.",
  "license": "Ruleforge Proprietary License\r\n        Version 1.0\r\n        \r\n        Copyright (c) 2026 Ruleforge Maintainers. All rights reserved.\r\n        \r\n        1. Grant of Rights\r\n        Subject to the terms of this license, Ruleforge Maintainers grant you a\r\n        limited, non-exclusive, non-transferable, revocable license to use the\r\n        software for internal evaluation and internal business purposes.\r\n        \r\n        2. Restrictions\r\n        You may not, without prior written permission from Ruleforge Maintainers:\r\n        - redistribute, sublicense, sell, lease, or commercially host the software;\r\n        - provide the software to third parties as a managed service;\r\n        - remove, alter, or obscure proprietary notices;\r\n        - use trademarks, names, or logos of Ruleforge Maintainers.\r\n        \r\n        3. Ownership\r\n        The software and all related intellectual property rights are and remain the\r\n        exclusive property of Ruleforge Maintainers and their licensors.\r\n        \r\n        4. Third-Party Components\r\n        The software includes third-party components licensed by their respective\r\n        owners. See THIRD_PARTY_NOTICES.md for required attributions and license terms.\r\n        \r\n        5. No Warranty\r\n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\r\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\r\n        FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT.\r\n        \r\n        6. Limitation of Liability\r\n        TO THE MAXIMUM EXTENT PERMITTED BY LAW, IN NO EVENT SHALL RULEFORGE MAINTAINERS\r\n        OR CONTRIBUTORS BE LIABLE FOR ANY INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\r\n        CONSEQUENTIAL DAMAGES, OR ANY LOSS OF DATA, USE, BUSINESS, OR PROFITS.\r\n        \r\n        7. Termination\r\n        This license terminates automatically if you fail to comply with its terms.\r\n        Upon termination, you must stop use of the software and destroy all copies.\r\n        \r\n        8. Contact\r\n        For commercial, redistribution, OEM, or managed-service licensing, contact the\r\n        copyright owner/maintainers.\r\n        ",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": "Ruleforge Maintainers",
  "repository": null,
  "repository_source": null,
  "download": null,
  "download_source": null,
  "pub_date": 1770855959,
  "project_urls": {},
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}