{
  "name": "yoctolib",
  "version": "2.1.11996",
  "summary": "Yoctopuce PurePython API v2.0",
  "license": "License information\n        \n        Copyright (C) 2011 and beyond by Yoctopuce Sarl, Switzerland.\n        \n        Yoctopuce Sarl (hereafter Licensor) grants to you a perpetual\n        non-exclusive license to use, modify, copy and integrate this\n        file into your software for the sole purpose of interfacing\n        with Yoctopuce products.\n        \n        You may reproduce and distribute copies of this file in\n        source or object form, as long as the sole purpose of this\n        code is to interface with Yoctopuce products. You must retain\n        this notice in the distributed source file.\n        \n        You should refer to Yoctopuce General Terms and Conditions\n        for additional information regarding your rights and\n        obligations.\n        \n        THE SOFTWARE AND DOCUMENTATION ARE PROVIDED \"AS IS\" WITHOUT\n        WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING\n        WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, FITNESS\n        FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO\n        EVENT SHALL LICENSOR BE LIABLE FOR ANY INCIDENTAL, SPECIAL,\n        INDIRECT OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA,\n        COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR\n        SERVICES, ANY CLAIMS BY THIRD PARTIES (INCLUDING BUT NOT\n        LIMITED TO ANY DEFENSE THEREOF), ANY CLAIMS FOR INDEMNITY OR\n        CONTRIBUTION, OR OTHER SIMILAR COSTS, WHETHER ASSERTED ON THE\n        BASIS OF CONTRACT, TORT (INCLUDING NEGLIGENCE), BREACH OF\n        WARRANTY, OR OTHERWISE.",
  "license_expression": null,
  "home_page": "https://www.yoctopuce.com/EN/libraries.php",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/yoctopuce/yoctolib_typedpython",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1771228022,
  "project_urls": {
    "Issues": "https://github.com/yoctopuce/yoctolib_typedpython/issues",
    "Repository": "https://github.com/yoctopuce/yoctolib_typedpython",
    "Changelog": "https://www.yoctopuce.com/EN/release_notes.php?sessionid=-1&file=YoctoLib.typedpython.57762.zip",
    "Documentation": "https://www.yoctopuce.com/EN/doc/reference/yoctolib-typedpython-EN.html",
    "Homepage": "https://www.yoctopuce.com/EN/libraries.php"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}