{
  "name": "quickapi-async",
  "version": "1.1.0",
  "summary": "Simple asynchronous HTTP client with retry, timeout, and SSL options",
  "license": "PROPRIETARY LICENSE\n        \n        Copyright (c) 2026 Nikita Oleynik\n        \n        All rights reserved.\n        \n        This software is proprietary and confidential.\n        \n        Permission is granted to use this software solely as a library in compiled or\n        interpreted form for personal or commercial projects, provided that the source\n        code is not copied, modified, distributed, or disclosed.\n        \n        You MAY:\n        - Use the software as a dependency in your own projects\n        - Call and integrate the public API of the software\n        \n        You MAY NOT:\n        - Copy, modify, adapt, or create derivative works of the source code\n        - Distribute, publish, sublicense, sell, rent, or lease the software\n        - Reverse engineer or attempt to extract the source code\n        - Use the software as the basis for another library or framework\n        \n        The software is provided \"AS IS\", without warranty of any kind, express or\n        implied, including but not limited to the warranties of merchantability,\n        fitness for a particular purpose, and noninfringement.\n        \n        In no event shall the author be liable for any claim, damages, or other\n        liability, whether in an action of contract, tort, or otherwise, arising from,\n        out of, or in connection with the software or the use or other dealings in the\n        software.",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": "Nikita Oleynik",
  "repository": null,
  "repository_source": null,
  "download": null,
  "download_source": null,
  "pub_date": 1769234510,
  "project_urls": {},
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}