{
  "name": "webchanges",
  "version": "3.33.0",
  "summary": "Web Changes Delivered. AI-Summarized. Totally Anonymous.",
  "license": "========\n        Licenses\n        ========\n        \n        The MIT License (MIT)\n        \n        Copyright (c) 2020- Mike Borsetti <mike@borsetti.com>\n        \n        Permission is hereby granted, free of charge, to any person obtaining a copy of\n        this software and associated documentation files (the \"Software\"), to deal in\n        the Software without restriction, including without limitation the rights to\n        use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of\n        the Software, and to permit persons to whom the Software is furnished to do so,\n        subject to the following conditions:\n        \n        The above copyright notice and this permission notice shall be included in all\n        copies or substantial portions of the Software.\n        \n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS\n        FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR\n        COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER\n        IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\n        CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n        \n        --------------------------------------------------------------------------------\n        \n        SOURCE CODE REDISTRIBUTION NOTICE\n        (urlwatch by Thomas Perl)\n        \n        This software redistributes source code of release 2.21, dated 30 July 2020, of\n        urlwatch\n        https://github.com/thp/urlwatch/tree/346b25914b0418342ffe2fb0529bed702fddc01f,\n        which is subject to the following copyright notice and license (from\n        https://raw.githubusercontent.com/thp/urlwatch/346b25914b0418342ffe2fb0529bed702fddc01f/COPYING),\n        hereby retained and redistributed with the source code (of which this license\n        file is part of), in binary form, and in the documentation. The appearance of\n        the name of the author below does not constitute an endorsement or promotion of\n        this software by such author.\n        \n        Copyright (c) 2008-2020 Thomas Perl <m@thp.io>\n        All rights reserved.\n        \n        Redistribution and use in source and binary forms, with or without\n        modification, are permitted provided that the following conditions\n        are met:\n        \n        1. Redistributions of source code must retain the above copyright\n           notice, this list of conditions and the following disclaimer.\n        2. Redistributions in binary form must reproduce the above copyright\n           notice, this list of conditions and the following disclaimer in the\n           documentation and/or other materials provided with the distribution.\n        3. The name of the author may not be used to endorse or promote products\n           derived from this software without specific prior written permission.\n        \n        THIS SOFTWARE IS PROVIDED BY THE AUTHOR ''AS IS'' AND ANY EXPRESS OR\n        IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\n        OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.\n        IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,\n        INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT\n        NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n        DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n        THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n        (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF\n        THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n        ",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/mborsetti/webchanges/",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1769868881,
  "project_urls": {
    "Changelog": "https://webchanges.readthedocs.io/en/stable/changelog.html",
    "Issues": "https://github.com/mborsetti/webchanges/issues",
    "Documentation": "https://webchanges.readthedocs.io/",
    "Repository": "https://github.com/mborsetti/webchanges/",
    "CI": "https://github.com/mborsetti/webchanges/actions"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": true,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}