{
  "name": "xpressinsight",
  "version": "1.17.0",
  "summary": "FICO Xpress - Insight Python package",
  "license": "SHRINKWRAP LICENSE AGREEMENT\n        FICO(R) Xpress Optimization Suite (On-Premises)\n        Last Updated: August 15, 2025\n        This Shrinkwrap License Agreement FICO(R) Xpress Optimization Suite (On-Premises) (\"SWLA\") is an agreement\n        between you (either individually, and if client is an entity, as an authorized representative of such entity)\n        (\"Client\") and Fair Isaac Corporation or any of its Affiliates or any successor company, from whom the Fair Isaac\n        Product is licensed or to whom this SWLA is assigned (\"Fair Isaac\"), for the enclosed Fair Isaac Products: Xpress\n        Optimization Suite and included materials.\n        This SWLA is effective upon (a) the date of a Fair Isaac provided purchase order for the licensing of the Fair Isaac\n        Product (\"FICO Order\"), (b) Client and Fair Isaac entering into a signed order form agreement for the purchase of\n        a license (or an evaluation license) to the Fair Isaac Product (\"Signed License Agreement\"), or (c) the first delivery,\n        installation or use of the Fair Isaac Product; whichever date is earliest (\"Effective Date\" or \"Commencement\n        Date\"). Please read the terms of this SWLA carefully before you install or use the Fair Isaac Product (defined\n        below).\n        BY SUBMITTING A FICO ORDER OR ENTERING INTO A SIGNED LICENSE AGREEMENT OR INSTALLING, COPYING OR\n        OTHERWISE USING THE FAIR ISAAC PRODUCT OR BY CLICKING ON THE \"ACCEPT\" BUTTON THAT PRESENTS UPON\n        INSTALLATION OF THIS FAIR ISAAC PRODUCT, YOU (BOTH PERSONALLY AND, IF CLIENT IS AN ENTITY, AS AN\n        AUTHORIZED REPRESENTATIVE OF CLIENT) SIGNIFY YOUR ACCEPTANCE OF EACH AND EVERY TERM AND\n        CONDITION CONTAINED IN THIS SWLA and you acknowledge that you have been presented with this SWLA in a\n        written form accompanying the delivery of the Fair Isaac Product and/or electronically upon initialization of the\n        Fair Isaac Product and have had the reasonable opportunity to reject these terms and conditions of this SWLA.\n        Upon submission of a FICO Order or execution of a Signed License Agreement or copying, delivery, installation or\n        use of the Fair Isaac Product, you and Client will be bound by all the terms, conditions and restrictions contained\n        in this SWLA and will not be entitled to a refund of any fees paid.\n        Fair Isaac, Client and any user of the Fair Isaac Product hereby agree as follows:\n        1.\tDefinitions. In the Agreement the following terms have the meanings given below. Additional terms may\n        be defined elsewhere in the Agreement.\n        \"Affiliate\" of a party means any other person or entity that, directly or indirectly, controls, is controlled by, or is\n        under common control with, such party, where \"control\" means the power, directly or indirectly, to direct or\n        cause the direction of the management and policies of another person or entity, whether through ownership of\n        voting securities, by contract or otherwise. The other person or entity is only considered an Affiliate as long as\n        such control exists.\n        \"Agreement\" means this SWLA, the Purchasing Documentation and Maintenance Policy, including all exhibits and\n        documents incorporated therein, considered as a whole, as they may be amended.\n        \"Authorized User\" means an individual employee or independent contractor of Client, who has been designated\n        by Client to have access to and use of the Fair Isaac Product for and on behalf of Client, on the Client's Operating\n        Platform, for whom Client is responsible, and who is bound by the obligations of confidentiality hereunder.\n        \"Client Data\" means all data, including consumer records, customer information, purchase information and\n        merchant information, provided by or on behalf of Client to Fair Isaac for Fair Isaac to perform its obligations\n        under the Agreement.\n        \"Concurrent Executions\" means the simultaneous execution of 2 or more instances of the Fair Isaac Product at\n        any given time, pursuant to a specified license.\n        \"Concurrent Users\" means 2 or more Authorized Users who are licensed to access the Fair Isaac Product\n        concurrently at any given time.\n        \"Confidential Information\" means financial, business and/or technical information, regardless of the form or\n        manner in which the information is disclosed or learned, including, but not limited to, marketing and product\n        plans, ideas, concepts, business plans, employees and employee information, inventions, algorithms, decision\n        technology and/or models, processes, designs, specifications, drawings, samples, improvements, developments,\n        applications, engineering, manufacturing and marketing data and plans, software code (object and source code),\n        documentation (including without limitation manuals, training materials, and presentations), functionality,\n        security procedures and approaches, know-how, experimental work, distribution arrangements, trade secrets and\n        other information that under the circumstances would be deemed by a reasonable person to be confidential. Fair\n        Isaac Materials (defined below) are the Confidential Information of Fair Isaac. The party disclosing Confidential\n        Information is the \"Discloser\", and the party receiving Confidential Information is the \"Recipient\".\n        \"Cooperation\" means Client's cooperation and provision of information reasonably required for Fair Isaac to\n        perform its obligations in accordance with the Agreement, including without limitation: (i) providing data and\n        materials in the format and according to the specifications required by Fair Isaac; (ii) for onsite services, providing\n        Fair Isaac with necessary access to office accommodations, facilities and equipment; (iii) providing access to\n        information and software interfaces to Client's business applications; (iv) providing personnel assistance as\n        reasonably requested by Fair Isaac; and (v) cooperating with Fair Isaac, making decisions and communicating all\n        information in a timely manner.\n        \"CPU\" means an individual physical central processing unit with one or more Physical Cores. Without limiting the\n        foregoing, if a processing unit is part of a \"virtual\" environment, or otherwise utilizes virtualization mechanics or\n        similar technology, up to 8 Logical Processors shall count as one CPU unless otherwise specified in the Purchasing\n        Documentation.\n        \"Documentation\" means Fair Isaac's standard, generally available user guide and technical manuals for the Fair\n        Isaac Product, whether in printed or electronic form, as may be amended by Fair Isaac from time to time.\n        \"Fair Isaac Product\" means a generally available software, component, module, functionality or analytic product\n        of Fair Isaac, including a Model and Software, described in the Purchasing Documentation (or in the Community\n        License or End User License materials and documents), which is licensed under the Agreement for on-premises\n        installation; and excluding all Third Party Products.\n        \"Floating License\" means the license to on-premises installed license management Software (a Fair Isaac Product)\n        that runs concurrently with the Fair Isaac Product license, both of which are purchased by Client under the\n        Purchasing Documentation. The Floating License permits Client to manage (on its own Operating Platform) a\n        limited number of purchased Fair Isaac Product licenses among Concurrent Users or CPU machines, as applicable,\n        pursuant to the Purchasing Documentation.\n        \"Intellectual Property\" or \"Intellectual Property Rights\" means rights associated with any intangible property\n        anywhere in the world, whether or not filed or registered, including, without limitation: (i) patents, patent\n        applications, and inventors' certificates; (ii) copyrights (including moral rights and author's rights), works of\n        authorship, copyright registrations and applications; (iii) database rights; (iv) know-how, trade secrets, and rights\n        in and to confidential information; (v) industrial designs (including utility models); and (vi) trademarks, trade\n        names, service marks, logos, Internet addresses (URLs), and the goodwill associated with them.\n        \"Internal Use\" means use of the Fair Isaac Product by Client or End User of Client for its own internal business\n        purposes only, and not accessible by, or for the benefit of, any Third Party, subject to the terms of the Agreement.\n        \"License Term\" shall begin on the Effective Date and continue for the period of time stated in the Purchasing\n        Documentation, and if no time period is stated in the Purchasing Documentation then the License Term shall be a\n        period of one (1) year. The License Term is otherwise non-cancelable by Client.\n        \"Logical Processors\" means the number of a CPU's physical cores multiplied by the number of threads per core.\n        \"Maintenance Services\" means the software support and maintenance services for the Fair Isaac Products\n        pursuant to the Fair Isaac Software Support and Maintenance Policy currently available at\n        https://www.fico.com/en/fair-isaac-software-support-and-maintenance-policy (and any successor or related\n        locations designated by Fair Isaac), as it may be updated by Fair Isaac from time to time (\"Maintenance Policy\" or\n        \"Policy\").\n        \"Model\" means, individually or collectively as the context requires, predictive or descriptive algorithms, analytics\n        and/or equations developed by Fair Isaac and from which a score, cell assignment, segmentation and/or decision\n        logic can be generated. Model includes both the process of applying the Client Data, as well as the predictive,\n        neural or descriptive algorithms and equations, and scores or other output therefrom.\n        \"Non-Production\" means use of the Fair Isaac Product for non-commercial purposes in Client's test and\n        development environment only.\n        \"Operating Platform\" or \"Platform\" means Client's computing or operating environment that is supported and\n        complies with the Documentation.\n        \"Party(ies)\" or \"party(ies)\" means Fair Isaac and Client.\n        \"Permitted Use\" means an Client's Internal Use in accordance with Article 2 below, and subject to the additional\n        license terms and other restrictions set forth in the Agreement.\n        \"Physical Core\" means the hardware core of a CPU.\n        \"Production\" means any use of the Fair Isaac Product other than Non-Production use.\n        \"Production Site\" is Client's address where the Fair Isaac Product is installed for Production use within the\n        Territory and set forth in the Purchasing Documentation.\n        \"Purchasing Documentation\" means any and all ordering documents related to the Client's purchase of licenses\n        to the Fair Isaac Products and Maintenance Services, including but not limited to quotations, FICO Order(s), the\n        Signed License Agreement(s), and invoice(s), that identifies and describes among other things, the Fair Isaac\n        Product(s) and/or Third Party Software, License Term, Territory, the number of licenses purchased and the\n        limitations on those licenses, Maintenance Services provided to Client, together with all exhibits, schedules, and\n        other attachments thereto. Limitations may be based on, among other things, Concurrent Executions, Concurrent\n        Users, Seat, CPU, Named Application, Platforms, usage, Non-Production use and Third Party Product license terms\n        and conditions.\n        \"Seat\" means an identified individual Authorized User accessing the Fair Isaac Product.\n        \"Single Execution\" means execution of no more than one (1) instance of the Fair Isaac Product at any given time,\n        pursuant to a specified license.\n        \"Software\" means all programs, applications, code, specifications, graphical user interface (GUI), including all\n        media of delivery thereof (CD, Tape, or other electronic means) provided to Client, and all Fair Isaac upgrades,\n        updates, modifications, releases, and enhancements to the Software provided to Client. Software excludes all\n        Third Party Product and Third Party Software.\n        \"Taxes\" mean all present and future taxes, duties, import deposits, assessments, and other governmental charges\n        (and any related penalties and interest not attributable to the fault or delay of Fair Isaac), however designated,\n        that are now or hereafter imposed by or under any governmental authority or agency that are: (i) associated with\n        the performance by Fair Isaac of its obligations under the Agreement; (ii) associated with the payment of any\n        amount by Client to Fair Isaac pursuant to the Agreement; (iii) based on the license or use of any Fair Isaac-\n        provided product or service; or (iv) associated with the importation of any Fair Isaac-provided product into or use\n        of any Fair Isaac-provided service within a country other than the country in which Fair Isaac is organized,\n        excepting only: (a) Fair Isaac's corporate franchise taxes and taxes imposed on Fair Isaac's net income by the\n        governmental authorities or agencies in any jurisdictions in which Fair Isaac is required to pay those taxes; (b)\n        withholding, employment, and payroll taxes relating to Fair Isaac's employees; and (c) personal property taxes on\n        Fair Isaac property.\n        \"Territory\" means the geographic region specified in the Purchasing Documentation. If the Territory is not\n        specified in the Purchasing Documentation, the Territory is the United States of America. With respect to\n        Community License(s) only, the Territory shall be worldwide and shall exclude all countries, regions and territories\n        that are prohibited by Fair Isaac and the United States' statutes, laws, regulations and regulations promulgated\n        thereunder.\n        \"Third Party\" means any person or entity that is not directly a named party to the Agreement.\n        \"Third Party Product\" or \"Third Party Software\" means the products or services of a third party that are\n        incorporated within Fair Isaac products or services, or licensed to Client by Fair Isaac, including such third party's\n        software, products, services, systems, databases, open source code, reports, lists, files or other materials.\n        \"Web Floating License\" means the license to the hosted service of the license management Software (a Fair Isac\n        Product) that can be used with the Fair Isaac Product license, both of which are purchased by Client under the\n        Purchasing Documentation. The Web Floating License permits Client to manage (through internet access) a\n        limited number of purchased Fair Isaac Product licenses among Concurrent Users or CPU machines, as applicable,\n        pursuant to the Purchasing Documentation.\n        2.\tLicense Grants and Restrictions\n        2.1.\tGrant of License.\n        2.1.1.\tFair Isaac Product - Paid License. Subject to the terms and conditions of the Agreement and payment of\n        all license fees, Fair Isaac hereby grants to Client during the License Term, a personal, non-exclusive, non-\n        transferable, non-assignable, non-sublicenseable, limited license for Authorized Users to use one (1) single copy\n        and instance of the Fair Isaac Product within the Territory at the Production Site on one (1) Operating Platform\n        that has been specified in the Documentation, for Client's Internal Use only and as set forth below in this section,\n        subject to Client's compliance with all license terms, restrictions, limitations and other terms of the Agreement\n        and with all applicable foreign, federal, state and local laws and regulations. Client's use of the Fair Isaac Product\n        under the Agreement shall be limited solely to the Permitted Use defined hereunder. Additional license and other\n        restrictions applicable to a Fair Isaac Product may be set forth in the Purchase Documentation. Under no\n        circumstances shall Client use any Fair Isaac Product on a stand-alone basis or in connection with any application\n        or use case not expressly defined in the Permitted Use, or for the benefit of any third party.\n        (a)\tClass 1 License (Single Authorized User, Single Execution). If the license to the Fair Isaac Product is\n        designated by the Purchasing Documentation as a Class 1 License, then Client is permitted to operate a\n        single execution of the Fair Isaac Product by only a single Authorized User on a single personal computer\n        (e.g., a desktop computer or a laptop computer). Transfer of the license to a different computer must be\n        approved by Fair Isaac and may incur additional fees. Access to or operation of the Fair Isaac Product on\n        the personal computer through remote or network access technology of any kind is not permitted.\n        Running multiple instances of the Fair Isaac Product at any given time is not permitted.\n        (b)\tClass 2 License (Multiple Authorized Users, Single Execution). If the license to the Fair Isaac\n        Product is designated by the Purchasing Documentation as a Class 2 License, then Client is permitted to\n        operate a single execution of the Fair Isaac Product on one (1) computer with one (1) Operating Platform\n        (e.g., a personal computer, a workstation computer, or a server computer). Transfer of the license to a\n        different Operating Platform or with hardware components different from those listed in the Purchasing\n        Documentation must be approved by Fair Isaac in writing and may incur additional fees. Any number of\n        Authorized Users can access the Fair Isaac Product on the single Operating Platform, and access to or\n        operation of the Fair Isaac Product using remote or network access technology is permitted in accordance\n        with the Documentation. However, running multiple instances of the Fair Isaac Product at any given time\n        is not permitted.\n        (c)\tClass 3 License (Unlimited Authorized Users, Concurrent Executions). If the license to the Fair\n        Isaac Product is designated by the Purchasing Documentation as a Class 3 License, then Client is permitted\n        to operate the Fair Isaac Product on one (1) designated computer with one (1) Operating Platform (e.g., a\n        personal computer, a workstation computer, or a server computer). Transfer of the license to a different\n        Operating Platform or with hardware components different from those listed on the Purchasing\n        Documentation must be approved by Fair Isaac in writing and may incur additional fees. Any number of\n        Authorized Users can access the Fair Isaac Product on the single Operating Platform, and access to or\n        operation of the Fair Isaac Product using remote or network access technology is permitted. Client may\n        run unlimited Concurrent Executions of the Fair Isaac Product to solve an unlimited number of Models\n        concurrently. However, running multiple instances of the Fair Isaac Product at any given time is not\n        permitted.\n        (d)\tFloating License. If the license for the Fair Isaac Product is designated by the Purchasing\n        Documentation as a Floating License (e.g., may be indicated by a separate line item) and limited to a\n        specified number of Concurrent Users and Concurrent Executions, then Client is permitted to install the\n        Fair Isaac Product on an unlimited number of machines on Client's Operating Platform. The number of\n        Models being executed concurrently by the Fair Isaac Product at any given time shall not exceed the\n        number of Concurrent Users and/or Concurrent Executions purchased with the license under the\n        Purchasing Documentation.\n        (e)\tWeb Floating License. If the license for the Fair Isaac Product is designated by the Purchasing\n        Documentation as a Web Floating License (e.g., may be indicated as a separate line item) and limited to a\n        specified number of Concurrent Users and Concurrent Executions, then Client is permitted to install the\n        Fair Isaac Product on an unlimited number of machines on Client's Operating Platform. The number of\n        Models being executed concurrently by the Fair Isaac Product at any given time shall not exceed the\n        number of Concurrent Users and/or Concurrent Executions purchased with the license under the\n        Purchasing Documentation. Web Floating Licenses require internet connectivity to URLs in accordance\n        with the Documentation. Additional usage limits may apply as specified in the Purchasing Documentation.\n        (f)\tNon-Production or Development License. If the license to the Fair Isaac Product is designated by\n        the Purchasing Documentation as a Non-Production license or a Development license, then Client shall\n        use the Fair Isaac Product for Non-Production purposes only, and Client shall not use any application,\n        solution or model developed under the Non-Production license for any internal data processing or for any\n        commercial, operational, runtime or other Production purposes.\n        (g)\tDongle License. If the license to the Fair Isaac Product is designated by the Purchasing\n        Documentation as for use with a purchased hardware USB dongle device, then Client is permitted to\n        install the Fair Isaac Product on an unlimited number of machines on Client's local Operating Platform,\n        and Client is authorized to run a maximum of one (1) instance or copy of the Fair Isaac Product on one (1)\n        CPU machine at any given time using the dongle provided.\n        (h) \tSingle Authorized Insight User License. If the license to the Fair Isaac Product is designated in the\n        Purchasing Documentation as limited to a specified number of Authorized Users or Seats, then Client is\n        permitted to install the Fair Isaac Product on a server or any supported Operating Platform that is\n        accessed only by designated Authorized Users through a local area network, provided that the number of\n        Authorized Users accessing the Fair Isaac Product at any one time does not exceed the number of\n        Authorized Users or Seats purchased under the Purchasing Documentation.\n        (i)\tInsight Viewer License. If the license to the Fair Isaac Product is designated by the Purchasing\n        Documentation as an Insight Viewer License, then the Fair Isaac Product may only be used by Authorized\n        Users to view visualizations, reports and data of scenarios.\n        (j)\tInsight Admin License. If the license to the Fair Isaac Product is designated by the Purchasing\n        Documentation as an Insight Admin License, then Fair Isaac Product may only be used by Authorized\n        Users for the purposes of performing administrative tasks such as installation, user management and\n        resource management.\n        (k)\tOther Limitations. If the license for the Fair Isaac Product is limited in the Purchasing\n        Documentation in any other manner, Client's use of the Fair Isaac Product is subject to those other\n        limitations. These additional limitations may be based on, among other things, department, features,\n        capacity, license type, use case or otherwise.\n        2.1.2.\tEvaluation License. If Client is receiving an evaluation license to the Fair Isaac Product (either through\n        access to Fair Isaac's electronic evaluation site or otherwise), then the terms and conditions of the Agreement and\n        this section shall define such evaluation license grant to Client. Fair Isaac hereby grants to Client a personal,\n        revocable, non-exclusive, non-transferable, non-sublicensable, non-assignable, limited license to display and\n        perform the Fair Isaac Product and Documentation within the Territory for a period of 30 days (unless 60 days is\n        expressly stated in the Purchasing Documentation) from the delivery date of the Fair Isaac Product (\"Evaluation\n        Period\"), solely for Non-Production purposes for Client to evaluate whether Client wants to purchase a license to\n        the Fair Isaac Product, only by Authorized Users, and subject to the limitations set forth in the Agreement and/or\n        otherwise imposed by Fair Isaac. At the end of the Evaluation Period, all license grants shall immediately\n        terminate and are hereby revoked, and Client shall immediately cease all use of the Fair Isaac Product.\n        2.1.3.\tCommunity License.  If Client is receiving a Community License, then subject to the terms and conditions\n        of the SWLA and this section, Fair Isaac hereby grants to Client a personal, revocable, non-exclusive, non-\n        transferable, non-assignable, non-sublicenseable, limited license to use the Fair Isaac Product within the Territory\n        for a period of one (1) year from the delivery date of the Fair Isaac Product (\"Community License Period\") for\n        Client's own Internal Use, and subject to Client's compliance with all license terms, restrictions and limitations\n        herein. The Community License is provided \"AS IS\" without any warranty, support and Maintenance Services.  If\n        Client wants Maintenance Services for the Fair Isaac Product, then Fair Isaac will provide such support pursuant to\n        a fee-based maintenance and support agreement. As a condition of the license grant herein, Client shall not\n        upload any personally identifiable or other protected personal data (\"Personal Data\").\n        2.1.4.\tEnd User License. If Client is an authorized reseller or distributor of Fair Isaac under an effective Signed\n        License Agreement, then subject to the terms and conditions of the SWLA and this Article 2 inclusive, Fair Isaac\n        hereby grants to the end user customer of such reseller/distributor Client (\"End User\") a personal, revocable, non-\n        exclusive, non-transferable, non-assignable, non-sublicenseable, limited license to use the Fair Isaac Product\n        within the Territory for the period of time that Fair Isaac has granted such sublicense grant to such\n        reseller/distributor Client, or for a period of one (1) year from the delivery date of the Fair Isaac Product if no time\n        is specified (\"End User License Period\"), for End User's own Internal Use, and subject to both Client's and End\n        User's compliance with all license terms, restrictions and limitations herein. The End User License is provided \"AS\n        IS\" without any warranty, support and Maintenance Services.  If End User wants Maintenance Services for the Fair\n        Isaac Product, Client must provide such support to End User. As a condition of the license grant herein, End User\n        shall not upload any Personal Data. End User must comply with and is subject to all of the same terms and\n        conditions contained in the Agreement as Client.\n        2.1.5.\tDocumentation. Subject to the terms and conditions of the Agreement, Fair Isaac hereby grants to Client\n        during the License Term, Evaluation Period and Community License Period (as applicable), a personal, revocable,\n        non-exclusive, non-transferable, non-assignable, non-sublicenseable, limited license to perform and display the\n        Documentation in the Territory solely for Client's and Authorized Users' Permitted Use of the Fair Isaac Product,\n        and subject to the same terms, conditions and restrictions that apply to the Fair Isaac Product. Client may\n        internally reproduce Documentation only to the extent permitted under the Agreement. Client shall only use the\n        Fair Isaac Product in accordance with such Documentation.\n        2.2.\tReservation of Rights. Fair Isaac reserves all rights not expressly granted to Client under the Agreement.\n        Unless otherwise expressly provided, all Intellectual Property Rights in products, services, custom code,\n        documentation, deliverables, other materials and know-how owned or developed in whole or in part by Fair Isaac\n        or any of its Affiliates, including Fair Isaac Products and Documentation (all of the foregoing, \"Fair Isaac\n        Materials\"), are retained exclusively by Fair Isaac or that Affiliate. Subject to Fair Isaac's obligations with respect\n        to Client's Confidential Information, Fair Isaac and its Affiliates are free to use any ideas, concepts, techniques,\n        and know-how developed pursuant to the Agreement for themselves and for other clients.\n        2.3.\tNotice Reproduction. To the extent Client is given rights to reproduce any Fair Isaac Materials, Client must\n        reproduce on each copy of such materials any copyright, patent, or trademark notice, and any other proprietary\n        legends that were contained in the originals.\n        2.4.\tRestrictions. Client and its employees, representatives, and/or agents will not, with respect to products,\n        services and deliverables provided by Fair Isaac: (i) use them for any purpose other than the internal business\n        operations of Client or in any other manner that exceeds the scope of the licenses granted under the Agreement\n        or that otherwise violates the Agreement; (ii) in any way modify, adapt, translate, combine them with other\n        works, or make derivative works from them; (iii) reverse engineer, decompile, disassemble, or otherwise attempt\n        to reduce any object code to human perceivable form or permit others to do so; (iv) disclose them to, or permit\n        the use or access of them by, any third party; (v) assign, license, lease, transfer, or distribute them; (vi) operate\n        any of them for timesharing, rental, outsourcing, or service bureau operations (or otherwise for the benefit of any\n        party other than Client); or (vii) disclose or publish performance benchmark results for them without Fair Isaac's\n        prior written consent.\n        2.5.\tMaintenance Services. Standard and generally available Fair Isaac Products are eligible to receive\n        Maintenance Services. Client's license grants and right to receive Maintenance Services are subject to Client's\n        payment of all fees. If Client fails to pay fees or does not comply with the license terms, conditions and\n        restrictions, then Fair Isaac at its option may immediately suspend Maintenance Services, until such failure or\n        noncompliance has been cured. Such suspension is in addition to Fair Isaac termination rights under the\n        Agreement and does not relieve Client of its payment obligations. Maintenance Services do not apply to\n        Evaluation Licenses, Community Licenses and End User Licenses.\n        2.6.\tPlatforms/Options. Client shall only use the version of the Fair Isaac Product for the specific supported\n        platform(s) as set forth in the Documentation, unless the Signed License Agreement executed by both parties\n        states otherwise. Unless specifically set forth in the Purchasing Documentation, Client does not obtain any right to\n        options or additional related products or service.\n        3.\tProtection of Confidential Information\n        3.1.\tLimitations on Disclosure and Use. Recipient may use Confidential Information of the Discloser only for\n        the purposes of exercising Recipient's rights and fulfilling Recipient's obligations under the Agreement. Recipient\n        shall use the same degree of care, but no less than a reasonable degree of care, to protect against the\n        unauthorized disclosure or use of Discloser's Confidential Information as it uses to protect its own confidential\n        information of a similar type. Recipient shall disclose Confidential Information of Discloser only to its personnel\n        who have a need to know for the above stated purposes, provided each is bound by obligations of confidentiality\n        no less restrictive than the terms of the Agreement. Recipient shall not remove any confidentiality or proprietary\n        notices from Discloser's Confidential Information. If Recipient provides Discloser with comments, suggestions or\n        other input regarding Discloser's Confidential Information or Intellectual Property, Discloser will have an\n        unrestricted, worldwide, royalty-free right to use those comments, suggestions, or other input for any purpose\n        and in any manner, and to authorize others to do so.\n        3.2.\tExceptions. Recipient's obligation under the Agreement to treat information as Confidential Information\n        does not apply to information that: (i) is already known to Recipient at the time of disclosure and was not\n        obtained, directly or indirectly, from Discloser; (ii) is independently developed by Recipient without reference to\n        or use of the Discloser's Confidential Information; (iii) is obtained by Recipient from another source without a\n        breach of any obligation of confidentiality owed by that source to Discloser; or (iv) is or becomes publicly available\n        through no wrongful act of Recipient or any party that obtained the information from Recipient. If Recipient is\n        served with a subpoena or other legal process, court, or governmental request or order requiring disclosure, or is\n        otherwise required by law or securities exchange requirement to disclose, any of Discloser's Confidential\n        Information, Recipient shall, unless prohibited by law, promptly notify Discloser of that fact and cooperate fully\n        (at Discloser's expense) with Discloser and its legal counsel in opposing, seeking a protective order, seeking to\n        limit, or appealing the subpoena, legal process, request, order, or requirement to the extent deemed appropriate\n        by Discloser. Recipient may comply with the subpoena or other legal process or requirement after complying with\n        the foregoing sentence, but only to the extent necessary for compliance.\n        3.3.\tInjunctive Relief. The parties acknowledge that the remedies at law available for the protection of\n        Confidential Information or Intellectual Property may be inadequate, and, without limiting any rights available at\n        law, each party is entitled to seek injunctive relief for any breach of the Agreement relating to the protection of its\n        Confidential Information or Intellectual Property Rights.\n        4.\tRepresentations and Warranties\n        4.1.\tRepresentations. Each party represents that: (i) it is duly organized, validly existing, and in good standing\n        under the laws of its jurisdiction of incorporation or organization; (ii) it has the power and authority to enter into\n        and perform all its obligations under the Agreement; and (iii) the Purchasing Documentation has been signed\n        and/or accepted by its duly authorized representatives who are able to bind their respective companies.\n        4.2.\tWarranty. This section does not apply to Community Licenses, Evaluation Licenses and End User Licenses.\n        Fair Isaac warrants that the Fair Isaac Product will conform in all material respects to its Documentation for a\n        period of 30 days from the initial date of delivery of the Fair Isaac Product. To assert a warranty claim, Client must\n        report any breach of this warranty in writing within the warranty period (along with all information available to\n        Client that is relevant to verifying, diagnosing, or correcting the error). For any breach of this warranty, Client's\n        sole and exclusive remedy and Fair Isaac's entire liability shall be at Fair Isaac's option to either (i) correct any\n        reproducible error in the Fair Isaac Product reported to Fair Isaac, or (ii) replace the Fair Isaac Product. Warranty\n        Exclusions. The warranty above does not apply (i) if the Fair Isaac Product is not used in accordance with the\n        Agreement or its Documentation; (ii) if the non-conformity is caused by any third party product, service or\n        materials; (iii) to any modification of the Fair Isaac Product not performed by Fair Isaac; (iv) to any third party\n        software, product, service, system, database, open source code, reports, lists, files or other materials, or the\n        combination of any of the foregoing by Client with the Fair Isaac Product; and (v) any and all Evaluation License,\n        Community License and End User License grants to the Fair Isaac Product.\n        4.3.\tWARRANTY DISCLAIMER. Except to the extent expressly stated under the Agreement, Fair Isaac does not\n        warrant that any product, service or deliverable provided by Fair Isaac will: (i) meet Client's requirements; (ii)\n        operate in combination with hardware, software, systems or data not expressly specified in writing by Fair Isaac;\n        (iii) meet any performance level, resource utilization, response time, or system overhead requirements; or (iv)\n        operate uninterrupted, free of errors, or without delay. Fair Isaac is not responsible for problems or errors caused\n        by: (a) use of any product, service or deliverable provided by Fair Isaac outside the scope of the Agreement or not\n        used in compliance with applicable documentation; (b) any modification to a product, service or deliverable not\n        made by Fair Isaac; (c) any change in or modification to the operating characteristics of Client's system or any\n        component of Client's system that is inconsistent with the product or services documentation or specification; or\n        (d) use of any product, service or deliverable provided by Fair Isaac with hardware or software that is not\n        indicated in the applicable documentation to be interoperable with the same. EXCEPT FOR THE EXPRESS\n        WARRANTIES SET FORTH IN THE AGREEMENT, FAIR ISAAC MAKES NO WARRANTIES, EITHER EXPRESS OR IMPLIED,\n        AND HEREBY DISCLAIMS ALL IMPLIED WARRANTIES, INCLUDING ANY WARRANTIES REGARDING\n        MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE, WARRANTIES OF TITLE AND NON-INFRINGEMENT,\n        AND ANY WARRANTY ARISING FROM A COURSE OF DEALING, USAGE, OR TRADE PRACTICE. CLIENT IS SOLELY\n        RESPONSIBLE FOR ITS USE OF ANY PRODUCTS, SERVICES AND DELIVERABLES PROVIDED BY FAIR ISAAC UNDER THE\n        AGREEMENT AND FOR ANY LIABILITY ARISING FROM SUCH USE, INCLUDING CONCLUSIONS DRAWN THEREFROM,\n        OR FROM THE DATA OR CONTENT SUPPLIED BY CLIENT. IF CLIENT IS RECEIVING A COMMUNITY LICENSE OR A\n        LICENSE TO THE FAIR ISAAC PRODUCT FOR EVALUATION PURPOSES, THEN THE WARRANTY SET FORTH IN SECTION\n        4.2 WILL NOT APPLY AND CLIENT ACKNOWLEDGES AND AGREES THAT THE FAIR ISAAC PRODUCT IS LICENSED ON\n        AN \"AS IS\" BASIS WITHOUT ANY WARRANTY.\n        5.\tIndemnification. Client shall defend at its own expense any action against Fair Isaac or its Affiliates\n        brought by a third party to the extent the action is based upon: (i)(a) any violation of the terms of Client's license,\n        (b) any combination or use of any Fair Isaac Product with other products, equipment, software or data, (c) any\n        modification of a Fair Isaac Product made pursuant to Client specifications or any other modification made by any\n        entity other than Fair Isaac or its Affiliates, (d) any claim that would have been avoided or mitigated had Client\n        upgraded to a new version or release of the Fair Isaac Product made available by Fair Isaac to Client, (e) any third\n        party software or other material, including Third Party Products, (f) trial or beta use of the Fair Isaac Product, or\n        (g) any unauthorized use of the Fair Isaac Product or use other than in accordance with the applicable\n        documentation; (ii) any data, information, documentation, software, service, technology or other material\n        provided to Fair Isaac by Client or at Client's direction, including but not limited to Client Data and other Client\n        material; or (iii) Fair Isaac's adherence to specifications or requirements provided by Client. Client will pay those\n        costs and damages finally awarded against Fair Isaac or its Affiliates in the action that are specifically attributable\n        to that claim, or those costs and damages agreed to in a monetary settlement of the action that are specifically\n        attributable to the claim. For the avoidance of doubt, Client shall not admit liability or incur obligations on Fair\n        Isaac's behalf without Fair Isaac's prior written consent. Fair Isaac has no obligation with respect to any claim\n        based on or arising out of the foregoing clauses (i), (ii) and (iii).\n        6.\tLimitation of Liability\n        6.1.\tIN NO EVENT WILL EITHER PARTY BE LIABLE UNDER ANY THEORY OF RECOVERY (INCLUDING WITHOUT\n        LIMITATION BREACH OF CONTRACT, BREACH OF WARRANTY, NEGLIGENCE, TORT AND STRICT LIABILITY) FOR ANY\n        INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, CONSEQUENTIAL (INCLUDING WITHOUT LIMITATION LOSS OF\n        DATA, USE, GOODWILL, INCOME, PROFIT OR SAVINGS) OR PUNITIVE DAMAGES ARISING OUT OF OR IN\n        CONNECTION WITH THE AGREEMENT OR ANY PRODUCT, SERVICE OR DELIVERABLE PROVIDED BY FAIR ISAAC\n        UNDER THE AGREEMENT, EVEN IF THE RESPONSIBLE PARTY HAD BEEN ADVISED OF THE POSSIBILITY OF THOSE\n        TYPES OF DAMAGES OR EVEN IF THOSE TYPES OF DAMAGES WERE REASONABLY FORESEEABLE; PROVIDED,\n        HOWEVER, THE FOREGOING LIMITATION IS INAPPLICABLE TO: (A) CLIENT'S OBLIGATION TO PAY AMOUNTS OWED\n        TO FAIR ISAAC FOR PRODUCTS, SERVICES AND DELIVERABLES PROVIDED BY FAIR ISAAC UNDER THE AGREEMENT\n        OR OTHERWISE (INCLUDING COSTS OF COLLECTION OF UNPAID AMOUNTS), (B) DAMAGES ARISING FROM OR AS\n        A RESULT OF AN INFRINGEMENT OR VIOLATION OF FAIR ISAAC'S INTELLECTUAL PROPERTY RIGHTS (INCLUDING\n        BREACH OF ANY LICENSE GRANT OR RESTRICTION) AND (C) CLIENT'S INDEMNIFICATION OBLIGATIONS UNDER THE\n        AGREEMENT.\n        6.2.\tSUBJECT TO SECTION 6.1 AND SECTION 6.3, THE TOTAL AGGREGATE LIABILITY OF EITHER PARTY FOR ALL\n        CLAIMS ARISING UNDER OR RELATED TO THE AGREEMENT, UNDER ANY AND ALL THEORIES OF LIABILITY\n        (INCLUDING WITHOUT LIMITATION BREACH OF CONTRACT, BREACH OF WARRANTY, NEGLIGENCE, TORT AND\n        STRICT LIABILITY), WILL NOT EXCEED THE TOTAL AMOUNT PAID BY CLIENT (EXCLUDING IMPLEMENTATION FEES\n        AND REIMBURSED EXPENSES) FOR THE FAIR ISAAC PRODUCT(S), SERVICE(S) OR DELIVERABLE(S) TO WHICH THE\n        CLAIM(S) RELATE(S) DURING THE 12 MONTHS IMMEDIATELY PRECEDING THE DATE OF THE MOST RECENT CLAIM\n        THAT GAVE RISE TO THE LIABILITY (THE \"LIABILITY CAP\"). NOTWITHSTANDING THE FOREGOING, THE FOLLOWING\n        ARE INDEPENDENT OF AND NOT SUBJECT TO THE LIABILITY CAP: (A) CLIENT'S OBLIGATION TO PAY AMOUNTS\n        OWED TO FAIR ISAAC FOR PRODUCTS, SERVICES AND DELIVERABLES PROVIDED BY FAIR ISAAC UNDER THE\n        AGREEMENT OR OTHERWISE (INCLUDING COSTS OF COLLECTION OF UNPAID AMOUNTS), (B) CLIENT'S\n        INDEMNIFICATION OBLIGATIONS UNDER THE AGREEMENT, AND (C) DAMAGES ARISING FROM OR AS A RESULT OF\n        AN INFRINGEMENT OR OTHER VIOLATION OF FAIR ISAAC'S INTELLECTUAL PROPERTY RIGHTS (INCLUDING BREACH\n        OF ANY LICENSE GRANT OR RESTRICTION).\n        6.3.\tNOTWITHSTANDING ANYTHING CONTAINED TO THE CONTRARY IN THE AGREEMENT OR OTHERWISE,\n        FAIR ISAAC'S LIABILITY CAP FOR ALL COMMUNITY LICENSES, EVALUATION LICENSES AND END USER LICENSES\n        SHALL BE AN AMOUNT EQUAL TO FIVE HUNDRED DOLLARS ($500) US DOLLARS. Fair Isaac has set its prices and\n        entered into the Agreement in reliance upon the limitations of liability and the disclaimers of warranties and\n        damages set forth herein, and the same forms an essential basis of the bargain between the parties.\n        7.\tPayment Terms\n        7.1.\tInvoices and Payments.\n        (a) \tAll fees and charges (other than expenses) will be set forth in the applicable Purchasing Documentation.\n        Except as otherwise provided, all fees, charges and expenses must be paid within 30 days of the date of an\n        invoice. All amounts are payable in the currency stated in the Purchasing Documentation (or, if no currency is\n        stated in the Purchasing Documentation, then in US Dollars) in accordance with the instructions provided in the\n        invoice or other instructions provided by Fair Isaac. Without prejudice to its other rights and remedies, if Fair Isaac\n        does not receive any payment by its due date, Fair Isaac may assess a late payment charge on the unpaid amount\n        at the rate of 1.5% per month or the highest rate allowed under applicable law, whichever is less. In addition, Fair\n        Isaac may terminate the relevant Purchasing Documentation, including any licenses granted to Client or otherwise\n        therein, or terminate the service concerned, but not until Fair Isaac has given Client written notice, and the\n        amount remains unpaid 30 days after Fair Isaac gives the notice. Client shall reimburse Fair Isaac for all costs\n        related to any proceedings to collect any amounts owed under or arising out of this Agreement, including without\n        limitation attorneys' fees and expenses. All fees paid hereunder are nonrefundable without any right of set-off or\n        deduction.\n        (b)\tClient shall timely pay all fees, costs and expenses hereunder in accordance with the terms of the\n        Agreement.  Fees for the Fair Isaac Product begin on the Commencement Date. Reference to \"year\" or \"annual\"\n        means each 1-year period that begins on the Commencement Date (or anniversary of the Commencement Date,\n        as applicable) within the License Term. All annual fees are due and payable on the Commencement Date and\n        thereafter on every anniversary of the Commencement Date. All one-time set up and other fees are due and\n        payable on the Effective Date. All monthly fees and all transaction, overage, volume-based and usage fees\n        (collectively, \"Transaction Fees\") are due and payable monthly in arrears. If there is a change to a size, tier or\n        other classification-based fee, such fee is due and payable in arrears immediately following the event that\n        changed such size, tier or classification.\n        (c) \tPayment of the fees under the Agreement permit Client to use of the Fair Isaac Product subject to the\n        Scope/Quantity Limit and other applicable terms, and no additional or excess use is permitted. An amendment to\n        the Agreement executed by both parties is required before Client is permitted to make any additional or excess\n        use, and Client understands that fees shall be subject to change.\n        (d) \tIn the event Fair Isaac requests information that is necessary for Fair Isaac to calculate or verify the\n        Transaction Fees, then Client will send such information within the time specified in Fair Isaac's request. Client is\n        responsible for payment of all fees for any and all use, access, transmission and/or processing of the Fair Isaac\n        Product in all environments and phases, as well as additional costs for services or items requested by Client that\n        are not included in the Fair Isaac Product.\n        7.2.\tCosts and Expenses. Prices do not include reasonable travel and associated out-of-pocket expenses\n        incurred by Fair Isaac in connection with the Agreement, which Client agrees to reimburse at Fair Isaac's actual\n        cost.\n        7.3.\tPrice Adjustments. All fees and charges in the Purchasing Documentation may be reviewed and adjusted\n        by Fair Isaac on an annual basis. Annual adjustments will not exceed the most recently available annual rate\n        increase of CPI, provided that the number of users, volume levels, account criteria and other pricing or licensing\n        metrics have not changed under such Purchasing Documentation (in which case, the increase may be higher than\n        CPI). \"CPI\" means (i) with respect to US Dollars, the Consumer Price Index for All Urban Consumers (CPI-U) for the\n        U.S. City Average for All Items, 1982-84=100, as published by the US Bureau of Labor Statistics, and (ii) with\n        respect to any other currency stated in the Purchasing Documentation, a published consumer price index selected\n        by Fair Isaac for such currency.\n        7.4.\tTaxes and other Charges. Unless otherwise stated in the Purchasing Documentation, all charges under the\n        Agreement are stated exclusive of any applicable Taxes, and Client is solely responsible for, and shall pay or\n        reimburse Fair Isaac for, all Taxes. Fair Isaac shall promptly remit to the appropriate tax authority all Taxes\n        collected from Client on account of Client's tax obligations, if any. If Fair Isaac receives a refund of Taxes\n        attributable to amounts paid by Client under the Agreement, Fair Isaac shall pay the refunded amount to Client\n        within 30 days of its receipt.\n        7.5.\tVerification and Audit Rights. Client shall maintain adequate books, records, and accounting practices and\n        systems that will allow proper calculation, documentation and reporting of payments due to Fair Isaac under the\n        Agreement, and that will facilitate auditing of those books, records, systems and Client's use of the Fair Isaac\n        products, services and deliverables. At Fair Isaac's written request, Client shall promptly provide to Fair Isaac a\n        written report certified by an authorized officer of Client that provides information reasonably requested by Fair\n        Isaac to calculate or verify payments due to Fair Isaac under the Agreement, to verify the nature and extent of\n        Client's use of the Fair Isaac products, services and deliverables, or to verify that Client has complied with the\n        terms of the Agreement. In addition, upon at least 10 days' prior written notice to Client, Fair Isaac may, at its\n        expense, audit Client's use of the Fair Isaac products, services and deliverables, and all records of Client relating to\n        the Agreement. Audits must be conducted at Client's facilities during regular business hours, with as little\n        disruption to Client's business activities as reasonably possible. Client shall cooperate with Fair Isaac's auditors in\n        conducting the audit. Fair Isaac may conduct audits no more than twice in any calendar year. Client shall promptly\n        pay to Fair Isaac the amount of any underpayment discovered in such audit. If Client is discovered to have\n        understated any fees owed to Fair Isaac by more than 5%, or if Fair Isaac learns that Client has breached the\n        Agreement, then Client shall also promptly pay to Fair Isaac all reasonable costs of the audit.\n        8.\tTerm and Termination\n        8.1.\tTerm of SWLA. Unless otherwise terminated as specified in this Article, the term of this SWLA shall\n        continue for as long as there is a License Term, Evaluation Period, Community License Period and End User License\n        Period, in effect, unless Fair Isaac sends written notification that it elects to terminate this SWLA.\n        8.2.\tTermination of a Purchasing Documentation. Fair Isaac may terminate the Agreement or any Purchasing\n        Documentation by providing written notice to Client if: (i) Client or any user has committed a material breach of\n        the Agreement or any Purchasing Documentation and has failed to remedy the breach within 30 days after receipt\n        of the written notice requiring it to be remedied, or (ii) Client ceases to conduct business in the ordinary course or\n        is declared insolvent or bankrupt, or makes an assignment of substantially all of its assets for the benefit of\n        creditors, or has a receiver appointed over all or substantially all of its assets, or any proceeding is demanded by,\n        for, or against the other party under any provision of bankruptcy or insolvency legislation. In addition, Fair Isaac\n        may immediately suspend its performance under or terminate the Agreement or any Purchasing Documentation\n        if Client or any user: (i) violates the terms of any license grant or restriction, or (ii) violates any import, export or\n        re-export laws or regulations, or becomes a Restricted Party or located in a Restricted Jurisdiction.\n        8.3.\tTermination of Agreement. Notwithstanding anything to the contrary in the Agreement, if Client is in\n        breach of any provision of the Agreement involving a failure of payment or violation of Fair Isaac's Intellectual\n        Property Rights (including breach of any license grant or restriction by Client or any user), and fails to remedy the\n        breach within 30 days after receipt of written notice, then Fair Isaac may at its option terminate (i) the Purchasing\n        Documentation subject to the breach or (ii) the Agreement.\n        8.4.\tEffect of Termination or Expiration. Upon termination or expiration of any Purchasing Documentation for\n        any reason: (i) all licenses granted to Client under that Purchasing Documentation and the Agreement will\n        terminate immediately, as well as all Fair Isaac services obligations, including support and maintenance\n        obligations; (ii) Client shall and shall cause all users to immediately cease using all affected Fair Isaac Products,\n        services, deliverables and related documentation; (iii) Client shall and shall cause all users to remove all copies of\n        the affected Fair Isaac Products, deliverables and related documentation from Client's and users' computers and\n        systems; (iv) Client shall either (a) irretrievably destroy all copies of the affected Fair Isaac Products, deliverables,\n        related documentation, and other related Fair Isaac Confidential Information and Intellectual Property, or (b) at\n        Fair Isaac's option, return to Fair Isaac all copies of the affected Fair Isaac Products, deliverables, related\n        documentation, and other Fair Isaac Confidential Information and Intellectual Property; (v) Client shall provide to\n        Fair Isaac a written certification signed by an authorized officer of Client certifying that Client has complied in full\n        with the foregoing; and (vi) all fees and other charges provided for in the Agreement or in any Purchasing\n        Documentation will become immediately due and payable.\n        8.5.\tSurvival. The following provisions of this SWLA will survive the term of this SWLA: Article 1 (Definitions),\n        Section 2.2. (Reservation of Rights), Article 3 (Protection of Confidential Information), Section 4.3 (Warranty\n        Disclaimer), Article 5 (Indemnification), Article 6 (Limitation of Liability), Article 7 (Payment Terms), Section 8.4\n        (Effect of Termination or Expiration), Section 8.5 (Survival), and Article 9 (Miscellaneous) except for Section 9.6\n        (Marketing).\n        9.\tMiscellaneous\n        9.1.\tExport Controls; Government Sanctions. Client acknowledges that products and related documentation\n        and technical data provided under the Agreement may be subject to export laws of the U.S. and other countries\n        from where the products were originally obtained by Client. Client shall comply with applicable export laws before\n        exporting or re-exporting such products or related documentation or technical data to other countries. Client will\n        not export, re-export, or otherwise transfer or make available, directly or indirectly, the products or related\n        documentation or technical data to: (i) any country or territory that is, or whose government is, the target of\n        economic or trade sanctions or embargos by the U.S. government (including OFAC, BIS, or the US State\n        Department) or, as applicable, sanctions or embargos by governments of other countries (each, a \"Restricted\n        Jurisdiction\"), or (ii) any person or entity on (or owned or controlled by a person or entity on) the U.S. Treasury\n        Department's List of Specially Designated Nationals, the U.S. Department of Commerce Denied Person's or Entity\n        List, or other restricted party list maintained by the U.S. government or government of any other country (each,\n        a \"Restricted Party\"). Client represents and warrants that Client is not a Restricted Party and is not located in a\n        Restricted Jurisdiction. Client agrees not to use the products or related documentation or technical data for any\n        purpose prohibited by applicable export laws. Client will promptly notify Fair Isaac if Client becomes aware that it\n        has failed to comply with any of the requirements of this section. If Client fails to comply with the terms of this\n        section, in addition to Fair Isaac's remedies at law and in equity, Fair Isaac may suspend performance of its\n        obligations under the Agreement until Client is in compliance.\n        9.2.\tImport Licenses. Client is responsible for (i) obtaining all licenses, permits, clearances or approvals that\n        may be required to import any products and/or services into the country of designated delivery, and (ii) paying\n        any and all related Taxes. At Fair Isaac's request, Client shall provide Fair Isaac copies of all relevant import\n        documentation relating to products or services provided under the Agreement. Fair Isaac will not be required to\n        deliver any products or provide services to locations, persons and/or entities prohibited by applicable export laws\n        or government sanctions.\n        9.3.\tU.S. Government Users. The Fair Isaac Product was developed entirely at private expense and is\n        commercial computer software provided with RESTRICTED RIGHTS. Use, duplication or disclosure by the U.S.\n        Government or a U.S. Government contractor or subcontractor is subject to the restrictions set forth in the\n        Agreement and as provided in FAR 12.211 and 12.212 (48 CFR Sec. 12.211 and 12.212) or DFARS 227.7202 (48 CFR Sec.\n        227.7202-1, Sec. 227.7202-3) as applicable. Consistent with the above Commercial Computer Software and\n        Commercial Computer Documentation are licensed to U.S. Government end users only as commercial items and\n        only with those rights as are granted to all other end users under the terms and conditions set forth in the\n        Agreement.\n        9.4.\tCommercial Items. The documentation and deliverables provided to the U.S. Government are\n        \"Commercial Items,\" as that term is defined at 48 C.F.R. Sec. 2.101, consisting of \"Commercial Computer Software\"\n        and \"Commercial Computer Software Documentation,\" within the meaning of 48 C.F.R. Sec. 12.212 or 48 C.F.R. Sec.\n        227.7202, as applicable. Consistent with 48 C.F.R. Sec. 12.212 or 48 C.F.R. Sec. 227.7202-1 through 227.7202-4, as\n        applicable, the Commercial Computer Software and Commercial Computer Software Documentation are being\n        licensed to U.S. Government end users (i) only as Commercial Items and (ii) with only those rights as are granted\n        to all other end users pursuant to the terms and conditions herein, as provided in FAR 12.212, and DFARS\n        227.7202-1(a), 227.7202-3(a), 227.7202-4, as applicable.\n        9.5.\tRelationship of the Parties. The relationship between the parties is that of independent contractors. The\n        Agreement is not to be construed as creating any partnership, joint venture, agency or any other form of legal\n        association that would impose liability upon one party for the act or failure to act of the other party.\n        9.6.\tMarketing. Fair Isaac may include and Client consents to the use of Client's name, trademark(s) and\n        logo(s) and a 'quote', in Fair Isaac's marketing and promotional materials and website regarding the availability of\n        any of its products or services to other customers and prospects. Client agrees to collaborate and consents to Fair\n        Isaac producing and distributing, to customers and prospects, a written case study describing how Client's\n        business used and benefitted from the Fair Isaac products or services. Fair Isaac may issue a press release stating\n        factual information regarding the relationship between Fair Isaac and Client at any time after the Effective Date.\n        Fair Isaac shall first submit the press release to Client for Client's approval.\n        9.7.\tNo Waiver. No delay or omission by either party in exercising any right under the Agreement will be\n        construed as a waiver of that right. Even if either party waives a breach or default under the Agreement, that\n        party is not deemed to have waived any later or similar breach or default. No waiver will be effective unless in\n        writing and signed by the party waiving the right.\n        9.8.\tCompliance with Laws. Client is solely responsible for compliance with all laws relating to Client's use of\n        any product, service or deliverable provided by Fair Isaac under the Agreement, including but not limited to laws\n        and regulations relating to privacy, export control, import licensing and anti-corruption practices.\n        9.9.\tGoverning Law. The Agreement, and any issues arising under or in any way relating to the Agreement, will\n        be governed by and construed in accordance with the laws of the State of New York, USA without regard to\n        principles of conflicts of law or international law, including without limitation the 1980 United Nations Convention\n        on Contracts for the International Sale of Goods, as revised, which the parties expressly agree does not apply to\n        the Agreement. No action, regardless of form, arising out of or relating to the Agreement may be brought by\n        Client more than 2 years after the cause of action has accrued.\n        9.10.\tNotices. Any notices required to be given in writing under the Agreement must be sent to the recipient's\n        address for notices set forth below. Written notices must be sent by personal delivery, mail (with return receipt\n        provided), or major overnight delivery carrier (with return receipt provided). Notices will be deemed given on the\n        actual date of delivery, as indicated by a delivery receipt. Either party may change its address for notices at any\n        time by giving written notice to the other party as provided in this section.\n        For notices to be sent to Fair Isaac:\n        Fair Isaac Corporation\n        Attention: Contracts Administration\n        12790 El Camino Real, Suite 300\n        San Diego, CA 92130, USA\n        \n        For notices to be sent to Client:\n        The address set forth in the Purchasing Documentation\n        For a Community License, the address set forth in form completed on https://www.fico.com/en/fico-xpress-\n        community-license (or other FICO successor website)\n        9.11.\tAssignment; Delegation.\n        (a)\tNeither party has the right, without the prior written consent of the other party, to assign or transfer the\n        Agreement, or any part of the Agreement. Except as provided herein, any attempt to assign or transfer all or any\n        part of the Agreement without first obtaining that written consent will be void and of no force or effect. In the\n        event of a change of control of Client, or if Client is merged with, is acquired by, or acquires another entity, or\n        undergoes a reorganization or otherwise acquires the right to process the business of another entity, each such\n        event will be deemed an assignment by Client subject to this section.\n        (b)\tNotwithstanding the foregoing, Fair Isaac has the right to assign the Agreement to any Fair Isaac Affiliate\n        or by merger, reorganization, change of control, consolidation, or sale of all or substantially all the assets of Fair\n        Isaac or the applicable division or line of business, and Fair Isaac has the right to (i) delegate the performance of\n        the Agreement, in whole or in part, to Fair Isaac Affiliates in any jurisdiction worldwide; and (ii) disclose to those\n        Fair Isaac Affiliates any data or other information received from, on behalf of, or through Client that Fair Isaac\n        deems appropriate for the performance of the delegated activities, including but not limited to data and other\n        information (including personally identifiable information) about Client's customers; but Fair Isaac must require\n        the Fair Isaac Affiliate to adhere to all obligations imposed by the Agreement upon Fair Isaac with respect to that\n        data and other information.\n        9.12.\tForce Majeure; Cooperation. Notwithstanding anything to the contrary in the Agreement, except for\n        Client's obligations to pay amounts due under the Agreement, neither party will be deemed to be in default of\n        any provision of the Agreement for any delay, error, failure, or interruption of performance due to any act of God,\n        terrorism, war, insurrection, riot, boycott, strike, or other labor or civil disturbance, interruption of power service,\n        interruption of communications services, problems with the Internet, epidemic, pandemic, act of any other\n        person not under the control or direction of either party, or other similar cause; provided, however that the party\n        subject to any of the foregoing force majeure events shall give the other party written notification of a resulting\n        material or indefinite delay and will use reasonable efforts to perform its obligations under the Agreement as\n        soon as practicable. In addition, Client acknowledges that Fair Isaac's performance under the Agreement is\n        dependent on Client's Cooperation.\n        9.13.\tClient Data. Client is and shall remain the sole and exclusive owner of all worldwide right, title and interest\n        in and to the Client Data. Fair Isaac will maintain and implement security procedures and controls with respect to\n        Client Data in accordance with the applicable Purchasing Documentation and will provide reasonably appropriate\n        technical and organizational safeguards against accidental or unlawful destruction, loss, alteration or\n        unauthorized disclosure of or access to Client Data. Client hereby grants to Fair Isaac a worldwide right and license\n        to use, reproduce, distribute, transmit and make derivatives of the Client Data as necessary for Fair Isaac to\n        perform its obligations under the Agreement, and for research, product development and similar purposes. Client\n        represents and warrants to Fair Isaac that Client: (i) has sufficient rights in all Client Data as necessary to and\n        deliver it to Fair Isaac and permit its use as contemplated in the Agreement; (ii) has obtained from all individuals,\n        persons and third parties any required consents and authorizations, and has provided all required notices with\n        respect to the collection, retention, disclosure and use of the Client Data as contemplated for the purposes of the\n        Agreement that are required under applicable foreign, federal and state laws and regulations, including but not\n        limited to privacy rules and policies; and (iii) will only provide Client Data to Fair Isaac that (a) does not infringe or\n        violate any Intellectual Property Rights, publicity, privacy, confidentiality, contractual or other rights, or any\n        foreign, federal, state or local law or regulation, and (b) is not defamatory, offensive, misleading, false, harmful to\n        minors, or obscene.\n        9.14.\tGovernment.\n        (a)\tCorrupt Practices. Client shall comply with the U.S. Foreign Corrupt Practices Act (\"FCPA\") and applicable\n        anti-bribery and corruption laws of other counties. Client represents that, in connection with the Agreement,\n        neither it nor anyone acting on its behalf has made or agreed to make any payment, gift, or other consideration,\n        directly or indirectly, to or for the benefit of anyone: (i) who is a director, officer, employee, shareholder, or agent\n        of Client or (ii) who is in any manner connected with, any government or governmental entity or (iii) who is an\n        officer, agent, or employee of a political party or (iv) who is a candidate for political office; where such payment,\n        gift, or other consideration would be illegal under the applicable laws of the United States or any other country.\n        The foregoing is a continuing representation, and, in addition to any other remedies Fair Isaac has, any failure of\n        this representation to be true at any time is grounds for immediate termination of the Agreement by Fair Isaac.\n        (b)\tWaiver of Sovereign Immunity. If Client is a sovereign state or a state agency, or otherwise capable of\n        invoking a defense of sovereign immunity with regard to any dispute under the Agreement, then Client hereby\n        irrevocably waives any claim to immunity with regard to any proceedings in connection with an arbitration or\n        arbitral award pursuant to the Agreement, including, without limitation, immunity from service of process,\n        immunity from pre-judgment or post-judgment attachment or similar remedy, immunity from the jurisdiction of\n        any court, and immunity from execution of any of its property.\n        9.15.\tThird Party Products. This section only applies to those Third Party Products identified as third party\n        products in the Purchasing Documentation. These Third Party Products are the property of their respective third\n        party suppliers and licensors, and such third parties reserve all rights to their respective Third Party Products,\n        including all Intellectual Property Rights therein. Unless different flow down terms have been made available to\n        Client, the license restrictions and other terms of the Agreement protective of the Fair Isaac Product that was\n        provided with such Third Party Product shall also apply to the Third Party Product. Any license to the Third Party\n        Product shall automatically terminate upon the earlier to occur of: (i) termination or expiration of the license\n        grant to the Third Party Product and/or related Fair Isaac Product; (ii) unavailability of the Third Party Product by\n        or termination of Fair Isaac's relationship with the supplier or licensor of such Third Party Product; or (iii) Client's\n        failure to pay fees or comply with any license term, condition or restriction related to the Third Party Product.\n        Client shall not make or attempt any direct access or independent use of the Third Party Product apart from the\n        related Fair Isaac Product. Fair Isaac is not responsible for the products, services or content of these Third Party\n        Products or for the acts or omissions of their suppliers or licensors. Fair Isaac reserves the right to replace any of\n        these Third Party Products with a comparable alternative.\n        9.16.\tConstruction; Severability. The Agreement is not to be more strongly construed against either party,\n        regardless of who is more responsible for its preparation, and nothing in the Agreement is to be deemed to create\n        any right or benefit in any person not a party to the Agreement. Client shall cause authorized and permitted\n        Affiliates to comply with all terms and conditions of the Agreement. If any provision of the Agreement is held to\n        be unenforceable, unlawful, or invalid in any respect, then that provision will be deemed ineffective only to the\n        extent of the illegality or invalidity, without invalidating the remainder of that provision or any of the remaining\n        provisions of the Agreement. The Article and Section headings in the Agreement are for reference only, and do\n        not form part of the Agreement.\n        9.17.\tEntire Agreement; Order of Precedence. The Agreement represents the complete agreement of the\n        parties with respect to its subject matter and supersedes, with respect to such subject matter, all prior or\n        contemporaneous agreements, proposals, understandings, representations, conditions, and communications (oral\n        or written), as well as the terms of all existing and future purchase orders and acknowledgments. The terms of a\n        Policy are subject to change by Fair Isaac in accordance with its terms regarding changes as set forth therein. Any\n        other terms, conditions, supplements, modifications or amendments to the Agreement will not be binding upon\n        either party unless expressly set forth in a writing signed by authorized representatives of Client and Fair Isaac. In\n        the case of any conflict between the provisions of this SWLA and a Purchasing Documentation, with respect to the\n        subject matter of the given Purchasing Documentation, the provisions of the Purchasing Documentation will\n        control.\n        9.18.\tLanguage of the Contract and Notices. The Agreement shall be governed by the English language. Any\n        version of this Agreement in any other language is solely for the convenience of the parties and will have no\n        binding force or effect. Any notices given pursuant to this Agreement must be in English. In case of a dispute\n        concerning the intent, obligations, or performance of the parties under this Agreement, this English language text\n        alone must be used to resolve the dispute, and any proceedings or communications relating to such dispute must\n        be in English.\n        \n        FICO(R) Xpress Optimization Suite\n        Shrinkwrap License Agreement FICO(R) Xpress Optimization Suite (On-Premises)\n        Version August 15, 2025\n        (c) 1983-2026 Fair Isaac Corporation. All rights reserved. Confidential and proprietary.\n        \n        \n        FAIR ISAAC CONFIDENTIAL\n        REV Form 081525\n        1\n        ",
  "license_expression": null,
  "home_page": "https://www.fico.com/en/products/fico-xpress-optimization",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://www.fico.com/en/products/fico-xpress-optimization",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1771941559,
  "project_urls": {
    "Documentation": "https://www.fico.com/fico-xpress-optimization/docs/latest/insight-python-doc/xi-introduction.html",
    "Homepage": "https://www.fico.com/en/products/fico-xpress-optimization"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}