{
  "name": "rsyncdirector",
  "version": "0.1.0",
  "summary": "A tool to orchestrate rsyncing of data between multiple machines and instances of rsyncdirector",
  "license": "This software is released under the Revised BSD License.\n        \n        Copyright (c) 2019, Ryan Chapin, https//:www.ryanchapin.com\n        All rights reserved.\n        \n        Redistribution  and  use  in  source  and binary forms, with or\n        without modification, are permitted provided that the following\n        conditions are met:\n        \n        *   Redistributions  of  source  code  must  retain  the  above\n        copyright  notice,  this  list  of conditions and the following\n        disclaimer.\n        \n        *  Redistributions  in  binary  form  must  reproduce the above\n        copyright  notice,  this  list  of conditions and the following\n        disclaimer in the documentation and or other materials provided\n        with the distribution.\n        \n        *  Neither  the  name  of  Ryan  Chapin  nor  the  names of its\n        contributors may be used to endorse or promote products derived\n        from this software without specific prior written permission.\n        \n        THIS   SOFTWARE  IS  PROVIDED  BY  THE  COPYRIGHT  HOLDERS  AND\n        CONTRIBUTORS  \"AS  IS\"  AND  ANY EXPRESS OR IMPLIED WARRANTIES,\n        INCLUDING,  BUT  NOT  LIMITED  TO,  THE  IMPLIED  WARRANTIES OF\n        MERCHANTABILITY  AND  FITNESS  FOR  A  PARTICULAR  PURPOSE  ARE\n        DISCLAIMED.   IN   NO  EVENT  SHALL  RYAN  CHAPIN,  ANY  HEIRS,\n        SUCCESSORS,  EXECUTORS AND OR ASSIGNS BE LIABLE FOR ANY DIRECT,\n        INDIRECT,  INCIDENTAL,  SPECIAL,  EXEMPLARY,  OR  CONSEQUENTIAL\n        DAMAGES   (INCLUDING,   BUT  NOT  LIMITED  TO,  PROCUREMENT  OF\n        SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\n        BUSINESS  INTERRUPTION)  HOWEVER  CAUSED  AND  ON ANY THEORY OF\n        LIABILITY,  WHETHER  IN  CONTRACT,  STRICT  LIABILITY,  OR TORT\n        (INCLUDING  NEGLIGENCE  OR OTHERWISE) ARISING IN ANY WAY OUT OF\n        THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n        SUCH DAMAGE.\n        ",
  "license_expression": null,
  "home_page": "https://github.com/rchapin/rsyncdirector",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/rchapin/rsyncdirector",
  "repository_source": "project_urls.homepage",
  "pub_date": 1768834563,
  "project_urls": {
    "Homepage": "https://github.com/rchapin/rsyncdirector",
    "readme": "https://github.com/rchapin/rsyncdirector/README.md"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false
}