{
  "name": "crystal-toolkit",
  "version": "2026.1.22.post0",
  "summary": "Crystal Toolkit is a web app framework from the Materials Project allowing Python",
  "license": "Crystal Toolkit Copyright (c) 2017, The Regents of the University of\n        California, through Lawrence Berkeley National Laboratory (subject\n        to receipt of any required approvals from the U.S. Dept. of Energy).\n        All rights reserved.\n        \n        Redistribution and use in source and binary forms, with or without\n        modification, are permitted provided that the following conditions\n        are met:\n        \n        (1) Redistributions of source code must retain the above copyright\n        notice, this list of conditions and the following disclaimer.\n        \n        (2) Redistributions in binary form must reproduce the above\n        copyright notice, this list of conditions and the following\n        disclaimer in the documentation and/or other materials provided with\n        the distribution.\n        \n        (3) Neither the name of the University of California, Lawrence\n        Berkeley National Laboratory, U.S. Dept. of Energy nor the names of\n        its contributors may be used to endorse or promote products derived\n        from this software without specific prior written permission.\n        \n        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n        \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n        LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS\n        FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\n        COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\n        INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,\n        BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\n        LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\n        CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n        LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN\n        ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\n        POSSIBILITY OF SUCH DAMAGE.\n        \n        You are under no obligation whatsoever to provide any bug fixes,\n        patches, or upgrades to the features, functionality or performance\n        of the source code (\"Enhancements\") to anyone; however, if you\n        choose to make your Enhancements available either publicly, or\n        directly to Lawrence Berkeley National Laboratory or its\n        contributors, without imposing a separate written license agreement\n        for such Enhancements, then you hereby grant the following license:\n        a  non-exclusive, royalty-free perpetual license to install, use,\n        modify, prepare derivative works, incorporate into other computer\n        software, distribute, and sublicense such enhancements or derivative\n        works thereof, in binary and source code form.\n        ",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": null,
  "repository": null,
  "repository_source": null,
  "download": null,
  "download_source": null,
  "pub_date": 1769190989,
  "project_urls": {
    "docs": "https://docs.crystaltoolkit.org",
    "repo": "https://github.com/materialsproject/crystaltoolkit"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}