{
  "name": "CellProfiler-nightly",
  "version": "5.0.0.dev343",
  "summary": "CellProfiler is a free open-source software designed to enable biologists without training in computer vision or programming to quantitatively measure phenotypes from thousands of images automatically.",
  "license": "The BSD 3-Clause License\n        \n        Copyright © 2003 - 2021 Broad Institute, Inc. All rights reserved.\n        \n        Redistribution and use in source and binary forms, with or without\n        modification, are permitted provided that the following conditions are met:\n        \n            1.  Redistributions of source code must retain the above copyright notice,\n                this list of conditions and the following disclaimer.\n        \n            2.  Redistributions in binary form must reproduce the above copyright\n                notice, this list of conditions and the following disclaimer in the\n                documentation and/or other materials provided with the distribution.\n        \n            3.  Neither the name of the Broad Institute, Inc. nor the names of its\n                contributors may be used to endorse or promote products derived from\n                this software without specific prior written permission.\n        \n        THIS SOFTWARE IS PROVIDED “AS IS.”  BROAD MAKES NO EXPRESS OR IMPLIED\n        REPRESENTATIONS OR WARRANTIES OF ANY KIND REGARDING THE SOFTWARE AND\n        COPYRIGHT, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY,\n        FITNESS FOR A PARTICULAR PURPOSE, CONFORMITY WITH ANY DOCUMENTATION,\n        NON-INFRINGEMENT, OR THE ABSENCE OF LATENT OR OTHER DEFECTS, WHETHER OR NOT\n        DISCOVERABLE. IN NO EVENT SHALL BROAD, THE COPYRIGHT HOLDERS, OR CONTRIBUTORS\n        BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n        CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO PROCUREMENT OF SUBSTITUTE\n        GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n        HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n        LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT\n        OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF, HAVE REASON TO KNOW, OR IN\n        FACT SHALL KNOW OF THE POSSIBILITY OF SUCH DAMAGE.\n        \n        If, by operation of law or otherwise, any of the aforementioned warranty\n        disclaimers are determined inapplicable, your sole remedy, regardless of the\n        form of action, including, but not limited to, negligence and strict\n        liability, shall be replacement of the software with an updated version if one\n        exists.\n        \n        Development of CellProfiler has been funded in whole or in part with federal\n        funds from the National Institutes of Health, the National Science Foundation,\n        and the Human Frontier Science Program.\n        ",
  "license_expression": null,
  "home_page": "https://cellprofiler.org/",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "Anne Carpenter, Thouis (Ray) Jones, Lee Kamentsky, Vebjorn Ljosa, David Logan, Mark Bray, Madison Swain-Bowden, Allen Goodman, Claire McQuinn, Alice Lucas, Callum Tromans-Coia",
  "repository": "https://github.com/CellProfiler/CellProfiler",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1770390280,
  "project_urls": {
    "Documentation": "https://cellprofiler.org/manuals",
    "Homepage": "https://cellprofiler.org/",
    "Issues": "https://github.com/CellProfiler/CellProfiler/issues",
    "Repository": "https://github.com/CellProfiler/CellProfiler",
    "Wiki": "https://github.com/CellProfiler/CellProfiler/wiki",
    "Changelog": "https://github.com/CellProfiler/CellProfiler/releases"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": false,
  "has_setup_py": false,
  "has_setup_cfg": false
}