{
  "name": "Qarvexium",
  "version": "0.2.2",
  "summary": "Qarvexium Python Module One Step Ahead",
  "license": "\"\"\"\r\n        # Qarvexium SOFTWARE LICENSE AGREEMENT (2026)\r\n        \r\n        ---\r\n        \r\n        ## TABLE OF CONTENTS\r\n        \r\n        1. Definitions  \r\n        2. Grant of License  \r\n        3. Permitted Uses  \r\n        4. Prohibitions  \r\n        5. Third-Party Dependencies  \r\n        6. Attribution & Trademark  \r\n        7. Warranty, Title & Risk  \r\n        8. Limitation of Liability  \r\n        9. Indemnification  \r\n        10. Termination & Conditional Protection Revocation  \r\n        11. Chain-Protection, Propagation & Enforcement  \r\n        12. Audits & Compliance Certification  \r\n        13. Data Privacy & Security Obligations  \r\n        14. Export Controls & Legal Compliance  \r\n        15. High-Risk Use & Safety-Critical Systems  \r\n        16. Severability & Reformation  \r\n        17. Governing Law & Dispute Resolution  \r\n        18. Notices  \r\n        19. Signature\r\n        \r\n        ---\r\n        \r\n        ## 1. DEFINITIONS\r\n        \r\n        1.1 **“Software”**  \r\n        All components provided by Qarvexium, including binary and source code, libraries, scripts, configuration files, build artifacts, examples, documentation, installers, containers, APIs, and related materials.\r\n        \r\n        1.2 **“Licensee” / “You”**  \r\n        The individual or legal entity granted rights under this Agreement.\r\n        \r\n        1.3 **“Private Use”**  \r\n        Use strictly within Licensee’s organization by employees or contractors authorized under confidentiality obligations, on devices and infrastructure controlled by Licensee. Private Use excludes any third-party distribution, remote public access, or exposure to external users.\r\n        \r\n        1.4 **“Public Use”**  \r\n        Any use that exposes the Software to third parties — including distribution, embedding into public products or services, cloud hosting, container images, API endpoints, repositories, or any publicly accessible system.\r\n        \r\n        1.5 **“Modification”**  \r\n        Any alteration, adaptation, translation, patching, compilation, obfuscation, reverse-engineering, decompilation, disassembly, or other change to the Software, and any creation of Derivative Works by any means (including manual, automated, or AI-assisted methods).\r\n        \r\n        1.6 **“Derivative Work” / “Derivative Program”**  \r\n        Any work that incorporates or is based upon the Software in whole or in part, including subsequent programs, libraries, modules, services, or outputs that depend upon, are generated from, or are built using the Software or any Derivative Program at any depth of derivation.\r\n        \r\n        1.7 **“Immediate Creator” / “Immediate User”**  \r\n        The natural person or legal entity that directly produced, deployed, or distributed a Program or Derivative Program.\r\n        \r\n        1.8 **“Malicious Use”**  \r\n        Any use that is intended to or reasonably expected to: (a) damage, disrupt, or compromise systems, networks, data, services, or devices; (b) create malware, ransomware, spyware, exploits, botnets, or similar harmful software; (c) facilitate unauthorized access to systems or data; (d) facilitate fraud, phishing, harassment, or invasion of privacy; or (e) otherwise violate applicable law or accepted security practices.\r\n        \r\n        1.9 **“Protected Chain”**  \r\n        The hierarchical tree of Derivative Programs originating from Qarvexium Software where each layer propagates protective and restrictive obligations downstream and receives conditional liability protection upstream.\r\n        \r\n        ---\r\n        \r\n        ## 2. GRANT OF LICENSE\r\n        \r\n        2.1 **License Grant.** Subject to full compliance with this Agreement, Qarvexium grants Licensee a non-exclusive, worldwide, royalty-free, revocable license to:  \r\n          a. Install, execute, and use the Software on Licensee-controlled devices;  \r\n          b. Embed unmodified Software into Licensee Programs provided the full license text (this Agreement) is attached and propagated as required by Section 11;  \r\n          c. Distribute the Software in object (binary) form only, with required attribution and license propagation;  \r\n          d. Create Derivative Programs only in accordance with this Agreement and only if the Derivative Program enforces the obligations in Sections 3–6 and 11.\r\n        \r\n        2.2 **Reserved Rights.** All rights not expressly granted are reserved by Qarvexium.\r\n        \r\n        2.3 **Revocability.** The license is revocable by Qarvexium under the terms of Sections 10 and 11.\r\n        \r\n        ---\r\n        \r\n        ## 3. PERMITTED USES\r\n        \r\n        3.1 **Personal & Internal Use.** Use for personal, educational, research, development, testing, and internal business purposes is permitted so long as Licensee enforces the obligations and propagation requirements set forth in Section 11.\r\n        \r\n        3.2 **Commercial & Public Use.** Public or commercial deployment is permitted only when Licensee: (a) includes required attribution (Section 6); (b) attaches the full license to distributed artifacts; (c) enforces Malicious Use prohibitions on all downstream users; and (d) complies with Third-Party Dependencies (Section 5) and Export Controls (Section 14).\r\n        \r\n        3.3 **Cloud / Container / SaaS / AI Use.** Use in cloud, containerized, hosted, or AI-assisted environments is permitted under the same obligations. Licensee is responsible for access control, security, attribution, and license propagation for hosted endpoints and images.\r\n        \r\n        ---\r\n        \r\n        ## 4. PROHIBITIONS\r\n        \r\n        4.1 **No Unauthorized Modification.** Licensee shall not modify, adapt, or create Derivative Works of the Software except as expressly permitted in writing by Qarvexium or as expressly allowed by law (and only for interoperability if legally required). Any permitted Modification must still comply with propagation and anti-malware rules.\r\n        \r\n        4.2 **Reverse Engineering.** Licensee shall not reverse engineer, decompile, or disassemble the Software for the purpose of circumventing licensing, security, attribution, or protection mechanisms. Where mandatory law permits limited reverse engineering solely for the purpose of achieving interoperability, such activity is permitted only to the minimum extent required by law and shall not be used to evade or weaken any obligation under this Agreement.\r\n        \r\n        4.3 **No Malicious Use.** Use of the Software to create, test, distribute, or facilitate malware, ransomware, exploits, automated attacks, or other Malicious Use is strictly prohibited. **Any Program or Derivative Program that is used to create or distribute malicious software immediately loses all protections under this Agreement (see Section 10).**\r\n        \r\n        4.4 **No Unauthorized Redistribution.** Licensee may not sell, lease, sublicense, or otherwise distribute the Software as a standalone product except under terms that fully propagate this Agreement and achieve chain protection as defined in Section 11.\r\n        \r\n        4.5 **No Circumvention.** Hiding, obfuscating, or otherwise attempting to evade any obligation of this Agreement (including attribution, propagation, auditing, or conditional protection) is prohibited.\r\n        \r\n        4.6 **No Use to Violate Law.** The Software shall not be used to commit unlawful acts or to assist others in doing so.\r\n        \r\n        ---\r\n        \r\n        ## 5. THIRD-PARTY DEPENDENCIES\r\n        \r\n        5.1 **Acknowledgement & Compliance.** The Software may include or rely upon third-party components subject to separate licenses. Licensee must comply with those terms. Noncompliance constitutes a material breach of this Agreement.\r\n        \r\n        5.2 **Notice Requirement.** When distributing Derivative Programs, Licensee must include or reference all applicable third-party license notices and attributions required by those components.\r\n        \r\n        ---\r\n        \r\n        ## 6. ATTRIBUTION & TRADEMARK\r\n        \r\n        6.1 **Attribution Required.** For any Public Use or distribution, Licensee must include the following attribution in a prominent place (e.g., UI footer, About page, product documentation, or README):  \r\n        > “This product uses software developed by Qarvexium © 2026.”\r\n        \r\n        6.2 **Trademark Use.** Use of the Qarvexium® name or logo is permitted only to accurately identify origin and must not imply endorsement. Any use suggesting endorsement requires prior written permission and compliance with Qarvexium’s trademark guidelines.\r\n        \r\n        6.3 **Propagation of Attribution.** Attribution must propagate with any distributed Derivative Program and be included in any End-User License Agreement (EULA) or terms presented to downstream users.\r\n        \r\n        ---\r\n        \r\n        ## 7. WARRANTY, TITLE & RISK\r\n        \r\n        7.1 **As-Is.** The Software is provided “as is,” “as available,” without warranties of any kind, express or implied, including merchantability, fitness for a particular purpose, or non-infringement.\r\n        \r\n        7.2 **Title.** Qarvexium represents that it has the rights necessary to license the Software.\r\n        \r\n        7.3 **User Responsibility.** Licensee is solely responsible for determining suitability of the Software for Licensee’s purposes and for compliance with applicable law.\r\n        \r\n        7.4 **Data Protection.** If the Software processes personal data, Licensee is responsible for compliance with applicable data protection laws (e.g., GDPR, CCPA) and for obtaining any necessary consents or legal bases.\r\n        \r\n        7.5 **No Monitoring.** Qarvexium does not undertake proactive monitoring of Licensee’s use. Malicious acts or misuse are the sole responsibility of the Immediate Creator(s) as provided in Sections 9–11.\r\n        \r\n        ---\r\n        \r\n        ## 8. LIMITATION OF LIABILITY\r\n        \r\n        8.1 **Limitation of Liability.** To the maximum extent permitted by applicable law, Qarvexium shall have no liability under this Agreement. Where applicable law does not permit the complete exclusion of liability, Qarvexium’s liability shall be limited to the minimum amount mandatorily required by such law.\r\n        \r\n        8.2 **Excluded Damages.** In no event shall Qarvexium be liable for indirect, incidental, special, consequential, punitive, or exemplary damages, including lost profits, loss of business, or loss of data.\r\n        \r\n        8.3 **Third-Party & Downstream Harm.** Qarvexium is not liable for any harm caused by Derivative Programs or by actions of downstream users.\r\n        \r\n        ---\r\n        \r\n        ## 9. INDEMNIFICATION\r\n        \r\n        9.1 **By Licensee.** Licensee shall indemnify, defend and hold Qarvexium and its officers, directors, employees and agents harmless from and against all claims, liabilities, damages, losses and expenses (including reasonable attorneys’ fees) arising from:  \r\n          a. Licensee’s use, distribution, or deployment of the Software or any Derivative Program;  \r\n          b. Any breach by Licensee of this Agreement (including failure to propagate and enforce Sections 3–6 and 11);  \r\n          c. Any Malicious Use by Licensee or by any downstream user of Licensee’s Derivative Program.\r\n        \r\n        9.2 **Chain Indemnity.** Each Immediate Creator of a Derivative Program agrees to indemnify upstream authors and Qarvexium for claims arising from actions of their downstream users where the downstream actions arise from the Immediate Creator’s violation or failure to enforce the license obligations.\r\n        \r\n        ---\r\n        \r\n        ## 10. TERMINATION & CONDITIONAL PROTECTION REVOCATION\r\n        \r\n        10.1 **Termination Upon Breach.**\r\n          This Agreement, and all rights granted herein, shall terminate immediately\r\n          and without the need for notice upon any material breach by Licensee.\r\n          Termination is effective by operation of this Agreement at the moment of\r\n          breach, regardless of whether Qarvexium has actual knowledge of the breach\r\n          at that time.\r\n        \r\n        10.2 **Irrevocable Revocation for Malicious Use.** \r\n          Any Malicious Use constitutes a fundamental breach. Upon such breach:\r\n        \r\n          a. All rights and licenses granted to the Immediate Creator terminate irrevocably and without cure;\r\n          b. Any protection, limitation of liability, or indemnity granted under this Agreement is permanently revoked for the Immediate Creator;\r\n          c. Qarvexium retains the right, but not the obligation, to provide notice of revocation or to publicly declare the loss of protection.\r\n        \r\n        10.3 **Notice & Cure.** For non-Malicious breaches, Qarvexium may deliver written notice specifying the breach and a reasonable cure period (if feasible). For Malicious Use, no cure period is required and protection revocation is immediate.\r\n        \r\n        10.4 **Obligations on Termination.** Upon termination or revocation of protection, Licensee must:  \r\n          a. Immediately cease all use of the Software and affected Derivative Programs;  \r\n          b. Delete and destroy all copies, distributions, containers, and artifacts containing the Software or Derivative Programs under Licensee’s control;  \r\n          c. Provide written certification of deletion and cessation within seven (7) days of request.\r\n        \r\n        10.5 **Public Notice of Revocation.** Qarvexium may publicly declare that a Program and its derivatives are no longer protected, and Licensee must include a clear visible notice in any affected program UI, documentation, or distribution channels indicating loss of Qarvexium protection.\r\n        \r\n        ---\r\n        \r\n        ## 11. CHAIN-PROTECTION, PROPAGATION & ENFORCEMENT\r\n        \r\n        11.1 **Propagation Requirement.** Every Derivative Program must include the full text of this Agreement (or an unalterable machine-readable reference to it) and must present a terms notice to immediate downstream users that includes: (a) the Malicious Use prohibitions; (b) required attribution; (c) the liability and indemnity provisions; and (d) the conditional protection rules (Section 10).\r\n        \r\n        11.2 **Downstream Enforcement.** Each Immediate Creator must contractually bind their downstream users to the same obligations and propagation requirements. Licensee must implement reasonable technical and administrative controls to enforce restrictions (e.g., EULA acceptance, API keys with terms, package manifest warnings).\r\n        \r\n        11.3 **Protection While Compliant.** Upstream developers (including Qarvexium and any non-violating Immediate Creator) are protected from liability for wrongful acts of downstream users **so long as** they have:  \r\n          a. Complied with propagation obligations;  \r\n          b. Notified downstream users of prohibitions and liability allocations; and  \r\n          c. Taken reasonable steps to respond to known violations (e.g., revocation of keys, takedown requests).\r\n        \r\n        11.4 **Effective Depth & Unlimited Chain.** These propagation and protection rules apply at unlimited depth: any Program distributed within the Protected Chain must continue the propagation obligations to preserve protection for upstream participants.\r\n        \r\n        11.5 **Exception for Authorized Security Research.** If Licensee wishes to perform security research that could produce potentially harmful outputs, Licensee must obtain prior written authorization from Qarvexium and comply with mutually agreed safe-harbor procedures. Unauthorized security research that results in Malicious Use is a Material Breach.\r\n        \r\n        11.6 **Status Disclosure.** Any Program that loses protection per Section 10 must clearly and conspicuously disclose its unprotected status to all downstream users and distribution channels.\r\n        \r\n        ---\r\n        \r\n        ## 12. AUDITS & COMPLIANCE CERTIFICATION\r\n        \r\n        12.1 **Audit Right.**Upon reasonable written notice, Qarvexium may audit Licensee’s compliance with this Agreement no more than once per calendar year, except where Qarvexium has a reasonable basis to suspect Malicious Use or material breach, in which case additional audits may be conducted.\r\n        \r\n        12.2 **Scope & Proportionality.** Audits shall be limited to information, systems, and records reasonably necessary to verify compliance with this Agreement and shall be conducted in a manner that minimizes disruption to Licensee’s operations.\r\n        \r\n        12.3 **Confidentiality.** All non-public information obtained through an audit shall be treated as confidential and used solely for the purpose of compliance verification and enforcement of this Agreement.\r\n        \r\n        12.4 **Certification Alternative.** At Qarvexium’s discretion, Licensee may satisfy audit obligations by providing a written compliance certification signed by an authorized representative, unless Malicious Use is reasonably suspected.\r\n        \r\n        ---\r\n        \r\n        ## 13. DATA PRIVACY & SECURITY OBLIGATIONS\r\n        \r\n        13.1 **No Automatic Data Collection.** Qarvexium does not automatically collect data from Licensee by reason of distribution of the Software.\r\n        \r\n        13.2 **Licensee Responsibilities.** Licensee is responsible for securely handling keys, credentials, and user data. Licensee must implement reasonable administrative, physical, and technical safeguards consistent with industry standards.\r\n        \r\n        13.3 **Breach Notification.** Licensee must notify Qarvexium within seventy-two (72) hours of discovering a security incident or personal data breach affecting the Software or Derivative Programs.\r\n        \r\n        ---\r\n        \r\n        ## 14. EXPORT CONTROLS & LEGAL COMPLIANCE\r\n        \r\n        14.1 **Export Compliance.** Licensee shall comply with all applicable export control and sanctions laws and regulations. Licensee shall not export, re-export or transfer the Software to prohibited persons, entities, or locations.\r\n        \r\n        14.2 **Legal Compliance.** Licensee must comply with all applicable laws and regulations in its use of the Software.\r\n        \r\n        ---\r\n        \r\n        ## 15. SAFETY-CRITICAL SYSTEMS\r\n        \r\n        15.1 **Not Designed For High-Risk Use.** The Software is not designed or certified for safety-critical or similarly high-risk systems. Do not use the Software in these environments.\r\n        ---\r\n        \r\n        ## 16. SEVERABILITY & REFORMATION\r\n        \r\n        16.1 **Severability.** If any provision is held invalid or unenforceable, the remainder of this Agreement remains in effect. The parties shall negotiate in good faith to replace any invalid provision by a valid provision that most closely approximates the economic intent of the invalid provision.\r\n        \r\n        ---\r\n        \r\n        ## 17. GOVERNING LAW & DISPUTE RESOLUTION\r\n        \r\n        17.1 **Governing Law.** This Agreement shall be governed by and construed in accordance with the laws of Switzerland, excluding its conflicts-of-law rules, except where mandatory provisions of another jurisdiction apply.\r\n        \r\n        17.2 **Arbitration.** Except for injunctive relief and urgent equitable remedies, disputes arising out of this Agreement shall be finally resolved by binding arbitration administered by the International Chamber of Commerce (ICC) in English. The seat of arbitration shall be a neutral location agreed by the parties; absent agreement, the seat shall be Geneva, Switzerland.\r\n        \r\n        17.3 **Injunctive Relief.** Qarvexium may seek injunctive or other equitable relief in competent courts of any jurisdiction to restrain breaches (including Malicious Use) and to enforce takedowns or revocation notices.\r\n        \r\n        ---\r\n        \r\n        ## 18. NOTICES\r\n        \r\n        18.1 **Notices.** Any legal notices required under this Agreement shall be in writing and sent to the addresses provided by the parties. Electronic notice (email) is effective if receipt is confirmed or not denied within 48 hours.\r\n        \r\n        ---\r\n        \r\n        ## 19. SIGNATURE\r\n        \r\n        By using, distributing, embedding, or otherwise employing the Software or any Derivative Program, Licensee accepts and agrees to all terms of this Agreement.\r\n        \r\n        ---\r\n        \r\n        Qarvexium All rights reserved ©\r\n        \r\n        ---\r\n        **End Of License**\r\n        ---\r\n        \r\n        **EXAMPLE: PROTECTION FLOW (ASCII GRAPH)**\r\n        \r\n        ```\r\n        Qarvexium\r\n           |\r\n          / \\---------------------\\\r\n          |           |           |\r\n        ProgramA   ProgramB   ProgramC  (if any becomes \"Harmful\", it loses protection)\r\n          |           |         |\r\n          |           |         \\--> ProgramC6 (HARMFUL)  --> ProgramC7, ProgramC8 (also lose protection)\r\n          |           |\r\n        ProgramA1  ProgramB1\r\n        ```\r\n        \r\n        ---\r\n        \r\n        # Qarvexium Developer Checklist\r\n        \r\n        Use this checklist when building or distributing Derivative Programs to ensure you preserve chain protection and comply with Qarvexium license obligations.\r\n        \r\n        1. **Include LICENSE**: Ensure the full `Qarvexium SOFTWARE LICENSE AGREEMENT (2026)` is bundled with any distributed artifact (binary, container image, package).\r\n        2. **Attribution**: Display attribution prominently (UI footer, About page, README) with the required statement.\r\n        3. **EULA/Terms for End Users**: Present an End-User License Agreement or Terms that require acceptance before use; include Malicious Use prohibitions and liability allocations.\r\n        4. **Manifest Flag**: Add a machine-readable flag in package manifests (e.g., `license_attached: true` and `Qarvexium_license_version: \"2026\"`).\r\n        5. **API Keys & Access Controls**: If distributing hosted endpoints or SDKs, require API keys or access tokens tied to acceptance of terms; provide revocation mechanisms.\r\n        6. **Audit Trail**: Keep records of distributions, recipient organizations, and proof of license propagation for audits.\r\n        7. **Security Measures**: Implement reasonable security controls (input validation, rate limiting, access control) to reduce misuse risk.\r\n        8. **Incident Response**: Have a plan to respond to reports of abuse (takedown, revoke keys, notify Qarvexium if required).\r\n        9. **Third-Party Notices**: Bundle or reference any third-party licenses included in your artifact.\r\n        10. **Certification**: On request, be prepared to provide a signed compliance certificate to Qarvexium.\r\n        \r\n        ---\r\n        \r\n        # End-User License Agreement (EULA) — [Your Product Name]\r\n        \r\n        **Effective Date:** [Insert Date]  \r\n        **Product:** [Your Product Name]  \r\n        **Provider:** [Your Company Name]\r\n        \r\n        ## 1. Acceptance\r\n        By installing, copying, or using this product, you agree to be bound by this EULA and by the Qarvexium Software License Agreement (2026). You must read both agreements before use.\r\n        \r\n        ## 2. Prohibited Uses\r\n        You may not use this product to create, distribute, test, or facilitate malware, ransomware, exploits, or any other malicious or illegal software. Such use constitutes a material breach and may result in legal action.\r\n        \r\n        ## 3. Attribution\r\n        This product includes software developed by Qarvexium. The following attribution must be displayed in a prominent location within the product:  \r\n        \"This product uses software developed by Qarvexium © 2026.\"\r\n        \r\n        ## 4. Liability\r\n        You are solely responsible for your actions and any harm caused by software you create or distribute using this product. Upstream developers are not liable for your malicious acts if they have complied with license propagation and enforcement obligations.\r\n        \r\n        ## 5. Termination\r\n        Your rights under this EULA terminate immediately upon breach, including Malicious Use. Upon termination you must cease use and delete all copies of the product.\r\n        \r\n        ## 6. Governing Law\r\n        This EULA is governed by the Qarvexium Software License Agreement and the governing law and dispute resolution provisions therein.\r\n        \r\n        ## 7. Acceptance\r\n        [ ] I accept the EULA and the Qarvexium Software License Agreement (2026).\r\n        \r\n        ---\r\n        \r\n        ## LICENSE SUMMARY — FOR DEVELOPERS (NON-BINDING)\r\n        \r\n        ```text\r\n        QARVEXIUM LICENSE — SUMMARY (NON-BINDING)\r\n        \r\n        This software is licensed under a proprietary license.\r\n        \r\n         You MAY:\r\n        - Use the software for personal, internal, commercial, or hosted purposes\r\n        - Embed the software into your own products\r\n        - Distribute binaries with attribution and license propagation\r\n        \r\n         You MAY NOT:\r\n        - Use the software for malware, exploits, or other malicious purposes\r\n        - Circumvent license, attribution, or protection mechanisms\r\n        - Redistribute the software without propagating this license\r\n        \r\n         IMPORTANT:\r\n        - Malicious use results in immediate and permanent loss of license rights\r\n        - Obligations propagate to derivative and downstream programs\r\n        - Upstream authors are protected only while you remain compliant\r\n        \r\n        This summary is for convenience only.\r\n        The full Qarvexium Software License Agreement (2026) governs.\r\n        \r\n        ---\r\n        \"\"\"",
  "license_expression": null,
  "home_page": "https://pypi.org/project/Qarvexium/",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://pypi.org/project/Qarvexium/",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1770395483,
  "project_urls": {
    "Homepage": "https://pypi.org/project/Qarvexium/"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}