{
  "name": "sia-script",
  "version": "0.6.3",
  "summary": "SIA — Simplified Integrated Architecture including SiaNTT, SIA-ELS (ABAP Interpreter), and HDQS (Hyper-Dimensional Quantum System)",
  "license": "# PROPRIETARY SOFTWARE LICENSE\r\n        # SIA Script Framework\r\n        # Copyright © 2026 Sia Software Innovations Private Limited. All Rights Reserved.\r\n        \r\n        ## IMPORTANT NOTICE\r\n        \r\n        This software and its source code are proprietary property of SIA Software Innovations. \r\n        Unauthorized copying, distribution, modification, public display, or public performance \r\n        of this software is strictly prohibited.\r\n        \r\n        ## TERMS OF USE\r\n        \r\n        1. **RESTRICTED USE**: This software is licensed, not sold. You are granted a limited, \r\n           non-exclusive, non-transferable license to use this software for evaluation purposes only.\r\n        \r\n        2. **COMMERCIAL USE**: Commercial use of this software requires a separate commercial \r\n           license agreement with Sia Software Innovations Private Limited.\r\n        \r\n        3. **DISTRIBUTION**: Redistribution of this software in source or binary form is \r\n           expressly prohibited without written permission.\r\n        \r\n        4. **MODIFICATION**: You may not modify, adapt, translate, reverse engineer, decompile, \r\n           disassemble, or create derivative works based on this software.\r\n        \r\n        5. **INTELLECTUAL PROPERTY**: All intellectual property rights in the software remain \r\n           the exclusive property of Sia Software Innovations Private Limited.\r\n        \r\n        6. **TERMINATION**: This license terminates automatically if you violate any of these terms.\r\n        \r\n        ## COMMERCIAL LICENSING\r\n        \r\n        For commercial licensing, enterprise support, and production deployment, please contact:\r\n        - Email: info@siasoftwareinnovations.com\r\n        - Website: https://www.siasoftwareinnovations.com\r\n        \r\n        ## DISCLAIMER\r\n        \r\n        THIS SOFTWARE IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, \r\n        INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR \r\n        PURPOSE, AND NONINFRINGEMENT. IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE FOR ANY \r\n        CLAIM, DAMAGES, OR OTHER LIABILITY ARISING FROM THE USE OF THIS SOFTWARE.",
  "license_expression": null,
  "home_page": "https://www.siasoftwareinnovations.com",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://www.siasoftwareinnovations.com",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1769770019,
  "project_urls": {
    "Documentation": "https://www.siasoftwareinnovations.com",
    "Homepage": "https://www.siasoftwareinnovations.com"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}