{
  "name": "dmg",
  "version": "1.4.0",
  "summary": "PyTorch Differentiable Modeling Framework",
  "license": "Non-Commercial Software License Agreement\n        \n        By downloading the Generic Differentiable Modeling Framework (dMG) software (the “Software”) you agree to\n        the following terms of use:\n        Copyright (c) 2025, The Pennsylvania State University (“PSU”). All rights reserved.\n        \n        1. PSU hereby grants to you a perpetual, nonexclusive and worldwide right, privilege and\n        license to use, reproduce, modify, display, and create derivative works of Software for all\n        non-commercial purposes only. You may not use Software for commercial purposes without\n        prior written consent from PSU. Queries regarding commercial licensing should be directed\n        to The Office of Technology Management at 814.865.6277 or otminfo@psu.edu.\n        2. Neither the name of the copyright holder nor the names of its contributors may be used\n        to endorse or promote products derived from this software without specific prior written\n        permission.\n        3. This software is provided for non-commercial use only.\n        4. Redistribution and use in source and binary forms, with or without modification, are\n        permitted provided that redistributions must reproduce the above copyright notice, license,\n        list of conditions and the following disclaimer in the documentation and/or other materials\n        provided with the distribution.\n        \n        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\n        AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n        IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n        ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE\n        LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n        CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n        SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n        INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n        CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n        ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\n        POSSIBILITY OF SUCH DAMAGE.",
  "license_expression": null,
  "home_page": "https://mhpi.github.io/codes/frameworks/",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/mhpi/generic_deltamodel",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1770381361,
  "project_urls": {
    "Documentation": "https://github.com/mhpi/generic_deltamodel/tree/master/docs",
    "Changelog": "https://github.com/mhpi/hydrodl2/blob/master/docs/CHANGELOG.md",
    "Repository": "https://github.com/mhpi/generic_deltamodel",
    "Homepage": "https://mhpi.github.io/codes/frameworks/",
    "Issues": "https://github.com/mhpi/generic_deltamodel/issues"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}