{
  "name": "pointr-cloud-common",
  "version": "0.1.33",
  "summary": "Common utilities and DTOs shared across PointrCloud apps",
  "license": "# PROPRIETARY SOFTWARE LICENSE\n        \n        ## V9 API TOOLKIT\n        \n        Copyright (c) 2025 Pointr Limited. All Rights Reserved.\n        \n        ### 1. OWNERSHIP\n        \n        This software and its documentation (\"Software\") is the proprietary and confidential\n        information of Pointr Limited (\"Company\") and is protected by copyright laws and international\n        treaty provisions. The Software contains trade secrets and proprietary information\n        owned by the Company and is made available to you, the licensee, under the terms\n        of this license agreement.\n        \n        ### 2. LICENSE GRANT\n        \n        The Company grants you a non-exclusive, non-transferable license to install and use the Software solely for the purpose of interacting with the Company APIs, provided that you are:\n        \n        (a) an employee, contractor, or agent of Pointr Limited, or\n        \n        (b) a third party who has received express permission or access credentials from the Company.\n        \n        This license does not permit redistribution or modification of the Software unless explicitly authorized in writing by the Company.\n        \n        ### 3. RESTRICTIONS\n        \n        You may not:\n        \n        a) Copy, modify, adapt, translate, or create derivative works based upon the Software.\n        \n        b) Reverse engineer, decompile, disassemble, or otherwise attempt to discover the source code of the Software, except to the extent that such activity is expressly permitted by applicable law notwithstanding this limitation.\n        \n        c) Remove, alter, or obscure any proprietary notices (including copyright notices) on any copies of the Software.\n        \n        d) Use the Software for any purpose other than as expressly authorized in this license.\n        \n        e) Transfer, sublicense, or assign your rights under this license to any other person or entity without the prior written consent of the Company.\n        \n        ### 4. CONFIDENTIALITY\n        \n        You acknowledge that the Software contains valuable trade secrets and confidential\n        information belonging to the Company. You agree to maintain the confidentiality of\n        the Software and to use at least the same degree of care to prevent unauthorized\n        disclosure of the Software as you would use to protect your own confidential information\n        of similar importance, but in no event less than reasonable care.\n        \n        ### 5. TERM AND TERMINATION\n        \n        This license is effective until terminated. The Company may terminate this license\n        at any time if you fail to comply with any term or condition of this license. Upon\n        termination, you must cease all use of the Software and destroy all copies of the\n        Software in your possession or control.\n        \n        ### 6. DISCLAIMER OF WARRANTIES\n        \n        THE SOFTWARE IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR\n        IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,\n        FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT. THE COMPANY DOES NOT WARRANT\n        THAT THE SOFTWARE WILL MEET YOUR REQUIREMENTS OR THAT THE OPERATION OF THE SOFTWARE\n        WILL BE UNINTERRUPTED OR ERROR-FREE.\n        \n        ### 7. LIMITATION OF LIABILITY\n        \n        IN NO EVENT SHALL THE COMPANY BE LIABLE FOR ANY INDIRECT, INCIDENTAL, SPECIAL,\n        PUNITIVE, OR CONSEQUENTIAL DAMAGES, OR DAMAGES FOR LOSS OF PROFITS, REVENUE, DATA,\n        OR DATA USE, INCURRED BY YOU OR ANY THIRD PARTY, WHETHER IN AN ACTION IN CONTRACT\n        OR TORT, EVEN IF THE COMPANY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n        \n        ### 8. EXPORT REGULATIONS\n        \n        The Software may be subject to export or import regulations in other countries.\n        You agree to strictly comply with all such laws and regulations.\n        \n        ### 9. GOVERNING LAW\n        \n        This license shall be governed by and construed in accordance with the laws of\n        England and Wales, without giving effect to any principles of conflicts of law.\n        \n        ### 10. ENTIRE AGREEMENT\n        \n        This license constitutes the entire agreement between you and the Company regarding\n        the use of the Software and supersedes all prior or contemporaneous understandings\n        regarding such subject matter.\n        \n        ### 11. UPDATES AND MAINTENANCE\n        \n        The Company is not obligated to provide updates, enhancements, or maintenance for\n        the Software under this license.\n        \n        ### 12. SURVIVAL\n        \n        Sections 1, 3, 4, 6, 7, 9, and any other provisions that should reasonably survive\n        termination of this license shall survive termination.\n        \n        By using the Software, you acknowledge that you have read this license, understand it,\n        and agree to be bound by its terms and conditions.\n        \n        Pointr\n        \n        Office 406 – Pavilion Club 96 Kensington High Street London, W8 4SG United Kingdom\n        \n        📧 contact@pointr.tech\n        \n        📞 +44 (0)208 720 7087\n        ",
  "license_expression": null,
  "home_page": "https://github.com/pointrlabs/ptr-swdel-internal-util-automation/tree/develop/PointrCloudCommon",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/pointrlabs/ptr-swdel-internal-util-automation/tree/develop/PointrCloudCommon",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1771329639,
  "project_urls": {
    "Bug Tracker": "https://github.com/pointrlabs/ptr-swdel-internal-util-automation/issues",
    "Homepage": "https://github.com/pointrlabs/ptr-swdel-internal-util-automation/tree/develop/PointrCloudCommon"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}