{
  "name": "ibkr-porez",
  "version": "1.1.0",
  "summary": "Automated PPDG-3R tax reports for Interactive Brokers. It automatically pulls your data and generates a ready-to-upload XML file with all prices converted to RSD.",
  "license": "Copyright (c) 2024 Andrey Sorokin <andrey@sorokin.engineer>\n        \n        Permission is hereby granted, free of charge, to any person obtaining a copy of\n        this software and associated documentation files (the “Software”), to deal in\n        the Software without restriction, including without limitation the rights to use,\n        copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the\n        Software, and to permit persons to whom the Software is furnished to do so,\n        subject to the following conditions:\n        \n        The above copyright notice and this permission notice shall be included in all\n        copies or substantial portions of the Software.\n        \n        THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND,\n        EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES\n        OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n        NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT\n        HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\n        WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\n        FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR\n        OTHER DEALINGS IN THE SOFTWARE.",
  "license_expression": null,
  "home_page": "https://andgineer.github.io/ibkr-porez/",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://andgineer.github.io/ibkr-porez/",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1769779150,
  "project_urls": {
    "Documentation": "https://andgineer.github.io/ibkr-porez/",
    "Homepage": "https://andgineer.github.io/ibkr-porez/"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}