{
  "name": "caf.brain",
  "version": "0.1.0",
  "summary": "Common Analytical Framework package of Machine and Deep Learning tools.",
  "license": "Copyright © Transport for the North (“TfN”) (2025).\n        \n        \n        Use of this software and associated documentation files (“the Software”) by you indicates your acceptance of the terms and conditions below (“the Licence”).\n        We make available the Software to you on the basis of this Licence. We do not sell the Software to you. We remain the owners of the Software at all times. \n        \n        We grant you a non-exclusive, worldwide, royalty-free, perpetual licence:\n        (a)\tto use the Software;\n        (b)\tto develop, modify and maintain the Software;\n        (c)\tcopy, publish, distribute and transmit the Software;\n        (d)\tadapt the Software.\n        \n        Where you do any of the above you must acknowledge the source of the Software in your product or application by including or linking the following attribution statement in a prominent and noticeable location in or in the context of your product or application:\n        “Outputs derived from CAF.Brain (the Common Analytical Framework AI Toolkit), developed by Transport for the North [https://github.com/Transport-for-the-North/caf.brain]”\n        \n        Any adaptations applied to the Software before application should be briefly described alongside the above citation. We encourage you to submit to us any adaptations to the Software and where you choose to do so your submissions will be considered for integration into the Software.\n        \n        The above are important conditions of this Licence and if you fail to comply with them the rights granted to you under this Licence will end automatically. \n        This Licence does not grant you any right to use the Software in a way that suggests any official status or that we endorse you or your use of the Software.\n        The Software is licenced 'as is' and we exclude all representations, warranties, obligations and liabilities in relation to the Software to the maximum extent permitted by law.\n        We are not liable for any errors or omissions in the Software and shall not be liable for any loss, injury or damage of any kind caused by its use. We do not guarantee the continued supply of the Software.\n        This Licence is governed by the laws of the jurisdiction in which we have our principal place of business.\n        ",
  "license_expression": null,
  "home_page": "https://github.com/transport-for-the-north/caf.brain",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "Transport for the North",
  "repository": "https://github.com/transport-for-the-north/caf.brain",
  "repository_source": "project_urls.source",
  "download": null,
  "download_source": null,
  "pub_date": 1771584297,
  "project_urls": {
    "Documentation": "https://cafbrain.readthedocs.io/",
    "Bug Tracker": "https://github.com/transport-for-the-north/caf.brain/issues",
    "Homepage": "https://github.com/transport-for-the-north/caf.brain",
    "Source": "https://github.com/transport-for-the-north/caf.brain"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": true,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}