{
  "name": "periodictable",
  "version": "2.1.0",
  "summary": "Extensible periodic table of the elements",
  "license": "Periodictable is in the public domain.\n        \n        Code in individual files has copyright and license set by individual authors.\n        \n        periodictable/cromerman.py\n        --------------------------\n        \n        Copyright (c) 2009 Trustees of the Columbia University\n        in the City of New York.  All rights reserved.\n        \n        DANSE Diffraction group, Simon J. L. Billinge\n        \n        File coded by:    Pavol Juhas\n        \n        Redistribution and use in source and binary forms, with or without\n        modification, are permitted provided that the following conditions\n        are met:\n        \n         * Redistributions of source code must retain the above copyright\n           notice, this list of conditions and the following disclaimer.\n        \n         * Redistributions in binary form must reproduce the above copyright\n           notice, this list of conditions and the following disclaimer in the\n           documentation and/or other materials provided with the distribution.\n        \n         * Neither the name of Columbia University nor the names of its\n           contributors may be used to endorse or promote products derived from\n           this software without specific prior written permission.\n        \n        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n        \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n        LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n        A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT\n        OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n        SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED\n        TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\n        PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\n        LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\n        NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\n        SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n        ",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/python-periodictable/periodictable",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1772237307,
  "project_urls": {
    "documentation": "https://periodictable.readthedocs.io",
    "repository": "https://github.com/python-periodictable/periodictable"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}