{
  "name": "duckdice-betbot",
  "version": "4.11.2",
  "summary": "DuckDice betting bot with 18 strategies, Monte Carlo simulation, and comprehensive CLI",
  "license": "MIT License\n        \n        Copyright (c) 2024 DuckDice CLI Contributors\n        \n        Permission is hereby granted, free of charge, to any person obtaining a copy\n        of this software and associated documentation files (the \"Software\"), to deal\n        in the Software without restriction, including without limitation the rights\n        to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n        copies of the Software, and to permit persons to whom the Software is\n        furnished to do so, subject to the following conditions:\n        \n        The above copyright notice and this permission notice shall be included in all\n        copies or substantial portions of the Software.\n        \n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n        FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n        AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n        LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n        OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n        SOFTWARE.\n        \n        ---\n        \n        DISCLAIMER:\n        \n        This software is provided for educational and convenience purposes only.\n        Online gambling involves risk and may not be legal in your jurisdiction.\n        \n        - Only gamble what you can afford to lose\n        - Gambling should not be used as a way to make money\n        - If you feel you have a gambling problem, seek help immediately\n        - Check your local laws regarding online gambling before using this software\n        - The authors and contributors are not responsible for any financial losses\n        - Use of this software is at your own risk\n        \n        For responsible gambling resources:\n        - National Council on Problem Gambling: https://www.ncpgambling.org/\n        - Gamblers Anonymous: https://www.gamblersanonymous.org/\n        ",
  "license_expression": null,
  "home_page": "https://github.com/sushiomsky/duckdice",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/sushiomsky/duckdice",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1770078614,
  "project_urls": {
    "Repository": "https://github.com/sushiomsky/duckdice",
    "Homepage": "https://github.com/sushiomsky/duckdice"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}