{
  "name": "amen-cli",
  "version": "0.12.0",
  "summary": "A laravel installer inspired Python Web Application Scaffolding Tool",
  "license": "Modified MIT License with Attribution Requirements\n        \n        Copyright (c) 2024 Tanaka Chinengundu\n        \n        Permission is hereby granted, free of charge, to any person obtaining a copy\n        of this software and associated documentation files (the \"Software\"), to deal\n        in the Software without restriction, including without limitation the rights\n        to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n        copies of the Software, subject to the following conditions:\n        \n        1. The above copyright notice, this permission notice, and the following attribution\n           requirements shall be included in all copies or substantial portions of the Software.\n        \n        2. Attribution Requirements:\n           a. All copies or substantial portions of the Software must retain clear and visible\n              attribution to the original author, Tanaka Chinengundu.\n           b. The original author's name (Tanaka Chinengundu) must not be removed, modified,\n              or obscured in any derivative works or modifications of the Software.\n           c. Any modifications or derivative works must clearly indicate that changes have\n              been made from the original Software and must not imply endorsement by the\n              original author.\n        \n        3. Liability and Responsibility:\n           a. The original author shall not be held responsible or liable for any damages, \n              losses, or consequences arising from the use, misuse, or failure of the Software,\n              whether in its original or modified form.\n           b. Users and modifiers of the Software assume all risks associated with its use,\n              including but not limited to data loss, system failure, or other damages.\n           c. Any modifications made to the Software are the sole responsibility of the modifier,\n              and the original author bears no responsibility for derivative works.\n        \n        4. Additional Restrictions:\n           a. The Software may not be used in any way that implies endorsement by the original author.\n           b. The Software may not be used for illegal or malicious purposes.\n           c. Users must notify end users if they are using a modified version of the Software.\n        \n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n        FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n        AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n        LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n        OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n        SOFTWARE.",
  "license_expression": null,
  "home_page": "https://github.com/taqsblaze/amen-cli",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/taqsblaze/amen-cli.git",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1770596315,
  "project_urls": {
    "Bug Tracker": "https://github.com/taqsblaze/amen-cli/issues",
    "Documentation": "https://github.com/taqsblaze/amen-cli#readme",
    "Repository": "https://github.com/taqsblaze/amen-cli.git",
    "Homepage": "https://github.com/taqsblaze/amen-cli"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": false,
  "has_setup_py": false,
  "has_setup_cfg": false
}