{
  "name": "AmpliconSuiteAggregator",
  "version": "5.3.0",
  "summary": "Aggregator tool for multiple Amplicon Architect outputs",
  "license": "----------------------------------------------------------------\n               *** GENEPATTERN LICENSE AGREEMENT ***\n                           \n        ----------------------------------------------------------------\n        GenePattern is distributed under the following BSD-style license:\n                                    \n        Copyright (c) 2003-2022 Regents of the University of California. All rights reserved.\n                                    \n        Redistribution and use in source and binary forms, with or without modification, \n        are permitted provided that the following conditions are met:\n                                    \n             1. Redistributions of source code must retain the above copyright notice, \n                this list of conditions and the following disclaimer.\n                                    \n             2. Redistributions in binary form must reproduce the above copyright notice, \n                this list of conditions and the following disclaimer in the documentation \n                and/or other materials provided with the distribution.\n                                    \n             3. Neither the names of the Regents of the University of California \n                nor the names of its contributors may be used to endorse or promote products derived \n                from this software without specific prior written permission.\n                                    \n        THIS SOFTWARE IS PROVIDED AS IS.  REGENTS OF THE UNIVERSITY OF CALIFORNIA MAKE NO EXPRESS OR IMPLIED \n        REPRESENTATIONS OR WARRANTIES OF ANY KIND REGARDING THE SOFTWARE AND COPYRIGHT, \n        INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY, FITNESS FOR A \n        PARTICULAR PURPOSE, CONFORMITY WITH ANY DOCUMENTATION, NONINFRINGEMENT, OR THE \n        ABSENCE OF LATENT OR OTHER DEFECTS, WHETHER OR NOT DISCOVERABLE. IN NO EVENT SHALL\n        REGENTS OF THE UNIVERSITY OF CALIFORNIA, THE COPYRIGHT HOLDERS, OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, \n        INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, \n        BUT NOT LIMITED TO PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, \n        OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, \n        WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) \n        ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF, HAVE REASON \n        TO KNOW, OR IN FACT SHALL KNOW OF THE POSSIBILITY OF SUCH DAMAGE.\n                                    \n        If, by operation of law or otherwise, any of the aforementioned warranty disclaimers \n        are determined inapplicable, your sole remedy, regardless of the form of action, \n        including, but not limited to, negligence and strict liability, shall be replacement\n        of the software with an updated version if one exists.\n        ",
  "license_expression": null,
  "home_page": "https://github.com/AmpliconSuite/AmpliconSuiteAggregator",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/AmpliconSuite/AmpliconSuiteAggregator",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1772216312,
  "project_urls": {
    "Homepage": "https://github.com/AmpliconSuite/AmpliconSuiteAggregator",
    "Issues": "https://github.com/AmpliconSuite/AmpliconSuiteAggregator/issues"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": true
}