{
  "name": "seeq",
  "version": "66.98.1.20260202",
  "summary": "The Seeq SDK for Python",
  "license": "Seeq Python Library – License File\n        \n        \n        ------------------------------------------------------------------------------------------------------------------------\n        \n        Seeq Python Library - Copyright Notice\n        \n        © Copyright 2020 - Seeq Corporation\n        \n        Permission to Distribute - Permission is hereby granted, free of charge, to any person obtaining a copy of this Seeq\n        Python Library and associated documentation files (the \"Software\"), to copy the Software,  to publish and distribute\n        copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following\n        conditions:\n        \n        1. The foregoing permission does not grant any right to use, modify, merge, sublicense, sell or otherwise deal in the\n        Software, and all such use is subject to the terms and conditions of the Seeq Python Library - End User License\n        Agreement, below.\n        \n        2. The above copyright notice and the full text of this permission notice shall be included in all copies or\n        substantial portions of the Software. \n        \n        \n        ------------------------------------------------------------------------------------------------------------------------\n        \n        \n        SEEQ PYTHON LIBRARY - END USER LICENSE AGREEMENT\n        \n        This End User License Agreement (\"Agreement\") is a binding legal document between Seeq and you, which explains your\n        rights and obligations as a Customer using  Seeq products.  \"Customer\" means the person or company that downloads and\n        uses the Seeq Python library. \"Seeq\" means Seeq Corporation, 1301 2nd Avenue, Suite 2850, Seattle, WA 98101, USA. \n        \n        By installing or using the Seeq Python library, you agree on behalf of Customer to be bound by this Agreement. If you\n        do not agree to this Agreement, then do not install or use Seeq products. \n        \n        This Agreement, and your license to use the Seeq Python Library, remains in effect only during the term of any\n        subscription license that you purchase to use other Seeq software. Upon the termination or expiration of any such paid\n        license, this Agreement terminates immediately, and you will have no further right to use the Seeq Python Library.\n        \n        From time to time, Seeq may modify this Agreement, including any referenced policies and other documents. Any modified\n        version will be effective at the time it is posted to Seeq’s website at\n        https://www.seeq.com/legal/software-license-agreement.  To keep abreast of your license rights and relevant\n        restrictions, please bookmark this Agreement and read it periodically.  By using any Product after any modifications,\n        Customer agrees to all of the modifications.  \n        \n        This End User License Agreement (\"Agreement\") is entered into by and between Seeq Corporation (\"Seeq\") and the Customer\n        identified during the process of registering the Seeq Software. Seeq and Customer agree as follows.\n        \n        1. Definitions.\n        \n        \"Affiliate\" or \"Affiliates\" means any company, corporation, partnership, joint venture, or other entity in which any of\n        the Parties directly or indirectly owns, is owned by, or is under common ownership with a Party to this Agreement to\n        the extent of at least fifty percent (50%) of its equity, voting rights or other ownership interest (or such lesser\n        percentage which is the maximum allowed to be owned by a foreign corporation in a particular jurisdiction).\n        \n        \"Authorized Users\" means the individually-identified employees, contractors, representatives or consultants of Customer\n        who are permitted to use the Software in accordance with the applicable Order Document. \n        \n        \"Customer Data\" means data in Customer’s data resources that is accessed by, and processed in, Seeq Server software.\n        Customer Data includes all Derived Data.\n        \n        \"Derived Data\" means data derived by Authorized Users from Customer Data and consists of: scalars, signals, conditions,\n        journals, analyses, analysis results, worksheets, workbooks and topics.\n        \n        \"Documentation\" means Seeq’s standard installation materials, training materials, specifications and online help\n        documents normally made available by Seeq in connection with the Software, as modified from time to time by Seeq.\n        \n        \"On-Premise Software\" means Software that is installed on hardware owned or arranged by and under the control of\n        Customer, such as Customer-owned hardware, a private cloud or a public cloud. On-Premise Software is managed by\n        Customer. Examples of On-Premise Software include Seeq Server, Seeq Python library, Seeq Connectors and Seeq Remote\n        Agents.\n        \n        \"Order Document\" means each mutually-agreed ordering document used by the parties from time to time for the purchase of\n        licenses for the Software. Customer’s Purchase Order may, in conjunction with the applicable Proposal or Quote from\n        Seeq, constitute an Order Document subject to the terms of this Agreement. All Order Documents are incorporated by\n        reference into this Agreement.\n        \n        \"SaaS Software\" means Software that is installed on hardware arranged by and under the control of Seeq, such as\n        Microsoft Azure or AWS. SaaS Software is managed by Seeq. Example of SaaS Software include Seeq Server.\n        \n        \"Seeq Technology\" means the Software, the Documentation, all algorithms and techniques for use with the Software\n        created by Seeq, and all modifications, improvements, enhancements and derivative works thereof created by Seeq. \n        \n        \"Software\" means: (i) the Seeq Python library with which this License File is included, and (ii) Seeq software\n        applications identified on an applicable Order Document that are licensed to Customer pursuant to this Agreement.\n        Software includes On-Premise Software and SaaS Software.\n        \n        \"Subscription License\" means a license allowing Customer to access SaaS Software, and to copy, install and use\n        On-Premise Software, for the period of the Subscription Term.\n        \n        \"Subscription Term\" means the period of time specified in an Order Document during which the Subscription License is in\n        effect. The Subscription Term for the Seeq Python library shall be coterminous with Customer’s paid license to use Seeq\n        Software under an Order Document.\n        \n        2. Subscription License.\n        \n        a. License. Seeq grants Customer a worldwide, non-exclusive, non‐transferable, non‐sublicenseable right to access the\n        SaaS Software and to copy, install and use the On-Premise Software for the duration of the Subscription Term, subject\n        to the terms and conditions of this Agreement.  Seeq does not license the Software on a perpetual basis.\n        \n        b. Separate License Agreement. If Seeq and Customer have executed a separate License Agreement intended to govern\n        Customer’s use of the Software, then such separate License Agreement shall constitute the complete and exclusive\n        agreement of the parties for such use, and this Agreement shall be of no force or effect, regardless of any action by\n        Customer personnel that would have appeared to accept the terms of this Agreement.\n        \n        c. Authorized Users. Only Authorized Users may use the Software, and only up to the number of Authorized Users\n        specified in the applicable Order Document.  Customer designates each individual Authorized User in the Software. If\n        the number of Authorized Users is greater than the number specified in the particular Order Document, Customer will\n        purchase additional Authorized Users at the prices set out in the Order Document.\n        \n        d. Subscription Term. The Subscription Term shall begin and end as provided in the applicable Order Document. The\n        Subscription Term will not renew, except by a new Order Document acceptable to both parties. Upon renewal of a\n        Subscription Term, Customer will, if applicable, increase the number of Authorized Users to a number that Customer\n        believes in good faith will be sufficient to accommodate any expected growth in the number of Customer’s users during\n        the new Subscription Term. This Agreement will continue in effect for the Subscription Term of all Order Documents\n        hereunder.\n        \n        e. Limitations on Use.  All use of Software must be in accordance with the relevant Documentation.  End User may make a\n        limited number of copies of the Software as is strictly necessary for purposes of data protection, archiving, backup,\n        and testing. Customer will use the Software for its internal business purposes and to process information about the\n        operations of Customer and its Affiliates, and will not, except as provided in an Order Document, directly or\n        indirectly, use the Software to process information about or for any other company. Customer will: (i) not permit\n        unauthorized use of the Software, (ii) not infringe or violate the intellectual property rights, privacy, or any other\n        rights of any third party or any applicable law, (iii) ensure that each user uses a unique Authorized User ID and\n        password, (iv) not, except as provided in an Order Document,  allow resale, timesharing, rental or use of the Software\n        in a service bureau or as a provider of outsourced services, and (v) not modify, adapt, create derivative works of,\n        reverse engineer, decompile, or disassemble the Software or Seeq Technology.\n        \n        f. Software Modification. Seeq may modify the Software from time to time, but such modification will not materially\n        reduce the functionality of the Software. Seeq may contract with third parties to support the Software, so long as they\n        are subject to obligations of confidentiality to Seeq at least as strict as Seeq’s to Customer. Seeq shall remain\n        responsible for the performance of its contractors.\n        \n        2. Support. Support for Customer’s use of the Software is included in Customer’s subscription fee. Seeq will provide\n        support and maintenance for the Software, including all applicable updates, and web-based support assistance in\n        accordance with Seeq’s support policies in effect from time to time. Other professional services are available for\n        additional fees.\n        \n        3. Ownership.  \n        \n        a. Customer Data. Customer owns all Customer Data, including all Derived Data, and Seeq shall not receive any ownership\n        interest in it. Seeq may use the Customer Data only to provide the Software capabilities purchased by Customer and as\n        permitted by this Agreement, and not for any other purpose. Customer is the owner and data controller for the Customer\n        Data. \n        \n        b. Software and Seeq Technology. Seeq retains all rights in the Software and the Seeq Technology (subject to the\n        license granted to Customer). Customer will not, and will not allow any other person to, modify, adapt, create\n        derivative works of, reverse engineer, decompile, or disassemble the Software or Seeq Technology. All new Seeq\n        Technology developed by Seeq while working with Customer, including any that was originally based on feedback,\n        suggestions, requests or comments from Customer, shall be Seeq’s sole property, and Customer shall have the right to\n        use any such new Seeq Technology only in connection with the Software. \n        \n        c. Third-Party Open Source Software. The Software incorporates third-party open source software. All such software must\n        comply with Seeq’s Third Party Open Source License Policy. Customer may request a list of such third-party software and\n        a copy of the Policy at any time.\n        \n        4. Fees and Payment Terms.\n        \n        a. Fees.  Customer shall pay the fees as specified in the Order Document. Unless otherwise specified in the Order\n        Document, all amounts are in US Dollars (USD). Upon renewal of a Subscription Term, Customer will, if applicable,\n        increase the number of Authorized Users to a number that Customer believes in good faith will be sufficient to\n        accommodate any expected growth in the number of Customer’s users during the new Subscription Term.\n        \n        b. Invoicing & Payment.  All payments are due within 30 days of the date of the invoice and are non-cancellable and\n        non-refundable except as provided in this Agreement. If Customer does not pay any amount (not disputed in good faith)\n        when due, Seeq may charge interest on the unpaid amount at the rate of 1.0% per month (or if less, the maximum rate\n        allowed by law). If Customer does not pay an overdue amount (not disputed in good faith) within 20 days of notice of\n        non-payment, Seeq may suspend the Software until such payment is received, but Customer will remain obligated to make\n        all payments due under this Agreement. Customer agrees to pay Seeq’s expenses, including reasonable attorneys and\n        collection fees, incurred in collecting amounts not subject to a good faith dispute.\n        \n        c. Excess Usage of Software.  The Software has usage limitations based on the number of Authorized Users or other\n        metrics as set forth on the Order Document. Customer shall maintain accurate records regarding Customer’s actual use of\n        the Software and shall make such information promptly available to Seeq upon request. Seeq may also monitor Customer’s\n        use of the Software. \n        \n        d. Fees for Excess Usage of Software. Seeq will not require Customer to pay for past excess use, and in consideration\n        thereof:\n        \n        i. If Customer’s license covers a fixed number of Authorized Users, Customer will promptly issue a new Order Document\n        to cover current and good-faith anticipated future excess use. \n        \n        ii. If Customer’s license is under Seeq’s Extended Experience Program, Strategic Agreement Program or any other program\n        not tied directly to a fixed number of Authorized Users, then the parties will negotiate in good faith as follows: \n        \n        (1) if the excess use is less than 50% above the number of Authorized Users that was used to set pricing for such\n        license for the current contract period (usually a year), the parties will negotiate an appropriate usage level and\n        fees for the next contract period, and             \n        \n        (2) If the excess use is more than 50% above such number, the parties will negotiate appropriate usage levels and fees\n        for the remainder of the current and the next contract periods, with additional fees for the current period payable\n        upon Seeq’s invoice.\n        \n        e. Taxes.  All fees are exclusive of all taxes, including federal, state and local use, sales, property, value-added,\n        ad valorem and similar taxes related to this transaction, however designated (except taxes based on Seeq’s net income).\n        Unless Customer presents valid evidence of exemption, Customer agrees to pay any and all such taxes that it is\n        obligated by law to pay. Customer will pay Seeq’s invoices for such taxes whenever Seeq is required to collect such\n        taxes from Customer.\n        \n        f. Purchase through Seeq Partner. In the event that End User purchased its subscription to Seeq through an accredited\n        Seeq Partner, notwithstanding provisions of this Agreement relating to End User's payments to Seeq, Partner will\n        invoice End User, or charge End User using the credit card on file, and End User will pay all applicable subscription\n        fees to Partner. \n        \n        6. Confidentiality.  \"Confidential Information\" means all information and materials obtained by a party (the\n        \"Recipient\") from the other party (the \"Disclosing Party\"), whether in tangible form, written or oral, that is\n        identified as confidential or would reasonably be understood to be confidential given the nature of the information and\n        circumstances of disclosure, including without limitation Customer Data, the Software, Seeq Technology, and the terms\n        and pricing set out in this Agreement and Order Documents. Confidential Information does not include information that\n        (a) is already known to the Recipient prior to its disclosure by the Disclosing Party; (b) is or becomes generally\n        known through no wrongful act of the Recipient; (c) is independently developed by the Recipient without use of or\n        reference to the Disclosing Party’s Confidential Information; or (d) is received from a third party without restriction\n        and without a breach of an obligation of confidentiality. The Recipient shall not use or disclose any Confidential\n        Information without the Disclosing Party’s prior written permission, except to its employees, contractors, directors,\n        representatives or consultants who have a need to know in connection with this Agreement or Recipient’s business\n        generally, or as otherwise allowed herein. The Recipient shall protect the confidentiality of the Disclosing Party’s\n        Confidential Information in the same manner that it protects the confidentiality of its own confidential information of\n        a similar nature, but using not less than a reasonable degree of care. The Recipient may disclose Confidential\n        Information to the extent that it is required to be disclosed pursuant to a statutory or regulatory provision or court\n        order, provided that the Recipient provides prior notice of such disclosure to the Disclosing Party, unless such notice\n        is prohibited by law, rule, regulation or court order. As long as an Order Document is active under this Agreement and\n        for two (2) years thereafter, and at all times while Customer Data is in Seeq’s possession, the confidentiality\n        provisions of this Section shall remain in effect.\n        \n        7. Security.  Seeq will maintain and enforce commercially reasonable physical and logical security methods and\n        procedures to protect Customer Data on the SaaS Software and to secure and defend the SaaS Software against \"hackers\"\n        and others who may seek to access the SaaS Software without authorization. Seeq will test its systems for potential\n        security vulnerabilities at least annually. Seeq will use commercially reasonable efforts to remedy any breach of\n        security or unauthorized access. Seeq reserves the right to suspend access to the Seeq System in the event of a\n        suspected or actual security breach. Customer will maintain and enforce commercially reasonable security methods and\n        procedures to prevent misuse of the log-in information of its employees and other users. Seeq shall not be liable for\n        any damages incurred by Customer or any third party in connection with any unauthorized access resulting from the\n        actions of Customer or its representatives.\n        \n        8. Warranties.\n        \n        a. Authority and Compliance with Laws.  Each party warrants and represents that it has all requisite legal authority to\n        enter into this Agreement and that it shall comply with all laws applicable to its performance hereunder including\n        export laws and laws pertaining to the collection and use of personal data.\n        \n        b. Industry Standards and Documentation.  Seeq warrants and represents that the Software will materially conform to the\n        specifications as set forth in the applicable Documentation. At no additional cost to Customer, and as Customer’s sole\n        and exclusive remedy for nonconformity of the Software with this limited warranty, Seeq will use commercially\n        reasonable efforts to correct any such nonconformity, provided Customer promptly notifies Seeq in writing outlining the\n        specific details upon discovery, and if such efforts are unsuccessful, then Customer may terminate, and receive a\n        refund of all pre-paid and unused fees for, the affected Software. This limited warranty shall be void if the failure\n        of the Software to conform is caused by (i) the use or operation of the Software with an application or in an\n        environment other than as set forth in the Documentation, or (ii) modifications to the Software that were not made by\n        Seeq or Seeq’s authorized representatives.\n        \n        c. Malicious Code. Seeq will not introduce any time bomb, virus or other harmful or malicious code designed to disrupt\n        the use of the Software, other than Seeq’s ability to disable access to the Software in the event of termination or\n        suspension as permitted hereunder.\n        \n        d. DISCLAIMER.  EXCEPT AS EXPRESSLY SET FORTH HEREIN, NEITHER PARTY MAKES ANY REPRESENTATIONS OR WARRANTIES OF ANY\n        KIND, WHETHER EXPRESS OR IMPLIED, INCLUDING ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR\n        NON-INFRINGEMENT. EXCEPT AS STATED IN THIS SECTION, SEEQ DOES NOT REPRESENT THAT CUSTOMER’S USE OF THE SOFTWARE WILL BE\n        SECURE, UNINTERRUPTED OR ERROR FREE. NO STATEMENT OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED FROM SEEQ IN ANY\n        MEANS OR FASHION SHALL CREATE ANY WARRANTY NOT EXPRESSLY AND EXPLICITLY SET FORTH IN THIS AGREEMENT.\n        \n        9. Indemnification by Seeq.  Seeq shall indemnify, defend and hold Customer harmless from and against all losses\n        (including reasonable attorney fees) arising out of any third-party suit or claim alleging that Customer’s authorized\n        use of the Software infringes any valid U.S. or European Union patent or trademark, trade secret or other proprietary\n        right of such third party. Customer shall: (i) give Seeq prompt written notice of such suit or claim, (ii) grant Seeq\n        sole control of the defense or settlement of such suit or claim and (iii) reasonably cooperate with Seeq, at Seeq’s\n        expense, in its defense or settlement of the suit or claim. To the extent that Seeq is prejudiced by Customer's failure\n        to comply with the foregoing requirements, Seeq shall not be liable hereunder. Seeq may, at its option and expense, (i)\n        replace the Software with compatible non-infringing Software, (ii) modify the Software so that it is non-infringing,\n        (iii) procure the right for Customer to continue using the Software, or (iv) if the foregoing options are not\n        reasonably available, terminate the applicable Order Document and refund Customer all prepaid fees for Software\n        applicable to the remainder of the applicable Subscription Term. Seeq shall have no obligation to Customer with respect\n        to any infringement claim against Customer if such claim existed prior to the effective date of the applicable Order\n        Document or such claim is based upon (i) Customer’s use of the Software in a manner not expressly authorized by this\n        Agreement, (ii) the combination, operation, or use of the Software with third party material that was not provided by\n        Seeq, if Customer’s liability would have been avoided in the absence of such combination, use, or operation, or (iii)\n        modifications to the Software other than as authorized in writing by Seeq. THIS SECTION SETS FORTH SEEQ’S ENTIRE\n        OBLIGATION TO CUSTOMER WITH RESPECT TO ANY CLAIM SUBJECT TO INDEMNIFICATION UNDER THIS SECTION.\n        \n        10. LIMITATION OF LIABILITIES.  IN NO EVENT SHALL EITHER PARTY OR THEIR SERVICE PROVIDERS, LICENSORS CONTRACTORS OR\n        SUPPLIERS BE LIABLE FOR ANY INDIRECT, INCIDENTAL, CONSEQUENTIAL, SPECIAL OR PUNITIVE DAMAGES OF ANY KIND, INCLUDING\n        WITHOUT LIMITATION DAMAGES FOR COVER OR LOSS OF USE, DATA, REVENUE OR PROFITS, EVEN IF SUCH PARTY HAS BEEN ADVISED OF\n        THE POSSIBILITY OF SUCH DAMAGES. THE FOREGOING LIMITATION OF LIABILITY AND EXCLUSION OF CERTAIN DAMAGES SHALL APPLY\n        REGARDLESS OF THE SUCCESS OR EFFECTIVENESS OF OTHER REMEDIES. EXCEPT FOR THE PARTIES’ INDEMNIFICATION OBLIGATIONS,\n        DAMAGES FOR BODILY INJURY OR DEATH, DAMAGES TO REAL PROPERTY OR TANGIBLE PERSONAL PROPERTY, AND FOR BREACHES OF\n        CONFIDENTIALITY UNDER SECTION 6, IN NO EVENT SHALL THE AGGREGATE LIABILITY OF A PARTY, ITS SERVICE PROVIDERS,\n        LICENSORS, CONTRACTORS OR SUPPLIERS ARISING UNDER THIS AGREEMENT, WHETHER IN CONTRACT, TORT OR OTHERWISE, EXCEED THE\n        TOTAL AMOUNT OF FEES PAID BY CUSTOMER TO SEEQ FOR THE RELEVANT SOFTWARE WITHIN THE PRECEDING TWELVE (12) MONTHS. \n        \n        11. Termination and Expiration.\n        \n        a. Termination Rights.  A party may terminate any Order Document: (i) for any material breach not cured within thirty\n        (30) days following written notice of such breach, and (ii) immediately upon written notice if the other party files\n        for bankruptcy, becomes the subject of any bankruptcy proceeding or becomes insolvent.\n        \n        b. Customer Termination for Convenience. Customer may terminate any Order Document for any reason at any time.\n        \n        c. Termination Effects.  Upon termination by Customer under Section 13(a)(i)  or 13(b) above, Seeq shall refund\n        Customer all prepaid and unused fees for the Software. Upon termination by Seeq under Section 13(a)(i) above, Customer\n        shall promptly pay all unpaid fees due through the end of the Subscription Term of such Order Document. \n        \n        d. Access and Data. Upon expiration or termination of an Order Document, Seeq will disable access to the applicable\n        SaaS Software, and Customer will uninstall and destroy all copies of the Software and Documentation on hardware under\n        its control. Upon Customer request, Seeq will provide Customer with a copy of all Customer Data in Seeq’s possession,\n        in a mutually agreeable format within a mutually agreeable timeframe. Notwithstanding the foregoing: (i) Seeq may\n        retain backup copies of Customer Data for a limited period of time in accordance with Seeq’s then-current backup\n        policy, and (ii)  Seeq will destroy all Customer Data no later than 3 months after end of the Subscription Term or\n        earlier, upon written request from Customer.\n        \n        12. General.\n        \n        a. Amendment. Seeq may modify this Agreement from time to time, including any referenced policies and other documents.\n        Any modified version will be effective at the time it is posted on Seeq’s website at\n        https://seeq.com/legal/software-license-agreement. \n        \n        b. Precedence. The Order Document is governed by the terms of this Agreement and in the event of a conflict or\n        discrepancy between the terms of an Order Document and the terms of this Agreement, this Agreement shall govern except\n        as to the specific Software ordered, and the fees, currency and payment terms for such orders, for which the Order\n        Document shall govern, as applicable. If an Order Document signed by Seeq explicitly states that it is intended to\n        amend or modify a term of this Agreement, such Order Document shall govern over this Agreement solely as to the\n        amendment or modification. Seeq objects to and rejects any additional or different terms proposed by Customer,\n        including those contained in Customer’s purchase order, acceptance, vendor portal or website. Neither Seeq’s acceptance\n        of Customer’s purchase order nor its failure to object elsewhere to any provisions of any subsequent document, website,\n        communication, or act of Customer shall be deemed acceptance thereof or a waiver of any of the terms hereof.\n        \n        c. Assignment.  Neither party may assign this Agreement, in whole or in part, without the prior written consent of the\n        other, which shall not be unreasonably withheld. However, either party may assign this Agreement to any Affiliate, or\n        to a person or entity into which it has merged or which has otherwise succeeded to all or substantially all of its\n        business or assets to which this Agreement pertains, by purchase of stock, assets, merger, reorganization or otherwise,\n        and which has assumed in writing or by operation of law its obligations under this Agreement, provided that Customer\n        shall not assign this Agreement to a direct competitor of Seeq. Any assignment or attempted assignment in breach of\n        this Section shall be void. This Agreement shall be binding upon and shall inure to the benefit of the parties’\n        respective successors and assigns.\n        \n        d. Employees.  Each party agrees that during, and for one year after, the term of this Agreement, it will not directly\n        or indirectly solicit for hire any of the other party’s employees who were actively engaged in the provision or use of\n        the Software without the other party’s express written consent. This restriction shall not apply to offers extended\n        solely as a result of and in response to public advertising or similar general solicitations not specifically targeted\n        at the other party’s employees.\n        \n        e. Independent Contractors.  The parties are independent contractors and not agents or partners of, or joint venturers\n        with, the other party for any purpose. Neither party shall have any right, power, or authority to act or create any\n        obligation, express or implied, on behalf of the other party.\n        \n        f. Notices.  All notices required under this Agreement shall be in writing and shall be delivered personally against\n        receipt, or by registered or certified mail, return receipt requested, postage prepaid, or sent by\n        nationally-recognized overnight courier service, and addressed to the party to be notified at their address set forth\n        below. All notices and other communications required or permitted under this Agreement shall be deemed given when\n        delivered personally, or one (1) day after being deposited with such overnight courier service, or five (5) days after\n        being deposited in the United States mail, postage prepaid to Seeq at 1301 Second Avenue, #2850, Seattle, WA 98101,\n        Attn: Legal and to Customer at the then-current address in Seeq’s records, or to such other address as each party may\n        designate in writing.\n        \n        g. Force Majeure.  Except for payment obligations hereunder, either party shall be excused from performance of\n        non-monetary obligations under this Agreement for such period of time as such party is prevented from performing such\n        obligations, in whole or in part, due to causes beyond its reasonable control, including but not limited to, delays\n        caused by the other party, acts of God, war, terrorism, criminal activity, civil disturbance, court order or other\n        government action, third party performance or non-performance, strikes or work stoppages, provided that such party\n        gives prompt written notice to the other party of such event.\n        \n        h. Integration. This Agreement, including all Order Documents and documents attached hereto or incorporated herein by\n        reference, constitutes the complete and exclusive statement of the parties’ agreement and supersedes all proposals or\n        prior agreements, oral or written, between the parties relating to the subject matter hereof.\n        \n        i. Not Contingent. The party’s obligations hereunder are neither contingent on the delivery of any future functionality\n        or features of the Software nor dependent on any oral or written public comments made by Seeq regarding future\n        functionality or features of the Software.\n        \n        j. No Third Party Rights. No right or cause of action for any third party is created by this Agreement or any\n        transaction under it.\n        \n        k. Non-Waiver; Invalidity.  No waiver or modification of the provisions of this Agreement shall be effective unless in\n        writing and signed by the party against whom it is to be enforced. If any provision of this Agreement is held invalid,\n        illegal or unenforceable, the validity, legality and enforceability of the remaining provisions shall not be affected\n        or impaired thereby. A waiver of any provision, breach or default by either party or a party’s delay exercising its\n        rights shall not constitute a waiver of any other provision, breach or default.\n        \n        l. Governing Law and Venue.  This Agreement will be interpreted and construed in accordance with the laws of the State\n        of Delaware without regard to conflict of law principles, and both parties hereby consent to the exclusive jurisdiction\n        and venue of courts in Wilmington, Delaware in all disputes arising out of or relating to this Agreement.\n        \n        m. Mediation.  The parties agree to attempt to resolve disputes without extended and costly litigation. The parties\n        will: (1) communicate any dispute to other party, orally and in writing; (2) respond in writing to any written dispute\n        from other party within 15 days of receipt; (3) if satisfactory resolution does not occur within 45 days of initial\n        written notification of the dispute, and if both parties do not mutually agree to a time extension, then either party\n        may seek a remedy in court.\n        \n        n. Survival.  Provisions of this Agreement that are intended to survive termination or expiration of this  Agreement in\n        order to achieve the fundamental purposes of this Agreement shall so survive, including without limitation: Ownership,\n        Fees and Payment Terms, Confidentiality, Customer Data, Indemnification by Seeq and Limitation of Liabilities.\n        \n        o. Headings and Language.  The headings of sections included in this Agreement are inserted for convenience only and\n        are not intended to affect the meaning or interpretation of this Agreement. The parties to this Agreement and Order\n        Document have requested that this Agreement and all related documentation be written in English.\n        \n        p. Federal Government End Use Provisions.  Seeq provides the Software, including related technology, for ultimate\n        federal government end use solely in accordance with the following: Government technical data and software rights\n        related to the Software include only those rights customarily provided to the public as defined in this Agreement. This\n        customary commercial license is provided in accordance with FAR 12.211 (Technical Data) and FAR 12.212 (Software) and,\n        for Department of Defense transactions, DFAR 252.227-7015 (Technical Data – Commercial Items) and DFAR 227.7202-3\n        (Rights in Commercial Computer Software or Computer Software Documentation).\n        \n        q. Contract for Services.  The parties intend this Agreement to be a contract for the provision of services and not a\n        contract for the sale of goods. To the fullest extent permitted by law, the provisions of the Uniform Commercial Code\n        (UCC), the Uniform Computer Information Transaction Act (UCITA), the United Nations Convention on Contracts for the\n        International Sale of Goods , and any substantially similar legislation as may be enacted, shall not apply to this\n        Agreement.\n        \n        r. Actions Permitted.  Except for actions for nonpayment or breach of a party’s proprietary rights, no action,\n        regardless of form, arising out of or relating to the Agreement may be brought by either party more than one year after\n        the cause of action has accrued.\n        \n        Should you have any questions concerning this Agreement, please contact Seeq at legal@seeq.com.\n        \n        \n        \n        \n        ",
  "license_expression": null,
  "home_page": "https://www.seeq.com",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://www.seeq.com",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1770041544,
  "project_urls": {
    "Changelog": "https://python-docs.seeq.com/changelog.html",
    "Documentation": "https://python-docs.seeq.com/",
    "Homepage": "https://www.seeq.com"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}