{
  "name": "shotgun-api3",
  "version": "3.10.0",
  "summary": "Flow Production Tracking Python API",
  "license": "Copyright (c) 2009-2011, Shotgun Software Inc\n        All rights reserved.\n        \n        Redistribution and use in source and binary forms, with or without\n        modification, are permitted provided that the following conditions are met:\n        \n         - Redistributions of source code must retain the above copyright notice, this\n           list of conditions and the following disclaimer.\n        \n         - Redistributions in binary form must reproduce the above copyright notice,\n           this list of conditions and the following disclaimer in the documentation\n           and/or other materials provided with the distribution.\n        \n         - Neither the name of the Shotgun Software Inc nor the names of its\n           contributors may be used to endorse or promote products derived from this\n           software without specific prior written permission.\n        \n        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\n        AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n        IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n        DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\n        FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n        DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n        SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\n        CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\n        OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n        OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n        \n        Portions of code (xml-rpc client libs from standard python distro):\n        \n        Copyright (c) 1999-2002 by Secret Labs AB\n        Copyright (c) 1999-2002 by Fredrik Lundh\n        \n        By obtaining, using, and/or copying this software and/or its\n        associated documentation, you agree that you have read, understood,\n        and will comply with the following terms and conditions:\n        \n        Permission to use, copy, modify, and distribute this software and\n        its associated documentation for any purpose and without fee is\n        hereby granted, provided that the above copyright notice appears in\n        all copies, and that both that copyright notice and this permission\n        notice appear in supporting documentation, and that the name of\n        Secret Labs AB or the author not be used in advertising or publicity\n        pertaining to distribution of the software without specific, written\n        prior permission.\n        \n        SECRET LABS AB AND THE AUTHOR DISCLAIMS ALL WARRANTIES WITH REGARD\n        TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANT-\n        ABILITY AND FITNESS.  IN NO EVENT SHALL SECRET LABS AB OR THE AUTHOR\n        BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY\n        DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\n        WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS\n        ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE\n        OF THIS SOFTWARE.",
  "license_expression": null,
  "home_page": "https://github.com/shotgunsoftware/python-api",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "Autodesk",
  "repository": "https://github.com/shotgunsoftware/python-api",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1770340268,
  "project_urls": {
    "Homepage": "https://github.com/shotgunsoftware/python-api"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": false,
  "has_setup_py": true,
  "has_setup_cfg": false
}