{
  "name": "erisml",
  "version": "0.1.0",
  "summary": "ErisML: A library for governed, foundation-model-enabled agents with tensorial ethics.",
  "license": "AGI-HPC RESPONSIBLE AI LICENSE\n        Version 1.0 – DRAFT (Non-Legal Advice)\n        \n        IMPORTANT NOTICE  \n        This License is provided for informational and research purposes and does not constitute legal advice.  \n        Before adopting it for your project, you should consult qualified legal counsel.\n        \n        0. IDENTIFICATION\n        \n        Project: erisml-lib  \n        Licensor: Andrew H. Bond and contributing authors  \n        Institutional Affiliation: San José State University (SJSU), where applicable  \n        Contact: agi.hpc@gmail.com \n        \n        By using, copying, modifying, or distributing the Software (as defined below), you accept this License.\n        \n        1. DEFINITIONS\n        \n        1.1 “Software” means the AGI-HPC source code, object code, configuration files, documentation, and related materials made available under this License.\n        \n        1.2 “You” (or “Your”) means any individual or legal entity exercising permissions granted by this License.\n        \n        1.3 “Research Use” means use of the Software solely for non-commercial research, experimentation, teaching, or academic publication, where no direct commercial service or product is offered based primarily on the Software.\n        \n        1.4 “Commercial Use” means any use of the Software or Derivative Works (as defined below) to provide products or services for a fee, for internal business advantage, or as part of a commercial product, including but not limited to SaaS offerings, consulting services, and commercial deployments.\n        \n        1.5 “Derivative Work” means any work based on or incorporating the Software, including modifications, translations, adaptations, or combinations with other software or systems.\n        \n        1.6 “Autonomous Deployment” means any deployment in which the Software or a Derivative Work:\n          (a) selects or executes actions in the physical world (directly or via robots, vehicles, or other actuators), OR\n          (b) issues actions that can materially affect persons, property, or critical infrastructure, OR\n          (c) operates continuously or semi-continuously without direct human approval of each action.\n        \n        1.7 “Safety and Governance Controls” means mechanisms designed to promote safe, transparent, and legitimate behavior of autonomous systems, including but not limited to:\n          (a) explicit normative constraints and world models (e.g., ErisML or equivalent),\n          (b) pluralistic, auditable ethical decision modules (e.g., DEME or equivalent),\n          (c) logging, audit trails, and tamper-evident records,\n          (d) runtime safety envelopes, constraint filters, and fail-safe behavior.\n        \n        1.8 “High-Risk Domain” means any setting where the consequences of actions may reasonably include serious physical, psychological, economic, or societal harm, including but not limited to:\n          autonomous vehicles, medical or care systems, critical infrastructure, defense or security, financial systems, large-scale social platforms, and high-stakes recommendation or decision systems.\n        \n        2. GRANT OF RIGHTS\n        \n        Subject to the terms and conditions of this License, the Licensor hereby grants You a worldwide, royalty-free, non-exclusive license to:\n        \n        2.1 Use the Software for Research Use.\n        \n        2.2 Reproduce and modify the Software to create Derivative Works for Research Use.\n        \n        2.3 Distribute the Software and Derivative Works for Research Use, provided You:\n          (a) include a copy of this License with any distribution, and\n          (b) preserve all copyright, attribution, and license notices.\n        \n        2.4 Commercial Use and Autonomous Deployment are NOT granted by default under this License and require separate written permission from the Licensor (see Section 6).\n        \n        3. CONDITIONS FOR USE IN AUTONOMOUS OR AGI-LIKE SYSTEMS\n        \n        If You use the Software or a Derivative Work as part of an Autonomous Deployment, or for AGI-like capabilities (e.g., general-purpose planning, tool use, long-term memory, or self-improving agents), You MUST:\n        \n        3.1 Implement and maintain Safety and Governance Controls appropriate to the domain and deployment, including at minimum:\n          (a) explicit normative constraints and environment modeling (e.g., ErisML or a substantially equivalent formalism),\n          (b) one or more auditable ethical decision modules, subject to transparent evaluation and documentation (e.g., DEME-style modules),\n          (c) logging of decisions and relevant state for later audit, with tamper-evident protections,\n          (d) safe fallback behaviors and mechanisms to minimize harm under uncertainty or partial failure.\n        \n        3.2 NOT disable, bypass, or materially weaken Safety and Governance Controls derived from the Software unless:\n          (a) they are replaced with controls of equal or greater safety and transparency, and\n          (b) such changes are documented and, where appropriate, disclosed to relevant stakeholders.\n        \n        3.3 Conduct reasonable, good-faith testing and evaluation before deployment, including:\n          (a) stress testing in diverse scenarios,\n          (b) assessment of failure modes and risk mitigation strategies,\n          (c) domain-specific safety reviews appropriate to the High-Risk Domain involved.\n        \n        3.4 Ensure that relevant human stakeholders (e.g., users, affected parties, regulators) can access information about:\n          (a) the existence and purpose of the autonomous system,\n          (b) the general nature of its decision logic (without revealing trade secrets or sensitive security details),\n          (c) the means by which harms or concerns can be reported.\n        \n        4. PROHIBITED USES\n        \n        Regardless of Research or Commercial status, You MUST NOT use the Software or any Derivative Work in ways that:\n        \n        4.1 Develop, train, deploy, or operate:\n          (a) weapons systems designed primarily to harm, kill, or destroy, or\n          (b) systems whose primary purpose is coercive surveillance or suppression of fundamental rights.\n        \n        4.2 Intentionally or recklessly cause:\n          (a) serious physical harm or death,\n          (b) significant psychological or economic harm to individuals or groups,\n          (c) large-scale or systematic discrimination, exploitation, or violations of human rights.\n        \n        4.3 Circumvent, undermine, or disable:\n          (a) democratic or regulatory governance structures,\n          (b) accountability or audit mechanisms,\n          (c) legal processes or legitimate oversight.\n        \n        4.4 Violate applicable laws or regulations, including export controls, data protection laws, or sector-specific safety standards.\n        \n        If You are unsure whether a particular use is prohibited, You should seek clarification from the Licensor and/or legal counsel before proceeding.\n        \n        5. ATTRIBUTION AND NOTICE\n        \n        5.1 In all copies or substantial portions of the Software and Derivative Works, You must:\n        \n          (a) Retain the following attribution notice (or a close paraphrase):\n        \n              “This project incorporates components from the AGI-HPC architecture\n               (Andrew H. Bond et al., San José State University), used under the\n               AGI-HPC Responsible AI License v1.0.”\n        \n          (b) Include a link to the original repository, where practical:\n              https://github.com/ahb-sjsu/agi-hpc\n        \n        5.2 Academic works, publications, and technical reports using the Software should, where appropriate, cite the relevant AGI-HPC and DEME/ErisML papers.\n        \n        6. COMMERCIAL USE AND HIGH-RISK DEPLOYMENTS\n        \n        6.1 Commercial Use of the Software or Derivative Works requires a separate written agreement with the Licensor. Without such an agreement, Commercial Use is not permitted.\n        \n        6.2 Any Autonomous Deployment in a High-Risk Domain (as defined in Section 1.8) requires:\n          (a) either a separate written agreement with the Licensor, OR\n          (b) explicit written permission stating that this License alone is sufficient for that deployment.\n        \n        6.3 The Licensor may offer separate commercial, evaluation, or deployment-specific terms that modify or supplement this License for particular use cases.\n        \n        7. CONTRIBUTIONS\n        \n        7.1 By submitting code, documentation, or other materials (“Contributions”) to the AGI-HPC project, You agree that:\n        \n          (a) Your Contributions are licensed to the public under this same License (AGI-HPC Responsible AI License v1.0), and  \n          (b) You have the right to grant such a license for Your Contributions.\n        \n        7.2 The Licensor may, at their discretion, relicense or dual-license future versions of the Software, provided that existing versions remain available under this License.\n        \n        8. NO WARRANTY\n        \n        THE SOFTWARE IS PROVIDED “AS IS” AND “AS AVAILABLE,” WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, AND TITLE.\n        \n        USE OF THE SOFTWARE IS AT YOUR OWN RISK. YOU ARE RESPONSIBLE FOR ENSURING THAT YOUR USE IS SAFE, LEGAL, AND APPROPRIATE FOR YOUR APPLICATION.\n        \n        9. LIMITATION OF LIABILITY\n        \n        TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL THE LICENSOR OR CONTRIBUTORS BE LIABLE FOR ANY CLAIM, DAMAGES, OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT, OR OTHERWISE, ARISING FROM, OUT OF, OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE, INCLUDING BUT NOT LIMITED TO INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES.\n        \n        10. TERMINATION\n        \n        10.1 This License terminates automatically if You:\n          (a) materially breach any of its terms, or\n          (b) engage in any Prohibited Use outlined in Section 4.\n        \n        10.2 Upon termination:\n          (a) all rights granted to You under this License cease immediately, and\n          (b) You must cease use and distribution of the Software and Derivative Works, except as required for safe wind-down or legal compliance.\n        \n        10.3 Termination does not limit any other rights or remedies available to the Licensor under applicable law.\n        \n        11. UPDATES TO THIS LICENSE\n        \n        The Licensor may publish revised versions of this License from time to time. New versions will be identified by version number and date.\n        \n        Unless explicitly stated otherwise, new versions do not retroactively change the terms under which previously released versions of the Software were provided.\n        \n        12. GOVERNING LAW AND VENUE\n        \n        This License shall be governed by and construed in accordance with the laws of [choose jurisdiction, e.g., the State of California, USA], without regard to its conflict-of-law principles.\n        \n        Any disputes arising under or in connection with this License shall be subject to the exclusive jurisdiction of the courts located in [e.g., Santa Clara County, California], unless otherwise required by applicable law.\n        \n        13. MISCELLANEOUS\n        \n        13.1 If any provision of this License is held unenforceable, that provision shall be enforced to the maximum extent permissible, and the remaining provisions shall remain in full force and effect.\n        \n        13.2 This License constitutes the entire agreement between You and the Licensor regarding the Software, except to the extent it is superseded by a separate written agreement.\n        \n        END OF LICENSE\n        ",
  "license_expression": null,
  "home_page": "https://github.com/ahb-sjsu/erisml-lib",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/ahb-sjsu/erisml-lib",
  "repository_source": "project_urls.homepage",
  "pub_date": 1768970185,
  "project_urls": {
    "Homepage": "https://github.com/ahb-sjsu/erisml-lib",
    "Bug Tracker": "https://github.com/ahb-sjsu/erisml-lib/issues",
    "Documentation": "https://ahb-sjsu.github.io/erisml-lib/"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false
}