{
  "name": "opentimspy",
  "version": "1.0.20",
  "summary": "opentimspy: An open-source parser of Bruker Tims Data File (.tdf).",
  "license": "OpenTIMS is released under the terms of MIT licence, as\n         published by the Free Software Foundation. Full text below.\n         If you require other licensing terms please contact the authors.\n         \n         OpenTIMS contains built-in versions of the following software:\n         - sqlite3, public domain\n         - ZSTD, BSD licence\n         - mio, MIT licence\n         \n         See the respective files for details.\n         \n         ============================================================\n         \n         Copyright (C) 2020-2024 Michał Startek and Mateusz Łącki\n         \n         Permission is hereby granted, free of charge, to any person obtaining a copy of\n         this software and associated documentation files (the “Software”), to deal in\n         the Software without restriction, including without limitation the rights to\n         use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of\n         the Software, and to permit persons to whom the Software is furnished to do so,\n         subject to the following conditions:\n         \n         The above copyright notice and this permission notice shall be included in all\n         copies or substantial portions of the Software.\n         \n         THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n         IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS\n         FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR\n         COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER\n         IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\n         CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n         ",
  "license_expression": null,
  "home_page": "https://github.com/michalsta/opentims",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/michalsta/opentims.git",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1771864339,
  "project_urls": {
    "Homepage": "https://github.com/michalsta/opentims",
    "Repository": "https://github.com/michalsta/opentims.git"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": false,
  "has_setup_py": false,
  "has_setup_cfg": false
}