{
  "name": "open-ortho-terminology",
  "version": "1.2.0",
  "summary": "A package for managing orthodontic codes and namespaces.",
  "license": "## MIT License\n        \n        Copyright (c) 2024 Open-Ortho\n        \n        Permission is hereby granted, free of charge, to any person obtaining a copy\n        of this software and associated documentation files (the \"Software\"), to deal\n        in the Software without restriction, including without limitation the rights\n        to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n        copies of the Software, and to permit persons to whom the Software is\n        furnished to do so, subject to the following conditions:\n        \n        The above copyright notice and this permission notice shall be included in all\n        copies or substantial portions of the Software.\n        \n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n        FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n        AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n        LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n        OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n        SOFTWARE.\n        \n        ## Third-Party Content and Licenses\n        \n        This project, \"Open-Ortho,\" includes data and codes that are sourced from external standards and organizations, including SNOMED CT, DICOM (DCM), HL7, and content from doctorseyes GmbH. The use of each of these data sets and codes is governed by their respective licenses and not by the MIT license of this project. \n        \n        ### External Licenses\n        \n        - **SNOMED CT**: SNOMED CT content is used under a license that can be reviewed at [SNOMED International](https://www.snomed.org/snomed-ct/get-snomed-ct).\n        - **DICOM (DCM)**: DICOM standards are published by the Medical Imaging & Technology Alliance (MITA) and are available under specific terms that can be found on the [NEMA website](https://www.nema.org/).\n        - **HL7**: HL7 standards are used under terms available at [HL7 International](https://www.hl7.org/).\n        - **doctorseyes GmbH**: Content provided by [doctorseyes GmbH](https://dentaleyepad.de/en/dentaleyepad-image-types/) is used under their terms and conditions, details of which can be found on their official website.\n        \n        ### Notice\n        \n        The MIT License applies only to the code and data developed as part of the Open-Ortho project itself. For the use of third-party content included in this project, please consult the corresponding licenses as listed above. Users are responsible for ensuring that they comply with all applicable licenses and terms of use when utilizing this software and its associated content.\n        ",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": null,
  "repository": null,
  "repository_source": null,
  "download": null,
  "download_source": null,
  "pub_date": 1772208243,
  "project_urls": {},
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}