{
  "name": "olmoearth-pretrain",
  "version": "0.1.0",
  "summary": "A library for developing earth system foundation models",
  "license": "OlmoEarth Artifact License\n        \n        By exercising the rights granted to you under this OlmoEarth Artifact License\n        (\"Agreement\"), you accept and agree to its terms and conditions and enter into this\n        Agreement with The Allen Institute for Artificial Intelligence (\"Ai2\"). All references\n        to \"you\" herein means both an individual and legal entity that an individual is acting\n        on behalf of.\n        \n        Subject to your compliance with this Agreement, Ai2 grants you permission, free of\n        charge, to use the machine learning artifacts, materials, and documentation provided by\n        Ai2 under this Agreement as follows (collectively, \"Artifacts\"):\n        \n        - Model weights, including architecture and parameters (\"Model\");\n        - Associated dataset or collection of data in connection with the Model (\"Dataset\"); and/or\n        - Associated software to process and run the Dataset and Model, including code in\n          source or binary form for training, inference, and evaluation (\"Code\").\n        \n        1. Use Rights\n        \n        Subject to the terms in Section 2 and 3 below, you may:\n        \n        (a) Use, reproduce, modify, display and distribute the Artifacts, in whole or in part;\n        (b) Create any other machine learning models, datasets, and derivative works that are\n            derived from or based on the Artifacts, including by (i) transfer of patterns of\n            the weights, parameters, operations, or outputs of the Model, (ii) generating\n            outputs of the Model to produce synthetic data, and (iii) using Code to prepare any\n            work of authorship (collectively, \"Derivatives\"); and\n        (c) Publish and share Derivatives.\n        \n        2. Use Restrictions\n        \n        You will not (and will not encourage, permit, or facilitate any others to) use any\n        portion of the Artifacts or Derivatives for the following purposes:\n        \n        (a) Any military and defense-related applications and use cases, including without\n            limitation, for weapons development, military operations, intelligence gathering,\n            or human surveillance and policing activities.\n        (b) Any extractive activities, operations and use cases involving the removal of raw\n            materials from the earth, including without limitation, to plan or facilitate the\n            extraction of oil, natural gas and minerals through activities such as drilling,\n            mining, and deforestation.\n        \n        3. Distribution\n        \n        In any distribution of the Artifacts or Derivatives:\n        \n        (a) You will cite Ai2 as the source of the Artifacts in any distribution of Artifacts\n            or Derivatives.\n        (b) If you distribute any portion of the Artifacts, you will either link to or provide\n            a copy of this Agreement to all third party recipients.\n        (c) If you distribute any Derivatives, you may add your own intellectual property\n            notices and apply other licenses and terms of use, provided that you include and\n            require the use restrictions in Section 2 in all downstream distribution unless Ai2\n            provides written approval otherwise.\n        \n        4. Termination\n        \n        This Agreement will automatically terminate with immediate effect and without notice to\n        you in the following circumstances:\n        \n        (a) Your breach of the use restrictions in Section 2 and any other terms and conditions\n            herein; or\n        (b) If you file, maintain, or voluntarily participate in a lawsuit against any person\n            or entity asserting that the Artifacts or any portion thereof directly or\n            indirectly infringe any patent, except where a lawsuit is filed in response to a\n            corresponding lawsuit first brought against you.\n        \n        For the avoidance of doubt, Ai2 may also offer the Artifacts under separate terms and\n        conditions or stop distributing the Artifacts at any time; however, doing so will not\n        terminate this Agreement. You may continue to use the Artifacts under this Agreement\n        unless it is terminated in accordance with the circumstances expressly stated herein.\n        \n        5. Rights Not Covered\n        \n        This Agreement does not cover any patents or trademarks associated with the Artifacts,\n        including with respect to any individual items of information and materials that are\n        included or incorporated within a Dataset (\"Contents\"). Such Contents may be factual\n        data or independent works such as text, images, audio, and audio visual material.\n        Contents may be subject to other rights, including copyright, patent, data protection,\n        privacy, or personality rights, and this Agreement does not cover such rights. The use\n        rights in Section 1 expressly exclude any and all other rights that may apply to the\n        Contents of a Dataset.\n        \n        6. Disclaimer and Limitation of Liability\n        \n        (a) THE ARTIFACTS ARE PROVIDED \"AS IS\", \"AS AVAILABLE\", AND \"WITH ALL FAULTS\", WITHOUT\n            ANY EXPRESS OR IMPLIED WARRANTY OF ANY KIND, INCLUDING WITHOUT LIMITATION, IMPLIED\n            WARRANTIES OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT, FITNESS FOR A PARTICULAR\n            PURPOSE, ABSENCE OF LATENT OR OTHER DEFECTS, ACCURACY, OR THE PRESENCE OR ABSENCE\n            OF ERRORS, WHETHER OR NOT KNOWN OR DISCOVERABLE. AI2 MAKES NO REPRESENTATIONS OR\n            WARRANTIES AS TO THE RELIABILITY, COMPLETENESS, QUALITY, PERFORMANCE,\n            FUNCTIONALITY, OR UTILITY OF ANY ARTIFACTS. ANY USE OF THE ARTIFACTS IS AT YOUR\n            SOLE RISK AND DISCRETION. YOU ARE SOLELY RESPONSIBLE FOR (1) CLEARING ANY THIRD\n            PARTY RIGHTS THAT MAY APPLY TO OR BE EMBODIED IN ANY ARTIFACTS, INCLUDING ANY\n            CONTENTS IN A DATASET; (2) OBTAINING ANY NECESSARY RIGHTS, LICENSES, CONSENTS, OR\n            PERMISSIONS REQUIRED FOR YOUR USE OF THE ARTIFACTS; AND (3) PERFORMING ANY DUE\n            DILIGENCE ON THE ARTIFACTS TO VERIFY SUITABILITY FOR YOUR INTENDED USE.\n        \n        (b) TO THE MAXIMUM EXTENT PERMITTED UNDER APPLICABLE LAWS, IN NO EVENT WILL AI2 BE\n            LIABLE FOR ANY CLAIM, DAMAGES, LOSSES, OR OTHER LIABILITY OF ANY KIND WHATSOEVER,\n            WHETHER IN AN ACTION OF CONTRACT, TORT, OR OTHERWISE, ARISING FROM OR IN CONNECTION\n            WITH THE ARTIFACTS OR YOUR USE THEREOF.\n        \n        (c) The disclaimers and limitations of liability set forth above will be interpreted in\n            a manner that, to the greatest extent possible, constitute an absolute disclaimer\n            and waiver of all liability.\n        \n        7. Other Agreements\n        \n        If you have entered into a separate written agreement with Ai2 regarding your use of\n        the specific Artifacts that are subject to this Agreement (\"Other Agreement\"), the\n        terms of such Other Agreement will supplement the terms herein. To the extent of any\n        conflict between the terms of the Other Agreement and this Agreement, the Other\n        Agreement will take precedence.\n        \n        8. Miscellaneous\n        \n        If any term or provision of this Agreement is deemed invalid or unenforceable, it will\n        automatically be reformed to the minimum extent necessary to make it enforceable. To\n        the extent it cannot be reformed, it will be severed from this Agreement, and the\n        remaining terms and conditions will remain in full force and effect. Any delay or\n        failure by Ai2 to take any action or enforce any breach of this Agreement will not be\n        deemed as a waiver or consent by Ai2. No term or provision of this Agreement will be\n        waived by Ai2 unless expressly agreed in writing. Nothing in this Agreement constitutes\n        as a limitation of any privileges, immunities, and rights that apply to you or Ai2\n        under applicable laws, including from the legal processes of any jurisdiction or\n        authority.\n        ",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": "OlmoEarth Team",
  "repository": null,
  "repository_source": null,
  "download": null,
  "download_source": null,
  "pub_date": 1770401199,
  "project_urls": {},
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}