{
  "name": "thalren-vale-simulation",
  "version": "1.1.0",
  "summary": "Emergent AI Civilization Simulator",
  "license": "(c) 2026 (KriaetvAspie / AspieTheBard)\r\n        \r\n        Polyform Noncommercial License 1.0.0\r\n        \r\n        <https://polyformproject.org/licenses/noncommercial/1.0.0>\r\n        \r\n        Acceptance\r\n        \r\n        In order to get any license under these terms, you must agree to them as\r\n        both strict obligations and conditions to all your licenses.\r\n        \r\n        Copyright License\r\n        \r\n        The licensor grants you a copyright license for the software to do\r\n        everything you might do with the software that would otherwise infringe\r\n        the licensor's copyright in it for any permitted purpose. However, you\r\n        may only distribute the software according to Distribution License and\r\n        make changes or new works based on the software according to Changes and\r\n        New Works License.\r\n        \r\n        Distribution License\r\n        \r\n        The licensor grants you an additional copyright license to distribute\r\n        copies of the software. Your license to distribute covers distributing\r\n        the software with changes and new works permitted by Changes and New\r\n        Works License.\r\n        \r\n        Notices\r\n        \r\n        You must ensure that anyone who gets a copy of any part of the software\r\n        from you also gets a copy of these terms or the URL for them above, as\r\n        well as copies of any plain-text lines beginning with Required Notice:\r\n        that the licensor provided with the software. For example:\r\n        \r\n            Required Notice: Copyright (KriaetvAspie / AspieTheBard) (https://github.com/Kriaetour)\r\n        \r\n        Changes and New Works License\r\n        \r\n        The licensor grants you an additional copyright license to make changes\r\n        and new works based on the software for any permitted purpose.\r\n        \r\n        Patent License\r\n        \r\n        The licensor grants you a patent license for the software that covers\r\n        patent claims the licensor can license, or will be able to license, that\r\n        you would infringe by using the software.\r\n        \r\n        Noncommercial Purposes\r\n        \r\n        Any noncommercial purpose is a permitted purpose.\r\n        \r\n        Personal Uses\r\n        \r\n        Personal use for research, experiment, and testing for the benefit of\r\n        public knowledge, personal study, private entertainment, hobby projects,\r\n        amateur pursuits, or religious observance, without any anticipated\r\n        commercial application, is use for a permitted purpose.\r\n        \r\n        Noncommercial Organizations\r\n        \r\n        Use by any charitable organization, educational institution, public\r\n        research organization, public safety or health organization,\r\n        environmental protection organization, or government institution is use\r\n        for a permitted purpose regardless of the source of funding or\r\n        obligations resulting from the funding.\r\n        \r\n        Fair Use\r\n        \r\n        You may have \"fair use\" rights for the software under the law. These\r\n        terms do not limit them.\r\n        \r\n        No Other Rights\r\n        \r\n        These terms do not allow you to sublicense or transfer any of your\r\n        licenses to anyone else, or prevent the licensor from granting licenses\r\n        to anyone else. These terms do not imply any other licenses.\r\n        \r\n        Patent Defense\r\n        \r\n        If you make any written claim that the software infringes or contributes\r\n        to infringement of any patent, your patent license for the software\r\n        granted under these terms ends immediately. If your employer makes such a\r\n        claim, your patent license ends immediately for work on behalf of your\r\n        employer.\r\n        \r\n        Violations\r\n        \r\n        The first time you are notified in writing that you have violated any of\r\n        these terms, and you come into compliance within 30 days after your\r\n        notification, your violation is excused and your licenses continue. If\r\n        you do not come into compliance within 30 days after your notification,\r\n        your licenses end immediately and permanently.\r\n        \r\n        No Liability\r\n        \r\n        As far as the law allows, the software comes as is, without any warranty\r\n        or condition, and the licensor will not be liable to you for any damages\r\n        arising out of these terms or the use or nature of the software, under\r\n        any kind of legal claim.\r\n        \r\n        Definitions\r\n        \r\n        The licensor is the individual or entity offering these terms, and the\r\n        software is the software the licensor makes available under these terms.\r\n        \r\n        You refers to the individual or entity agreeing to these terms.\r\n        \r\n        Your company is any legal entity, sole proprietorship, or other kind of\r\n        organization that you work for, plus all organizations that have control\r\n        over, are under the control of, or are under common control with that\r\n        organization. Control means ownership of substantially all the assets of\r\n        an entity, or the power to direct its management and legal affairs.\r\n        \r\n        Your licenses are all the licenses granted to you for the software under\r\n        these terms.\r\n        \r\n        Use means anything you do with the software requiring one of your\r\n        licenses.\r\n        \r\n        Trademark\r\n        \r\n        Use of any trademark or logo of the licensor is not licensed under these\r\n        terms. However, fair use of licensor trademarks in distribution and\r\n        making clear that the licensor does not endorse such distribution is\r\n        permitted.\r\n        ",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": null,
  "repository": null,
  "repository_source": null,
  "download": null,
  "download_source": null,
  "pub_date": 1772108818,
  "project_urls": {},
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}