{
  "name": "axialfans",
  "version": "2.0.0",
  "summary": "Spanwise-resolved analytical solver for multistage axial turbomachinery.",
  "license": "MIT License\r\n        \r\n        Copyright (c) 2026 Sean H. Wang\r\n        \r\n        Permission is hereby granted, free of charge, to any person obtaining a copy\r\n        of this software and associated documentation files (the \"Software\"), to deal\r\n        in the Software without restriction, including without limitation the rights\r\n        to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\r\n        copies of the Software, subject to the following conditions:\r\n        \r\n        1. ATTRIBUTION. The above copyright notice, this permission notice, and this\r\n           attribution clause shall be included in all copies or substantial portions\r\n           of the Software. You shall not claim authorship of the Software or any\r\n           derivative work thereof, nor represent the Software or any derivative work\r\n           as your original creation.\r\n        \r\n        2. NO MISREPRESENTATION. You shall not misrepresent the origin of the Software.\r\n           Any modification to the Software must be clearly identified as such and must\r\n           not be presented as the original work of Sean H. Wang.\r\n        \r\n        3. NO WARRANTY; LIMITATION OF LIABILITY. THE SOFTWARE IS PROVIDED \"AS IS\",\r\n           WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED\r\n           TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND\r\n           NONINFRINGEMENT. THIS SOFTWARE IS A PRELIMINARY DESIGN AID INTENDED FOR\r\n           RESEARCH AND EXPLORATORY PURPOSES ONLY. IT IS NOT VALIDATED FOR USE IN\r\n           SAFETY-CRITICAL APPLICATIONS, CERTIFIED ENGINEERING DESIGN, OR ANY\r\n           APPLICATION WHERE FAILURE COULD RESULT IN PERSONAL INJURY, DEATH, OR\r\n           PROPERTY DAMAGE. THE USER ASSUMES ALL RESPONSIBILITY FOR VERIFYING OUTPUTS\r\n           INDEPENDENTLY BEFORE ANY ENGINEERING APPLICATION. IN NO EVENT SHALL THE\r\n           AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES, OR OTHER\r\n           LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT, OR OTHERWISE, ARISING\r\n           FROM, OUT OF, OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\r\n           DEALINGS IN THE SOFTWARE, INCLUDING ANY PHYSICAL, MECHANICAL, OR SAFETY\r\n           CONSEQUENCES ARISING FROM RELIANCE ON SOLVER OUTPUTS.",
  "license_expression": null,
  "home_page": "https://github.com/sean-h-wang/axialfans",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "Sean H. Wang",
  "repository": "https://github.com/sean-h-wang/axialfans",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1772114407,
  "project_urls": {
    "Documentation": "https://github.com/sean-h-wang/axialfans#readme",
    "Homepage": "https://github.com/sean-h-wang/axialfans"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": true
}