{
  "name": "oneprompt",
  "version": "0.1.2",
  "summary": "AI agents for data querying, Python analysis, and chart generation.",
  "license": "# PolyForm Shield License 1.0.0\n        \n        <https://polyformproject.org/licenses/shield/1.0.0>\n        \n        ## Acceptance\n        \n        In order to get any license under these terms, you must agree\n        to them as both strict obligations and conditions to all\n        your licenses.\n        \n        ## Copyright License\n        \n        The licensor grants you a copyright license for the\n        software to do everything you might do with the software\n        that would otherwise infringe the licensor's copyright\n        in it for any permitted purpose.  However, you may\n        only distribute the software according to [Distribution\n        License](#distribution-license) and make changes or new works\n        based on the software according to [Changes and New Works\n        License](#changes-and-new-works-license).\n        \n        ## Distribution License\n        \n        The licensor grants you an additional copyright license\n        to distribute copies of the software.  Your license\n        to distribute covers distributing the software with\n        changes and new works permitted by [Changes and New Works\n        License](#changes-and-new-works-license).\n        \n        ## Notices\n        \n        You must ensure that anyone who gets a copy of any part of\n        the software from you also gets a copy of these terms or the\n        URL for them above, as well as copies of any plain-text lines\n        beginning with `Required Notice:` that the licensor provided\n        with the software.  For example:\n        \n        > Required Notice: Copyright Yoyodyne, Inc. (http://example.com)\n        \n        ## Changes and New Works License\n        \n        The licensor grants you an additional copyright license to\n        make changes and new works based on the software for any\n        permitted purpose.\n        \n        ## Patent License\n        \n        The licensor grants you a patent license for the software that\n        covers patent claims the licensor can license, or becomes able\n        to license, that you would infringe by using the software.\n        \n        ## Noncompete\n        \n        Any purpose is a permitted purpose, except for providing any\n        product that competes with the software or any product the\n        licensor or any of its affiliates provides using the software.\n        \n        ## Competition\n        \n        Goods and services compete even when they provide functionality\n        through different kinds of interfaces or for different technical\n        platforms.  Applications can compete with services, libraries\n        with plugins, frameworks with development tools, and so on,\n        even if they're written in different programming languages\n        or for different computer architectures.  Goods and services\n        compete even when provided free of charge.  If you market a\n        product as a practical substitute for the software or another\n        product, it definitely competes.\n        \n        ## New Products\n        \n        If you are using the software to provide a product that does\n        not compete, but the licensor or any of its affiliates brings\n        your product into competition by providing a new version of\n        the software or another product using the software, you may\n        continue using versions of the software available under these\n        terms beforehand to provide your competing product, but not\n        any later versions.\n        \n        ## Discontinued Products\n        \n        You may begin using the software to compete with a product\n        or service that the licensor or any of its affiliates has\n        stopped providing, unless the licensor includes a plain-text\n        line beginning with `Licensor Line of Business:` with the\n        software that mentions that line of business.  For example:\n        \n        > Licensor Line of Business: YoyodyneCMS Content Management\n        System (http://example.com/cms)\n        \n        ## Sales of Business\n        \n        If the licensor or any of its affiliates sells a line of\n        business developing the software or using the software\n        to provide a product, the buyer can also enforce\n        [Noncompete](#noncompete) for that product.\n        \n        ## Fair Use\n        \n        You may have \"fair use\" rights for the software under the\n        law. These terms do not limit them.\n        \n        ## No Other Rights\n        \n        These terms do not allow you to sublicense or transfer any of\n        your licenses to anyone else, or prevent the licensor from\n        granting licenses to anyone else.  These terms do not imply\n        any other licenses.\n        \n        ## Patent Defense\n        \n        If you make any written claim that the software infringes or\n        contributes to infringement of any patent, your patent license\n        for the software granted under these terms ends immediately. If\n        your company makes such a claim, your patent license ends\n        immediately for work on behalf of your company.\n        \n        ## Violations\n        \n        The first time you are notified in writing that you have\n        violated any of these terms, or done anything with the software\n        not covered by your licenses, your licenses can nonetheless\n        continue if you come into full compliance with these terms,\n        and take practical steps to correct past violations, within\n        32 days of receiving notice.  Otherwise, all your licenses\n        end immediately.\n        \n        ## No Liability\n        \n        ***As far as the law allows, the software comes as is, without\n        any warranty or condition, and the licensor will not be liable\n        to you for any damages arising out of these terms or the use\n        or nature of the software, under any kind of legal claim.***\n        \n        ## Definitions\n        \n        The **licensor** is the individual or entity offering these\n        terms, and the **software** is the software the licensor makes\n        available under these terms.\n        \n        A **product** can be a good or service, or a combination\n        of them.\n        \n        **You** refers to the individual or entity agreeing to these\n        terms.\n        \n        **Your company** is any legal entity, sole proprietorship,\n        or other kind of organization that you work for, plus all\n        its affiliates.\n        \n        **Affiliates** means the other organizations than an\n        organization has control over, is under the control of, or is\n        under common control with.\n        \n        **Control** means ownership of substantially all the assets of\n        an entity, or the power to direct its management and policies\n        by vote, contract, or otherwise.  Control can be direct or\n        indirect.\n        \n        **Your licenses** are all the licenses granted to you for the\n        software under these terms.\n        \n        **Use** means anything you do with the software requiring one\n        of your licenses.",
  "license_expression": null,
  "home_page": "https://github.com/oneprompteu/oneprompt",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "oneprompt",
  "repository": "https://github.com/oneprompteu/oneprompt",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1771593309,
  "project_urls": {
    "Documentation": "https://github.com/oneprompteu/oneprompt#readme",
    "Homepage": "https://github.com/oneprompteu/oneprompt",
    "Issues": "https://github.com/oneprompteu/oneprompt/issues",
    "Repository": "https://github.com/oneprompteu/oneprompt"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}