{
  "name": "nxtomomill",
  "version": "2.0.4",
  "summary": "applications and library to convert raw format to NXtomo format",
  "license": "\n        The nxtomomill library goal is to provide a python interface to read ESRF tomography dataset.\n        \n        nxtomomill is distributed under the MIT license.\n        \n        The MIT license follows:\n        \n        Copyright (c) European Synchrotron Radiation Facility (ESRF)\n        \n        Permission is hereby granted, free of charge, to any person obtaining a copy of\n        this software and associated documentation files (the \"Software\"), to deal in\n        the Software without restriction, including without limitation the rights to\n        use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of\n        the Software, and to permit persons to whom the Software is furnished to do so,\n        subject to the following conditions:\n        \n        The above copyright notice and this permission notice shall be included in all\n        copies or substantial portions of the Software.\n        \n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS\n        FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR\n        COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER\n        IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\n        CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n        ",
  "license_expression": null,
  "home_page": "https://gitlab.esrf.fr/tomotools/nxtomomill",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://gitlab.esrf.fr/tomotools/nxtomomill",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1769438030,
  "project_urls": {
    "Documentation": "https://tomotools.gitlab-pages.esrf.fr/nxtomomill/",
    "Homepage": "https://gitlab.esrf.fr/tomotools/nxtomomill",
    "Changelog": "https://gitlab.esrf.fr/tomotools/nxtomomill/-/blob/master/CHANGELOG.md",
    "Repository": "https://gitlab.esrf.fr/tomotools/nxtomomill"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}