{
  "name": "brainstem",
  "version": "2.12.1",
  "summary": "Acroname BrainStem Software Control Package",
  "license": "# Brainstem SDK Software Package License Agreement:\n        \n        PLEASE READ THIS SOFTWARE LICENSE AGREEMENT CAREFULLY BEFORE DOWNLOADING OR USING THE SOFTWARE.\n        \n        BY USING THE SOFTWARE, OR USING EQUIPMENT THAT CONTAINS THE SOFTWARE, YOU ARE CONSENTING TO BE BOUND\n        BY THIS AGREEMENT. IF YOU DO NOT AGREE TO ALL OF THE TERMS OF THIS AGREEMENT, DO NOT USE THE SOFTWARE\n        AND DESTROY ALL COPIES IN YOUR POSSESSION.\n        \n        ## HUBTOOL, STEMTOOL, CONTROLROOM, BRAINSTEM2 LIBRARY SHARED OBJECT, STATIC ARCHIVE, AND LIBRARY HEADERS\n        SOFTWARE LICENSE AGREEMENT Copyright (c) 1994-2024 Acroname Inc.\n        \n        License Grant: Acroname Inc. (\"Acroname\") and its authorized agents grant to customer (\"Customer\") a\n        revocable, nonexclusive, and nontransferable license to use the BrainStem2 shared object (.dylib,\n        .framework, .so, .dll, etc) static archive (.a), and associated library header files (\"Software\") in\n        object code form solely for Customers internal business purposes. Acroname may modify the Software\n        for any reason, without notice and without liability to Customer to comply with applicable law or to\n        otherwise protect Acroname or its affiliates, business partners, licensors, and/or customers from\n        potential legal liability. The Software is licensed to Customer, not sold. Except for the limited\n        license granted above, Acroname and its licensors retain all right, title and interest in the Software\n        and its documentation, including copyrights, patents, trademarks and trade secret rights. Customer\n        agrees that aspects of the Software, including the specific design and structure of individual\n        programs, constitute trade secrets and/or copyrighted material of Acroname.\n        \n        RESTRICTIONS:\n        \n        CUSTOMER SHALL NOT: MODIFY THE SOFTWARE; REVERSE ENGINEER OR REVERSE COMPILE OR REVERSE ASSEMBLE ALL\n        OR ANY PORTION OF THE SOFTWARE, OR OTHERWISE ATTEMPT TO DERIVE THE TRADE SECRETS EMBODIED IN THE\n        SOFTWARE.\n        Customer agrees that redistributions of this Software must retain the above copyright notice, this\n        list of conditions and the following disclaimer.\n        Customer may not copy [or distribute] the Software except to the extent that copying is necessary to\n        use the Software for purposes set forth herein.\n        Customer may not assign, sublicense, rent, timeshare, loan, lease, [or otherwise provide or transfer]\n        the Software, or directly or indirectly permit any third party to use or copy the Software without\n        written permission from Acroname.\n        Limited Warranty; Disclaimer: THE SOFTWARE IS PROVIDED ON AN AS AVAILABLE,AS IS BASIS WITH ALL\n        FAULTS, AND WITHOUT WARRANTY OF ANY KIND. EXCEPT AS SPECIFIED IN THIS AGREEMENT, ALL EXPRESS OR\n        IMPLIED CONDITIONS, REPRESENTATIONS, AND WARRANTIES INCLUDING, WITHOUT LIMITATION, ANY IMPLIED\n        WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NONINFRINGEMENT OR ARISING FROM A\n        COURSE OF DEALING, USAGE, OR TRADE PRACTICE, WITH RESPECT TO THE SOFTWARE ARE HEREBY EXCLUDED TO THE\n        EXTENT ALLOWED BY APPLICABLE LAW. ACRONAME DOES NOT WARRANT THAT THE SOFTWARE WILL MEET CUSTOMERS\n        REQUIREMENTS, OR THAT THE SOFTWARE IS COMPATIBLE WITH ANY PARTICULAR HARDWARE OR SOFTWARE, OR THAT THE\n        SOFTWARE WILL CONTAIN ANY PARTICULAR FEATURES OR FUNCTIONALITY, OR THAT THE OPERATION OF THE SOFTWARE\n        WILL BE UNINTERRUPTED OR ERROR-FREE, OR THAT DEFECTS IN THE SOFTWARE WILL BE CORRECTED. THIS SOFTWARE\n        IS NOT INTENDED FOR USE IN LIFE SUPPORT SYSTEMS. Acroname shall not be liable for failures caused by\n        third party components and/or third party hardware that is integrated with the Software (including\n        Customers own systems), misuse of the Software, or Customers negligence or willful misconduct. In no\n        event shall Acroname's [or its suppliers'] liability to Customer, whether in contract, tort (including\n        negligence), or otherwise, exceed the price paid by Customer. Some jurisdictions may not allow\n        limitation or exclusion of liability for consequential or incidental damages.\n        \n        Indemnities: Acroname will indemnify, defend, and hold Customer harmless from any claim, demand,\n        action, proceeding, investigation, judgment, loss, damage, fine, liability, cost, or expense,\n        including attorneys fees, experts fees, and court costs, arising out of a claim by a third-party\n        that Customers use of the Software in conformance with the terms of this Agreement infringes a\n        United States patent, copyright, or trade secret of that third party. The foregoing indemnification\n        obligation of Acroname is contingent upon Customers promptly notifying Acroname in writing of such\n        claim, permitting Acroname sole authority to control the defense or settlement of such claim, and\n        providing Acroname reasonable assistance in connection therewith. If a claim of infringement under\n        this Section occurs, or if Acroname determines a claim is likely to occur, Acroname will have the\n        right, in its sole discretion, to either: (i) procure for Customer the right or license to continue\n        to use the Software free of the infringement claim; or (ii) modify the Software to make it\n        non-infringing, without loss of material functionality. If either of these remedies is not reasonably\n        available to Acroname, Acroname may, in its sole discretion, immediately terminate this Agreement.\n        Notwithstanding the foregoing, Acroname shall have no obligation with respect to any claim of\n        infringement that is based upon or arises out of: (i) the use or combination of the Software with any\n        third party hardware, products, data or other materials, including Customers own systems and data;\n        (ii) modification or alteration of the Software by anyone other than Acroname; (iii) Customers use\n        of the Software in excess of the rights granted in this Agreement; (iv) any third party components;\n        (v) specifications provided by Customer, (vi) a business method or process that is inherent to\n        Customers business, or (vii) gross negligence, willful misconduct, or violation of law by Customer\n        (collectively, the Excluded Claims). The provisions of this Section state the sole and exclusive\n        obligations and liability of Acroname and its Acronames suppliers for any claim of intellectual\n        property infringement arising out of or relating to the Software and/or this Agreement and are in\n        lieu of any implied warranties of non-infringement, all of which are expressly disclaimed. Customer\n        will indemnify, defend, and hold Acroname harmless from any claim, demand, action, proceeding,\n        investigation, judgment, loss, damage, fine, liability, cost, or expense, including attorneys fees,\n        experts fees, and court costs, from a third-party claim arising out of an Excluded Claim. Customers\n        indemnification obligation is contingent upon Acroname promptly notifying Customer in writing of such\n        claim, permitting Customer sole authority to control the defense or settlement of such claim, and\n        providing Customer reasonable assistance in connection therewith.\n        \n        Limitation of Liability: TO THE MAXIMUM EXTENT PERMITTED BY LAW, IN NO EVENT SHALL ACRONAME OR ITS\n        SUPPLIERS AND VENDORS BE LIABLE TO CUSTOMER OR ANY THIRD PARTY FOR ANY SPECIAL, INCIDENTAL,\n        CONSEQUENTIAL, PUNITIVE, EXEMPLARY, SPECIAL, OR INDIRECT DAMAGES, WHICH SHALL INCLUDE, WITHOUT\n        LIMITATION, DAMAGES FOR PERSONAL INJURY, LOST PROFITS, LOST DATA AND BUSINESS INTERRUPTION, ARISING\n        OUT OF THE USE OR INABILITY TO USE THE SOFTWARE, EVEN IF ACRONAME HAS BEEN ADVISED OF THE POSSIBILITY\n        OF SUCH DAMAGES. IN ANY CASE, THE ENTIRE LIABILITY OF ACRONAME AND ITS SUPPLIERS AND VENDORS UNDER\n        THIS AGREEMENT FOR ALL DAMAGES, LOSSES, AND CAUSES OF ACTION (WHETHER IN CONTRACT, TORT (INCLUDING\n        NEGLIGENCE), OR OTHERWISE) SHALL BE LIMITED TO THE GREATER OF $500.00 AND FEES PAID BY CUSTOMER, IF\n        ANY, DURING THE TWELVE MONTHS IMMEDIATELY PRECEDING THE FIRST EVENT GIVING RISE TO LIABILITY.\n        \n        Term and Termination: This Agreement is effective until terminated. Customer may terminate this\n        Agreement at any time by destroying all copies of the Software including any documentation. This\n        Agreement will terminate immediately without notice from Acroname if Customer fails to comply with\n        any provision of this Agreement. Upon termination, Customer must destroy all copies of the Software\n        including any documentation.\n        \n        Export: This Software, including technical data, is subject to U.S. export control laws, including\n        the U.S. Export Administration Act and its associated regulations, and may be subject to export or\n        import regulations in other countries. Customer agrees to comply strictly with all such regulations\n        and acknowledges that it has the responsibility to obtain licenses to export, re-export, or import\n        Software.\n        \n        Governing Law: This Agreement shall be governed by and construed in accordance with the laws of the\n        State of Colorado, United States of America, as if performed wholly within the state and without\n        giving effect to the principles of conflict of law.\n        \n        Assignment: Customer may not novate, assign, or transfer in whole or in part any of its rights or\n        obligations under this agreement, whether by operation or law or otherwise, without the prior written\n        consent of Acroname. A change in control of Customer constitutes an assignment of this agreement.\n        Acroname may at any time, by notice to Customer, novate, assign, or transfer in whole or in part its\n        rights and obligations under this agreement to any third party and to the extent necessary, Customer\n        hereby consents to such novation, assignment, or transfer.\n        \n        General: If any portion hereof is found to be void or unenforceable, the remaining provisions of this\n        Agreement shall remain in full force and effect. This Agreement constitutes the entire license\n        between the parties with respect to the use of the Software.\n        \n        ## BRAINSTEM2 DIRECT DEPENDENCY LICENSE NOTIFICATION\n        \n        ### LIB USB\n        \n        This binary distribution uses libUSB (https://libusb.info). LibUSB is licensed under GNU Lesser\n        General Public License (LGPL) v2.1. Acroname will provide, upon request (support@acroname.com),\n        object code sufficient to relink the Acroname provided executables and libraries with an updated\n        interface-compatible libUSB library.\n        \n        Full license text is available: https://www.gnu.org/licenses/lgpl-2.1.html\n        \n        ### QT\n        \n        This binary distribution uses Qt (https://qt.io). Qt is licensed under GNU Lesser General Public\n        License (LGPL) v3.0. Acroname will provide, upon request to support@acroname.com, object code\n        sufficient to relink the Acroname provided executables and libraries with an updated interface\n        compatible Qt library.\n        \n        Full license text for Qt is available: https://www.gnu.org/licenses/lgpl-3.0.en.html\n        \n        ## HUBTOOL ICON CREDITS\n        Settings icons created by Tomas Knop - Flaticon\n        Expand icons created by Google - Flaticon\n        Filter icons created by Kiranshastry - Flaticon\n        Funnel icons created by Freepik - Flaticon\n        \n        ACRONAME EXAMPLES, DOCUMENTATION AND SOURCE CODE DISTRIBUTIONS\n        \n        Copyright (c) 1994-2024, Acroname Inc. All rights reserved.\n        \n        Redistribution and use in source and binary forms, with or without modification, are permitted\n        provided that the following conditions are met:\n        \n        Redistributions of source code must retain the above copyright notice, this list of conditions and\n        the following disclaimer.\n        Redistributions in binary form must reproduce the above copyright notice, this list of conditions and\n        the following disclaimer in the documentation and/or other materials provided with the distribution.\n        THIS SOFTWARE IS NOT INTENDED FOR USE IN LIFE-SUPPORT SYSTEMS.\n        \n        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR\n        IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\n        FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR\n        CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n        DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n        DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n        CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE\n        USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n        \n        The views and conclusions contained in the software and documentation are those of the authors and\n        should not be interpreted as representing official policies, either expressed or implied, of Acroname\n        Inc.\n        \n        Acroname Inc.\n        ",
  "license_expression": null,
  "home_page": "http://www.acroname.com",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "Acroname Inc.",
  "repository": "http://www.acroname.com",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1770849163,
  "project_urls": {
    "Homepage": "http://www.acroname.com"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}