{
  "name": "epochly",
  "version": "0.3.58",
  "summary": "Epochly - Transparent performance optimization for Python applications",
  "license": "EPOCHLY SOFTWARE LICENSE AGREEMENT (ESLA)\n        \n        Version 2026.01.31\n        Effective Date: January 31, 2026\n        \n        Copyright (c) 2025-2026 Epochly Incorporated. All Rights Reserved.\n        \n        IMPORTANT - READ CAREFULLY: This Epochly Software License Agreement (\"Agreement\"\n        or \"ESLA\") is a legal agreement between you (either an individual or a single\n        entity, \"Licensee\" or \"you\") and the Epochly Incorporated (\"Licensor,\"\n        \"Epochly,\" \"we,\" or \"us\") for the Epochly software, including all associated\n        documentation, updates, and components (collectively, the \"Software\").\n        \n        BY INSTALLING, COPYING, OR OTHERWISE USING THE SOFTWARE, YOU AGREE TO BE BOUND BY\n        THE TERMS OF THIS AGREEMENT. IF YOU DO NOT AGREE, DO NOT INSTALL OR USE THE\n        SOFTWARE.\n        \n        ===============================================================================\n        SECTION 1: DEFINITIONS\n        ===============================================================================\n        \n        1.1  \"Application\" means any software program that imports, depends on, or\n             integrates with the Software as a library or dependency.\n        \n        1.2  \"Community Edition\" means the tier of the Software available at no cost,\n             subject to the functional limitations described in Section 2.1.\n        \n        1.3  \"Competitive Activity\" means developing, distributing, marketing, selling,\n             licensing, or offering as a service any software product or service whose\n             primary purpose is Python performance optimization, transparent acceleration,\n             JIT compilation for general Python workloads, automatic parallelization of\n             Python code, or GPU acceleration of Python workloads. For the avoidance of\n             doubt, Competitive Activity does not include: (a) general-purpose profiling\n             or debugging tools; (b) infrastructure orchestration tools; (c) hardware-\n             specific libraries or drivers; (d) web application frameworks; (e) machine\n             learning frameworks whose primary purpose is model training and inference;\n             or (f) academic research and publication.\n        \n        1.4  \"Device\" means a single physical or virtual machine, including but not\n             limited to bare-metal servers, virtual machines, cloud instances, and\n             containers. Each virtual machine, cloud instance, or container constitutes\n             a separate Device.\n        \n        1.5  \"Enhancement Levels\" means the progressive optimization tiers provided by\n             the Software: Level 0 (Performance Monitoring), Level 1 (Threading\n             Optimization), Level 2 (JIT Compilation), Level 3 (Multi-core\n             Parallelism), and Level 4 (GPU Acceleration).\n        \n        1.6  \"Enterprise Agreement\" means a separate written agreement between Licensee\n             and Licensor governing Enterprise Edition use, which supersedes this ESLA\n             where conflicting.\n        \n        1.7  \"Instance License\" means a per-Device subscription license for the\n             Professional tier of the Software.\n        \n        1.8  \"License Key\" means a cryptographically signed string in the format\n             \"Epochly-TYPE-FEATURES-EXPIRY-MAXCORES-SIGNATURE\" (where TYPE indicates\n             the license tier, e.g. \"PRO\" for Professional Edition, and FEATURES is a\n             tier identifier such as \"pro\" for all Professional features) that enables\n             specific Software features and tiers, validated using Ed25519 digital\n             signatures.\n        \n        1.9  \"Machine Fingerprint\" means a one-way SHA-256 cryptographic hash derived\n             from hardware and system attributes of a Device, used solely for license\n             binding and enforcement as described in Section 3.\n        \n        1.10 \"Professional Edition\" means the paid tier of the Software, also referred\n             to as the \"Instance\" tier, providing unrestricted Enhancement Levels and\n             resource access on a per-Device basis.\n        \n        1.11 \"Software\" means the Epochly Python performance optimization framework,\n             including all source code (.py files), compiled components (.so, .pyd,\n             .dylib files), documentation, configuration files, CLI tools, and any\n             updates or patches provided by Licensor.\n        \n        1.12 \"Trial License\" means a time-limited license granting full Professional\n             Edition capabilities for evaluation purposes, as described in Section 2.2.\n        \n        ===============================================================================\n        SECTION 2: LICENSE GRANT\n        ===============================================================================\n        \n        2.1  COMMUNITY EDITION\n        \n             Subject to the terms of this Agreement, Licensor grants Licensee a non-\n             exclusive, non-transferable, worldwide, royalty-free license to install and\n             use the Community Edition of the Software on any number of Devices, subject\n             to the following limitations:\n        \n             (a) CPU Core Limit: Maximum of four (4) CPU cores for Level 3 Multi-core\n                 Parallelism operations.\n             (b) GPU Restriction: Level 4 GPU Acceleration is not available.\n             (c) Memory Limit: Maximum of sixteen (16) gigabytes of managed memory.\n             (d) Enhancement Levels: Levels 0 through 3 only.\n             (e) Duration: Perpetual for the installed version, subject to compliance\n                 with this Agreement.\n             (f) Commercial Use: Permitted, except as restricted by Section 7\n                 (Anti-Competitive Use).\n             (g) Registration: No registration or account required.\n        \n        2.2  TRIAL LICENSE\n        \n             Licensor may offer a Trial License under the following terms:\n        \n             (a) Duration: Thirty (30) calendar days from activation.\n             (b) Capabilities: Full Professional Edition capabilities, including all\n                 Enhancement Levels (0-4), unlimited CPU cores, and GPU acceleration.\n             (c) Limitation: One (1) trial per email address (lifetime limit). One (1)\n                 trial per Device (lifetime limit).\n             (d) Activation: Requires email verification via magic link. The email\n                 address is cryptographically bound to the Device's Machine Fingerprint.\n             (e) Expiration: Upon expiry, the Software automatically degrades to\n                 Community Edition. No user action required. No data loss occurs.\n             (f) Restriction: Trial Licenses may not be used for Competitive Activity\n                 except as permitted in Section 7.\n             (g) Reminder Schedule: Licensor sends email reminders at 15, 7, and 1\n                 day(s) before expiration.\n        \n        2.3  PROFESSIONAL (INSTANCE) LICENSE\n        \n             Subject to a valid subscription and License Key, Licensor grants Licensee\n             a non-exclusive, non-transferable license to use the Professional Edition\n             on a single Device, subject to:\n        \n             (a) Device Binding: The License Key is cryptographically bound to a single\n                 Device via Machine Fingerprint. The license cannot be used on a\n                 different Device without deactivation and reactivation.\n             (b) Enhancement Levels: All Enhancement Levels (0-4), including GPU\n                 Acceleration.\n             (c) Resource Limits: Unlimited CPU cores and no memory restrictions.\n             (d) Subscription: Requires an active paid subscription at the current rate\n                 (monthly or annual billing). Current pricing is published at\n                 https://epochly.com/pricing and may be updated from time to time.\n             (e) Offline Grace Period: If the Device cannot connect to Licensor's\n                 license validation servers, the Software continues to operate at\n                 Professional tier for seven (7) calendar days. After the grace period,\n                 the Software degrades to Community Edition until connectivity is\n                 restored.\n             (f) Tiered Degradation: Loss of license validity results in graceful\n                 degradation to Community Edition. The Software never crashes, produces\n                 errors, or loses data due to license expiration or validation failure.\n             (g) Payment Processing: Payments are processed by Licensor's designated\n                 payment processor, acting as Merchant of Record. The payment\n                 processor's terms of service supplement this Agreement for payment-\n                 related matters. The current payment processor is identified at\n                 https://epochly.com/pricing.\n        \n        2.4  ENTERPRISE LICENSE\n        \n             Enterprise Edition is available under a separate Enterprise Agreement with\n             custom terms negotiated between Licensee and Licensor. Enterprise terms\n             supersede this ESLA where conflicting. Enterprise features may include:\n        \n             (a) Site-wide or per-device licensing as negotiated.\n             (b) Custom SLA and support terms.\n             (c) Extended offline grace periods (up to 14 days or custom).\n             (d) Offline-only license provisioning for air-gapped environments.\n             (e) Custom deployment and integration support.\n        \n             Contact: enterprise@epochly.com\n        \n        2.5  ACADEMIC LICENSE\n        \n             Licensor offers complimentary Professional Edition licenses for qualified\n             academic and educational use, subject to the following terms:\n        \n             (a) Eligibility: Faculty, researchers, and students at accredited\n                 educational institutions who intend to use the Software for teaching,\n                 coursework, or non-commercial academic research.\n             (b) Application: Eligible individuals must contact Licensor at\n                 academic@epochly.com to request an Academic License. Licensor may\n                 require verification of academic affiliation (e.g., a valid .edu\n                 email address or institutional letter).\n             (c) Capabilities: Full Professional Edition capabilities as described in\n                 Section 2.3, including all Enhancement Levels and unlimited resources.\n             (d) Duration: Academic Licenses are issued for one (1) academic year and\n                 are renewable upon continued eligibility verification.\n             (e) Restrictions: Academic Licenses may not be used for commercial\n                 purposes, revenue-generating activities, or Competitive Activity.\n                 Academic Licenses are non-transferable.\n             (f) Publication: Academic works utilizing the Software must include\n                 appropriate acknowledgment of Epochly in accordance with standard\n                 academic citation practices.\n             (g) Expiration: Upon expiry or loss of eligibility, the Software\n                 degrades to Community Edition. No data loss occurs.\n        \n        ===============================================================================\n        SECTION 3: HARDWARE BINDING AND MACHINE FINGERPRINTING\n        ===============================================================================\n        \n        3.1  CONSENT TO DATA COLLECTION\n        \n             By installing and using the Software, Licensee consents to the collection\n             and processing of the following hardware and system attributes for the sole\n             purpose of generating a Machine Fingerprint for license enforcement:\n        \n             (a) CPU serial number or processor identifier\n             (b) Motherboard serial number or board identifier\n             (c) Primary disk serial number or partition UUID\n             (d) BIOS or UEFI firmware version\n             (e) Network interface MAC addresses (up to three unique addresses)\n             (f) GPU model and identification information\n             (g) Total physical memory configuration\n             (h) Operating system installation identifier (machine-id)\n             (i) Network interface names and types (up to five interfaces)\n             (j) System UUID (hardware UUID)\n             (k) Boot identifier (changes on system restart)\n        \n        3.2  FINGERPRINT PROCESSING\n        \n             The eleven (11) attributes listed in Section 3.1 are processed locally on\n             the Device into a single one-way SHA-256 cryptographic hash. The original\n             attribute values are not transmitted to or stored by Licensor. Only the\n             resulting hash is used for license validation.\n        \n        3.3  DRIFT TOLERANCE\n        \n             The Software permits changes to up to two (2) volatile hardware attributes\n             (such as boot identifier or network interface changes) without requiring\n             license reactivation. Changes to stable attributes (CPU serial, motherboard\n             ID, disk serial) are weighted more heavily and may require reactivation.\n        \n        3.4  DEVICE TRANSFER\n        \n             Licensee may transfer a Professional or Enterprise license to a different\n             Device by deactivating the license on the original Device and reactivating\n             on the new Device, subject to a reasonable cooldown period to prevent abuse.\n        \n        3.5  VIRTUAL MACHINES AND CONTAINERS\n        \n             Each virtual machine, cloud instance, or container constitutes a separate\n             Device for licensing purposes. A separate license is required for each.\n        \n        3.6  CIRCUMVENTION PROHIBITED\n        \n             Licensee shall not circumvent, disable, spoof, or interfere with the\n             Machine Fingerprinting mechanism, including but not limited to:\n             (a) Spoofing hardware identifiers.\n             (b) Modifying fingerprint generation code.\n             (c) Sharing or cloning Machine Fingerprints between Devices.\n             (d) Using virtualization to replicate a single Device's fingerprint.\n        \n        ===============================================================================\n        SECTION 4: RESTRICTIONS\n        ===============================================================================\n        \n        4.1  Licensee shall NOT:\n        \n             (a) Reverse engineer, decompile, or disassemble any compiled components of\n                 the Software, including but not limited to native extensions (.so,\n                 .pyd, .dylib files), the native_guard module, or any obfuscated code.\n             (b) Modify, alter, or tamper with the Software's licensing, telemetry,\n                 enforcement, or security code, including but not limited to the\n                 license_enforcer, license_crypto, secure_node_auth, binary_integrity,\n                 time_protection, or secure_storage modules.\n             (c) Remove, alter, or obscure any copyright notices, proprietary markings,\n                 license headers, or trademark notices in the Software.\n             (d) Circumvent or attempt to circumvent any technical measures that control\n                 access to or functionality of the Software, including License Key\n                 validation, Machine Fingerprint verification, tier enforcement, core\n                 limits, or feature gates.\n             (e) Use the Software in any manner that violates applicable law or\n                 regulation.\n             (f) Operate the Software beyond the limits of Licensee's current tier\n                 through any means other than upgrading to an authorized tier.\n        \n        4.2  TIER LIMITS ARE PROGRAMMATICALLY ENFORCED\n        \n             The Software enforces tier-specific limits through runtime checks. These\n             enforcement mechanisms are integral to the Software and may not be\n             bypassed, disabled, or modified. Enforcement results in graceful\n             degradation (never hard failure).\n        \n        ===============================================================================\n        SECTION 5: REDISTRIBUTION\n        ===============================================================================\n        \n        5.1  NO STANDALONE REDISTRIBUTION\n        \n             Licensee may not redistribute the Software as a standalone package, library,\n             module, or product, whether modified or unmodified, on any package index\n             (including PyPI), repository, download site, or distribution channel.\n        \n        5.2  APPLICATION DISTRIBUTION\n        \n             Licensee may distribute Applications that depend on the Software as a\n             library, provided that:\n             (a) End users must obtain their own Epochly license (Community or paid).\n             (b) The Application does not include a copy of the Software itself.\n             (c) The Application's documentation references the Epochly license\n                 requirement.\n             (d) The Application does not expose the Software's internal APIs or\n                 bypass its licensing mechanisms.\n        \n        5.3  INTERNAL DISTRIBUTION\n        \n             Enterprise Agreement holders may distribute the Software internally within\n             their organization as permitted by their Enterprise Agreement.\n        \n        5.4  ACADEMIC USE\n        \n             Publications, research papers, and academic works that utilize the Software\n             must include appropriate acknowledgment of Epochly in accordance with\n             standard academic citation practices. Academic Licenses are available at\n             no cost as described in Section 2.5.\n        \n        ===============================================================================\n        SECTION 6: INTELLECTUAL PROPERTY\n        ===============================================================================\n        \n        6.1  OWNERSHIP\n        \n             The Software and all copies thereof are proprietary to and owned by\n             Licensor. The Software is protected by copyright law and international\n             treaty provisions. All rights in the Software not specifically granted in\n             this Agreement are reserved by Licensor.\n        \n        6.2  NO DERIVATIVE WORKS\n        \n             Licensee may not create derivative works based on the Software, except as\n             necessary for normal use (e.g., configuration, integration with\n             Applications).\n        \n        6.3  NO PATENT LICENSE\n        \n             This Agreement does not grant Licensee any rights under any patents held\n             by Licensor, except to the extent necessary for normal use of the Software\n             in accordance with this Agreement.\n        \n        6.4  TRADEMARKS\n        \n             \"EPOCHLY\" and associated logos are trademarks of the Epochly Development\n             Team. Licensee may not use these trademarks except: (a) to accurately\n             identify the Software in documentation; (b) as required by this Agreement;\n             or (c) with prior written consent from Licensor.\n        \n        6.5  LICENSEE'S APPLICATIONS\n        \n             Licensee retains all ownership rights in Applications created using the\n             Software. This Agreement does not transfer any rights in Licensee's\n             Applications to Licensor.\n        \n        6.6  FEEDBACK\n        \n             If Licensee provides feedback, suggestions, or ideas regarding the Software\n             (\"Feedback\"), Licensor may use such Feedback without obligation or\n             compensation to Licensee. Licensee grants Licensor a perpetual, irrevocable,\n             worldwide, royalty-free license to use, modify, and incorporate Feedback.\n        \n        ===============================================================================\n        SECTION 7: ANTI-COMPETITIVE USE RESTRICTION\n        ===============================================================================\n        \n        7.1  COMMUNITY EDITION - EVALUATION AND RESEARCH PERMITTED\n        \n             Entities engaged in Competitive Activity may use the Community Edition of\n             the Software for:\n             (a) Internal evaluation, benchmarking, and research purposes.\n             (b) Academic study and publication.\n             (c) Interoperability testing and compatibility verification.\n        \n        7.2  COMMUNITY EDITION - PRODUCTION USE PROHIBITED FOR COMPETITORS\n        \n             Entities engaged in Competitive Activity may NOT use the Community Edition:\n             (a) In production environments or revenue-generating activities.\n             (b) To build, enhance, or train competing products or services.\n             (c) To replicate, reverse engineer, or derive algorithms from the Software\n                 for use in competing products.\n        \n        7.3  TRIAL, PROFESSIONAL, AND ENTERPRISE - RESTRICTION\n        \n             Entities engaged in Competitive Activity may not obtain or use Trial,\n             Professional, or Enterprise licenses without prior written consent from\n             Licensor. Licensor reserves the right to deny or revoke licenses for\n             entities engaged in Competitive Activity.\n        \n        7.4  BENCHMARKING RESTRICTION\n        \n             Published comparative benchmarks that include the Software require prior\n             written consent from Licensor. This restriction does not apply to:\n             (a) Internal (non-published) benchmarks.\n             (b) Academic research published in peer-reviewed venues.\n             (c) Benchmarks where the Software is not the primary subject of comparison.\n        \n        7.5  CARVE-OUTS\n        \n             The following activities are expressly NOT considered Competitive Activity:\n             (a) Using the Software to optimize Licensee's own applications.\n             (b) Developing general-purpose profiling, monitoring, or debugging tools.\n             (c) Developing infrastructure orchestration or deployment tools.\n             (d) Developing hardware-specific acceleration libraries or drivers.\n             (e) Developing domain-specific scientific computing libraries.\n             (f) Using the Software in educational or teaching settings.\n        \n        ===============================================================================\n        SECTION 8: DATA COLLECTION AND PRIVACY\n        ===============================================================================\n        \n        8.1  MACHINE FINGERPRINT\n        \n             The Software collects hardware attributes as described in Section 3 to\n             generate a Machine Fingerprint for license enforcement. This data is\n             processed as a one-way hash and cannot be reversed to recover the original\n             attributes.\n        \n        8.2  OPERATIONAL TELEMETRY\n        \n             The Software may collect anonymous operational telemetry including:\n        \n             (a) Compatibility data: module names, compatibility status, error\n                 information, Software version, Python version, platform, and\n                 timestamps.\n             (b) Performance data: function identifiers (names of functions that are\n                 JIT-compiled or optimized), compilation backend, compilation time,\n                 speedup ratios, and Enhancement Level transitions.\n             (c) Resource utilization: CPU percentage, memory usage, and GPU\n                 utilization (aggregate metrics only, no user data).\n             (d) Workload classification: workload type label (e.g., \"ml_training\",\n                 \"data_science\") and confidence score.\n        \n             This telemetry is used to improve Software performance, power the Epochly\n             Lens fleet management dashboard (for Professional and Enterprise\n             Licensees), and improve Software compatibility and quality.\n        \n             Licensee may opt out of all operational telemetry by setting the\n             environment variable EPOCHLY_TELEMETRY=0 or EPOCHLY_DISABLE_TELEMETRY=1,\n             or by configuring the file ~/.epochly/config.yaml. Disabling telemetry\n             does not affect Software functionality but does disable Lens fleet\n             visibility for the affected Device.\n        \n        8.3  LICENSE VALIDATION\n        \n             The Software periodically communicates with Licensor's servers\n             (api.epochly.com) to validate license status. This communication includes\n             the Machine Fingerprint hash, License Key hash, Software version, and\n             validation timestamp. All communication occurs over TLS-encrypted HTTPS.\n        \n        8.4  WHAT IS NOT COLLECTED\n        \n             The Software does NOT collect: source code, function bodies or\n             implementations, file contents, file paths, variable names or values,\n             user data, passwords, API keys or credentials, financial information,\n             browsing history, keystrokes, or screenshots. Function identifiers\n             (names only, not source code) may be collected as described in\n             Section 8.2(b).\n        \n        8.5  PRIVACY POLICY\n        \n             For complete details on data collection, processing, storage, and rights\n             under GDPR, CCPA, and other privacy regulations, see the Epochly Privacy\n             Policy at https://epochly.com/legal/privacy.\n        \n        ===============================================================================\n        SECTION 9: WARRANTY DISCLAIMERS\n        ===============================================================================\n        \n        9.1  THE SOFTWARE IS PROVIDED \"AS IS\" AND \"AS AVAILABLE\" WITHOUT WARRANTY OF\n             ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES\n             OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND\n             NON-INFRINGEMENT.\n        \n        9.2  LICENSOR DOES NOT WARRANT THAT THE SOFTWARE WILL MEET LICENSEE'S\n             REQUIREMENTS, THAT OPERATION OF THE SOFTWARE WILL BE UNINTERRUPTED OR\n             ERROR-FREE, OR THAT DEFECTS IN THE SOFTWARE WILL BE CORRECTED.\n        \n        9.3  LICENSOR MAKES NO WARRANTY REGARDING THE DEGREE OF PERFORMANCE\n             IMPROVEMENT, IF ANY, THAT LICENSEE WILL ACHIEVE THROUGH USE OF THE\n             SOFTWARE. PERFORMANCE RESULTS VARY BASED ON HARDWARE, WORKLOAD\n             CHARACTERISTICS, AND CONFIGURATION.\n        \n        9.4  NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY LICENSOR SHALL CREATE\n             A WARRANTY NOT EXPRESSLY STATED IN THIS AGREEMENT.\n        \n        ===============================================================================\n        SECTION 10: LIMITATION OF LIABILITY\n        ===============================================================================\n        \n        10.1 TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL\n             LICENSOR BE LIABLE FOR ANY INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL,\n             OR PUNITIVE DAMAGES, OR ANY DAMAGES FOR LOSS OF PROFITS, REVENUE, DATA,\n             OR DATA USE, INCURRED BY LICENSEE OR ANY THIRD PARTY, WHETHER IN AN\n             ACTION IN CONTRACT OR TORT, EVEN IF LICENSOR HAS BEEN ADVISED OF THE\n             POSSIBILITY OF SUCH DAMAGES.\n        \n        10.2 LICENSOR'S TOTAL AGGREGATE LIABILITY UNDER OR IN CONNECTION WITH THIS\n             AGREEMENT SHALL NOT EXCEED THE GREATER OF: (A) THE AMOUNTS PAID BY\n             LICENSEE TO LICENSOR FOR THE SOFTWARE DURING THE TWELVE (12) MONTHS\n             PRECEDING THE CLAIM; OR (B) ONE HUNDRED U.S. DOLLARS ($100 USD).\n        \n        10.3 THE LIMITATIONS IN THIS SECTION SHALL APPLY NOTWITHSTANDING ANY FAILURE\n             OF ESSENTIAL PURPOSE OF ANY LIMITED REMEDY.\n        \n        10.4 SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CERTAIN\n             DAMAGES. IN SUCH JURISDICTIONS, LICENSOR'S LIABILITY SHALL BE LIMITED\n             TO THE MAXIMUM EXTENT PERMITTED BY LAW.\n        \n        ===============================================================================\n        SECTION 11: TERMINATION\n        ===============================================================================\n        \n        11.1 TERMINATION BY LICENSEE\n        \n             Licensee may terminate this Agreement at any time by:\n             (a) Uninstalling the Software from all Devices.\n             (b) Destroying all copies of the Software in Licensee's possession.\n             (c) For subscription licenses: canceling the subscription through the\n                 designated payment processor or Licensor's account portal.\n        \n        11.2 TERMINATION BY LICENSOR\n        \n             Licensor may terminate this Agreement immediately upon written notice if\n             Licensee:\n             (a) Materially breaches any term of this Agreement and fails to cure such\n                 breach within thirty (30) days of written notice.\n             (b) Circumvents or attempts to circumvent license enforcement, Machine\n                 Fingerprinting, or any technical protection measures.\n             (c) Engages in Competitive Activity in violation of Section 7.\n             (d) Commits fraud, piracy, or unauthorized redistribution.\n        \n        11.3 SUBSCRIPTION LAPSE\n        \n             Non-payment or subscription cancellation does not terminate this Agreement.\n             Instead, the Software gracefully degrades to Community Edition. Licensee\n             retains the right to use the Community Edition in accordance with Section\n             2.1.\n        \n        11.4 EFFECT OF TERMINATION\n        \n             Upon termination:\n             (a) All license rights granted under this Agreement cease immediately,\n                 except as provided in Section 11.3.\n             (b) Licensee must uninstall and destroy all copies of the Software.\n             (c) Sections 1, 4, 6, 7, 8, 9, 10, 12, 13, and 14 survive termination.\n        \n        ===============================================================================\n        SECTION 12: EXPORT COMPLIANCE\n        ===============================================================================\n        \n        12.1 The Software may contain cryptographic components, including but not limited\n             to Ed25519 digital signature algorithms, AES-256 encryption, SHA-256\n             hashing, and HMAC-SHA256 message authentication. These components may be\n             subject to export control regulations.\n        \n        12.2 Licensee shall comply with all applicable export laws and regulations of\n             the United States, including the Export Administration Regulations (EAR),\n             and any applicable export laws of the jurisdiction in which Licensee\n             resides or uses the Software.\n        \n        12.3 Licensee represents and warrants that Licensee is not: (a) located in,\n             or a national or resident of, any country subject to U.S. trade sanctions\n             or embargoes; (b) on any U.S. government denied-party list; or (c)\n             intending to use the Software for any purpose prohibited by U.S. export\n             laws, including the development of nuclear, chemical, or biological weapons.\n        \n        ===============================================================================\n        SECTION 13: GOVERNING LAW AND DISPUTE RESOLUTION\n        ===============================================================================\n        \n        13.1 GOVERNING LAW\n        \n             This Agreement shall be governed by and construed in accordance with the\n             laws of the State of Delaware, United States of America, without regard\n             to its conflict of law provisions.\n        \n        13.2 ARBITRATION\n        \n             Any dispute, controversy, or claim arising out of or relating to this\n             Agreement, or the breach, termination, or invalidity thereof, where the\n             amount in controversy is less than Two Hundred Fifty Thousand U.S. Dollars\n             ($250,000 USD), shall be settled by binding arbitration in accordance with\n             the rules of the American Arbitration Association. The place of arbitration\n             shall be Wilmington, Delaware.\n        \n        13.3 LITIGATION\n        \n             For disputes exceeding the arbitration threshold, the parties consent to\n             the exclusive jurisdiction and venue of the Delaware Court of Chancery\n             (or, if the Court of Chancery lacks jurisdiction, the state and federal\n             courts located in New Castle County, Delaware).\n        \n        13.4 CLASS ACTION WAIVER\n        \n             LICENSEE AGREES THAT ANY PROCEEDINGS TO RESOLVE OR LITIGATE ANY DISPUTE\n             WILL BE CONDUCTED SOLELY ON AN INDIVIDUAL BASIS, AND THAT LICENSEE WILL\n             NOT SEEK TO HAVE ANY DISPUTE HEARD AS A CLASS ACTION, A REPRESENTATIVE\n             ACTION, A COLLECTIVE ACTION, A PRIVATE ATTORNEY-GENERAL ACTION, OR IN ANY\n             PROCEEDING IN WHICH LICENSEE ACTS OR PROPOSES TO ACT IN A REPRESENTATIVE\n             CAPACITY.\n        \n        13.5 INFORMAL RESOLUTION\n        \n             Before initiating any formal dispute resolution, the parties agree to\n             attempt informal resolution for a period of sixty (60) days from written\n             notice of the dispute. Notices shall be sent to: legal@epochly.com.\n        \n        ===============================================================================\n        SECTION 14: GENERAL PROVISIONS\n        ===============================================================================\n        \n        14.1 ENTIRE AGREEMENT\n        \n             This Agreement constitutes the entire agreement between the parties\n             regarding the Software and supersedes all prior or contemporaneous\n             agreements, negotiations, and discussions, whether oral or written,\n             except for separate Enterprise Agreements executed by both parties.\n        \n        14.2 SEVERABILITY\n        \n             If any provision of this Agreement is held to be unenforceable, such\n             provision shall be reformed to the minimum extent necessary to make it\n             enforceable, and the remaining provisions shall continue in full force\n             and effect.\n        \n        14.3 WAIVER\n        \n             Failure by Licensor to enforce any provision of this Agreement shall not\n             constitute a waiver of that provision or the right to enforce it at a\n             later time.\n        \n        14.4 ASSIGNMENT\n        \n             Licensee may not assign or transfer this Agreement or any rights hereunder\n             without the prior written consent of Licensor. Licensor may assign this\n             Agreement in connection with a merger, acquisition, or sale of all or\n             substantially all of its assets. Any attempted assignment in violation of\n             this section is void.\n        \n        14.5 NOTICES\n        \n             All notices under this Agreement shall be in writing and shall be deemed\n             given when delivered by email to the addresses specified herein. Licensor\n             may also provide notice through the Software's CLI, update mechanisms, or\n             website.\n        \n             Licensor notices: legal@epochly.com\n             Licensing inquiries: licensing@epochly.com\n             Privacy inquiries: privacy@epochly.com\n             Enterprise inquiries: enterprise@epochly.com\n        \n        14.6 AMENDMENTS\n        \n             Licensor reserves the right to modify this Agreement. Material changes\n             will be communicated with at least thirty (30) days' notice via email\n             (for registered users), the Software's CLI messaging system, or the\n             Epochly website. Continued use of the Software after the effective date\n             of modifications constitutes acceptance. If Licensee does not agree with\n             modifications, Licensee's sole remedy is to cease using the Software.\n        \n        14.7 FORCE MAJEURE\n        \n             Neither party shall be liable for any failure or delay in performance due\n             to causes beyond its reasonable control, including but not limited to acts\n             of God, war, terrorism, pandemic, government action, or failure of third-\n             party services.\n        \n        14.8 THIRD-PARTY COMPONENTS\n        \n             The Software may include third-party open-source components, which are\n             governed by their respective licenses. A list of third-party components\n             and their licenses is available in the NOTICE file distributed with the\n             Software.\n        \n        14.9 RELATIONSHIP OF PARTIES\n        \n             This Agreement does not create any agency, partnership, joint venture, or\n             employment relationship between the parties.\n        \n        14.10 HEADINGS\n        \n              Section headings are for convenience only and shall not affect the\n              interpretation of this Agreement.\n        \n        ===============================================================================\n        \n        EPOCHLY is a trademark of the Epochly Incorporated.\n        \n        For licensing inquiries: licensing@epochly.com\n        For legal inquiries: legal@epochly.com\n        Website: https://epochly.com\n        \n        Last Updated: January 31, 2026\n        ",
  "license_expression": null,
  "home_page": "https://epochly.com",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "Epochly Incorporated",
  "repository": "https://github.com/epochly-python/epochly.git",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1771540776,
  "project_urls": {
    "Documentation": "https://epochly.com/docs",
    "Bug Tracker": "https://github.com/epochly-python/epochly/issues",
    "Homepage": "https://epochly.com",
    "Repository": "https://github.com/epochly-python/epochly.git"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}