{
  "name": "epochly",
  "version": "0.1.1",
  "summary": "Epochly - Transparent performance optimization for Python applications",
  "license": "EPOCHLY PROPRIETARY SOFTWARE LICENSE\n        \n        Copyright (c) 2025 Epochly Development Team. All Rights Reserved.\n        \n        NOTICE: This is proprietary software. All rights are reserved by the copyright holder.\n        \n        This software and associated documentation files (the \"Software\") are the exclusive\n        property of the Epochly Development Team. The Software is protected by copyright law\n        and international treaties.\n        \n        UNAUTHORIZED USE, COPYING, MODIFICATION, MERGER, PUBLICATION, DISTRIBUTION,\n        SUBLICENSING, AND/OR SALE OF THE SOFTWARE IS STRICTLY PROHIBITED.\n        \n        NO LICENSE IS GRANTED: This notice does not grant any rights to use, copy, modify,\n        or distribute the Software. Access to this Software does not imply any license or\n        right to use it.\n        \n        LIMITED EVALUATION: If you have received this Software for evaluation purposes under\n        a separate written agreement, your use is limited to the terms specified in that\n        agreement.\n        \n        CONFIDENTIALITY: This Software contains confidential and proprietary information.\n        You must maintain the confidentiality of the Software and not disclose it to any\n        third party.\n        \n        NO WARRANTIES: THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n        EXPRESS OR IMPLIED. IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE FOR ANY CLAIM,\n        DAMAGES, OR OTHER LIABILITY ARISING FROM THE USE OR INABILITY TO USE THE SOFTWARE.\n        \n        TERMINATION: Any unauthorized use will result in immediate termination of any rights\n        to possess or use the Software, and may result in legal action.\n        \n        GOVERNING LAW: This notice shall be governed by and construed in accordance with the\n        laws of the United States and the State of California, without regard to its conflict\n        of law provisions.\n        \n        For licensing inquiries, please contact: licensing@epochly.com\n        \n        EPOCHLY™ is a trademark of the Epochly Development Team.\n        \n        Last Updated: January 2025",
  "license_expression": null,
  "home_page": "https://epochly.com",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "Epochly Development Team",
  "repository": "https://github.com/epochly-python/epochly.git",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1769726741,
  "project_urls": {
    "Repository": "https://github.com/epochly-python/epochly.git",
    "Bug Tracker": "https://github.com/epochly-python/epochly/issues",
    "Homepage": "https://epochly.com",
    "Documentation": "https://epochly.com/docs"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}