{
  "name": "mas",
  "version": "0.2.6",
  "summary": "MAS is a Python library for automated trading and backtesting on MetaTrader 5 with KPI reports and dynamic visualization.",
  "license": "# LICENSE-API\n        \n        ## 📜 API Terms of Use\n        \n        ### 1. Introduction\n        \n        These API Terms of Use (hereinafter referred to as \"Terms\") are established by Mas Intelligent Technology Ltd. (hereinafter referred to as \"the Company\") and apply to all individuals, corporations, or entities (hereinafter referred to as \"Users\") who use the API services provided by the Company.\n        \n        By accessing or using the API, Users acknowledge that they have read, understood, and agreed to these Terms.\n        \n        ### 2. License and Scope of Use\n        \n        * **License Type**: Non-exclusive, non-transferable, and revocable.\n        * **Prohibited Activities**:\n        \n          * Using the API for illegal, improper, or unauthorized purposes.\n          * Engaging in high-frequency trading (HFT) or activities that affect market fairness.\n          * Reverse engineering, reselling, or redistributing the API.\n          * Unauthorized access to or modification of data.\n          * Activities causing system overload or interfering with other users.\n        \n        ### 3. API Key Management\n        \n        * Users must register and obtain an API key.\n        * API keys must be kept confidential. If compromised, Users must notify the Company immediately.\n        * The Company reserves the right to limit or revoke API access based on security assessments.\n        \n        ### 4. Billing and Fees\n        \n        * The API provides both free and paid plans.\n        * Access may be suspended for overdue payments.\n        * Invoices can be issued upon request.\n        \n        ### 5. Data Privacy and Protection\n        \n        * Users must comply with GDPR, CCPA, and other applicable data protection regulations.\n        * API activity logs may be stored for compliance and security purposes.\n        * Users may request data deletion by contacting support.\n        \n        ### 6. Risk and Disclaimer\n        \n        * The API is provided **\"as is\"** without any warranties, express or implied.\n        * Market data provided via the API is for reference only and does not constitute investment advice.\n        * Executable files (EXE) generated through the API are based on user strategies; the Company does not guarantee correct execution or bear responsibility for financial losses.\n        * Users are responsible for thorough backtesting and simulation before using strategies in live trading and assume all associated risks.\n        \n        ### 7. Termination and Suspension\n        \n        * The Company may immediately terminate API access if these Terms are violated.\n        * Users may terminate usage at any time; payments made are non-refundable.\n        * The Company may suspend the API for maintenance or security concerns without prior notice.\n        \n        ### 8. Governing Law and Jurisdiction\n        \n        * These Terms are governed by the laws of the Republic of China (Taiwan).\n        * In the event of disputes, the Taipei District Court of Taiwan shall be the court of first instance.\n        \n        ### 9. Amendments\n        \n        * The Company reserves the right to modify these Terms at any time.\n        * Significant changes will be announced via the official website or email.\n        * Continued use of the API constitutes acceptance of the revised Terms.\n        \n        ---\n        \n        © 2025 Mas Intelligent Technology Ltd.",
  "license_expression": null,
  "home_page": "https://mindaismart.com/",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://mindaismart.com/",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1770104175,
  "project_urls": {
    "Homepage": "https://mindaismart.com/",
    "Documentation": "https://doc.mindaismart.com/",
    "Register": "https://mas.mindaismart.com/",
    "AI Trading Assistant": "https://mindaismart.com/product_ai"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}