{
  "name": "deepluq",
  "version": "0.1.3",
  "summary": "Package to quantify uncertainty in deep learning models",
  "license": "--- Start of Definition of INTO-CPS Association Public License ---\n        \n        /*\n         * This file is part of the INTO-CPS Association.\n         *\n         * Copyright (c) 2017-CurrentYear, INTO-CPS Association (ICA),\n         * c/o Peter Gorm Larsen, Aarhus University, Department of Engineering,\n         * Finlandsgade 22, 8200 Aarhus N, Denmark.\n         *\n         * All rights reserved.\n         *\n         * THIS PROGRAM IS PROVIDED UNDER THE TERMS OF GPL VERSION 3 LICENSE OR\n         * THIS INTO-CPS ASSOCIATION PUBLIC LICENSE (ICAPL) VERSION 1.0.\n         * ANY USE, REPRODUCTION OR DISTRIBUTION OF THIS PROGRAM CONSTITUTES\n         * RECIPIENT'S ACCEPTANCE OF THE INTO-CPS ASSOCIATION PUBLIC LICENSE OR\n         * THE GPL VERSION 3, ACCORDING TO RECIPIENTS CHOICE.\n         *\n         * The INTO-CPS tool suite software and the INTO-CPS Association\n         * Public License (ICAPL) are obtained from the INTO-CPS Association, either\n         * from the above address, from the URLs: http://www.into-cps.org or\n         * in the INTO-CPS tool suite distribution.\n         * GNU version 3 is obtained from: http://www.gnu.org/copyleft/gpl.html.\n         *\n         * This program is distributed WITHOUT ANY WARRANTY; without\n         * even the implied warranty of  MERCHANTABILITY or FITNESS\n         * FOR A PARTICULAR PURPOSE, EXCEPT AS EXPRESSLY SET FORTH\n         * IN THE BY RECIPIENT SELECTED SUBSIDIARY LICENSE CONDITIONS OF\n         * THE INTO-CPS ASSOCIATION PUBLIC LICENSE.\n         *\n         * See the full ICAPL conditions for more details.\n         *\n         */\n        \n        --- End of INTO-CPS Association Public License Header ---\n        \n        The ICAPL is a public license for the INTO-CPS tool suite with three modes/alternatives\n        (GPL, ICA-Internal-EPL, ICA-External-EPL) for use and redistribution,\n        in source and/or binary/object-code form:\n        \n        * GPL. Any party (member or non-member of the INTO-CPS Association) may use and\n          redistribute INTO-CPS tool suite under GPL version 3.\n        \n        * Silver Level members of the INTO-CPS Association may also use and redistribute\n          the INTO-CPS tool suite under ICA-Internal-EPL conditions.\n        \n        * Gold Level members of the INTO-CPS Association may also use and redistribute\n          The INTO-CPS tool suite under ICA-Internal-EPL or ICA-External-EPL conditions.\n        \n        Definitions of the INTO-CPS Association Public license modes:\n        \n        * GPL = GPL version 3.\n        \n        * ICA-Internal-EPL = These INTO-CPA Association Public license conditions together with\n         Internally restricted EPL, i.e., EPL version 1.0 with the Additional Condition\n         that use and redistribution by a member of the INTO-CPS Association is only allowed\n         within the INTO-CPS Association member's own organization (i.e., its own legal entity),\n         or for a member of the INTO-CPS Association paying a membership fee corresponding to\n         the size of the organization including all its affiliates, use and redistribution\n         is allowed within/between its affiliates.\n        \n        * ICA-External-EPL = These INTO-CPA Association Public license conditions together with\n         Externally restricted EPL, i.e., EPL version 1.0 with the Additional Condition\n         that use and redistribution by a member of the INTO-CPS Association, or by a Licensed\n         Third Party Distributor having a redistribution agreement with that member,\n         to parties external to the INTO-CPS Association member’s own organization (i.e., its own\n         legal entity) is only allowed in binary/object-code form, except the case of\n         redistribution to other members the INTO-CPS Association to which source is also\n         allowed to be distributed.\n        \n        [This has the consequence that an external party who wishes to use\n        the INTO-CPS Association in source form together with its own proprietary software in all\n        cases must be a member of the INTO-CPS Association].\n        \n        In all cases of usage and redistribution by recipients, the following\n        conditions also apply:\n        \n        a) Redistributions of source code must retain the above copyright notice,\n         all definitions, and conditions. It is sufficient if the ICAPL Header is\n         present in each source file, if the full ICAPL is available in a prominent\n         and easily located place in the redistribution.\n        \n        b) Redistributions in binary/object-code form must reproduce the above\n         copyright notice, all definitions, and conditions. It is sufficient if the\n         ICAPL Header and the location in the redistribution of the full ICAPL\n         are present in the documentation and/or other materials provided with the\n         redistribution, if the full ICAPL is available in a prominent and easily\n         located place in the redistribution.\n        \n        c) A recipient must clearly indicate its chosen usage mode of ICAPL,\n         in accompanying documentation and in a text file ICA-USAGE-MODE.txt,\n         provided with the distribution.\n        \n        d) Contributor(s) making a Contribution to the INTO-CPS Association thereby also makes a\n         Transfer of Contribution Copyright. In return, upon the effective date of\n         the transfer, ICA grants the Contributor(s) a Contribution License of the\n         Contribution. ICA has the right to accept or refuse Contributions.\n        \n        Definitions:\n        \n        \"Subsidiary license conditions\" means:\n        \n        The additional license conditions depending on the by the recipient chosen\n        mode of ICAPL, defined by GPL version 3.0 for GPL, and by EPL for\n        ICA-Internal-EPL and ICA-External-EPL.\n        \n        \"ICAPL\" means:\n        \n        INTO-CPS Association Public License version 1.0, i.e., the license\n        defined here (the text between\n        \"--- Start of Definition of INTO-CPS Association Public License ---\" and\n        \"--- End of Definition of INTO-CPS Association Public License ---\", or later versions thereof.\n        \n        \"ICAPL Header\" means:\n        \n        INTO-CPS Association Public License Header version 1.2, i.e., the\n        text between \"--- Start of Definition of INTO-CPS Association Public License ---\" and\n        \"--- End of INTO-CPS Association Public License Header ---, or later versions thereof.\n        \n        \"Contribution\" means:\n        \n        a) in the case of the initial Contributor, the initial code and documentation\n         distributed under ICAPL, and\n        \n        b) in the case of each subsequent Contributor:\n           i) changes to the INTO-CPS tool suite, and\n          ii) additions to the INTO-CPS tool suite;\n        \n        where such changes and/or additions to the INTO-CPS tool suite originate from and are\n        distributed by that particular Contributor. A Contribution 'originates' from\n        a Contributor if it was added to the INTO-CPS tool suite by such Contributor itself or\n        anyone acting on such Contributor's behalf.\n        \n        For Contributors licensing the INTO-CPS tool suite under ICA-Internal-EPL or\n        ICA-External-EPL conditions, the following conditions also hold:\n        \n        Contributions do not include additions to the distributed Program which: (i)\n        are separate modules of software distributed in conjunction with the INTO-CPS tool suite\n        under their own license agreement, (ii) are separate modules which are not\n        derivative works of the INTO-CPS tool suite, and (iii) are separate modules of software\n        distributed in conjunction with the INTO-CPS tool suite under their own license agreement\n        where these separate modules are merged with (weaved together with) modules of\n        The INTO-CPS tool suite to form new modules that are distributed as object code or source\n        code under their own license agreement, as allowed under the Additional\n        Condition of internal distribution according to ICA-Internal-EPL and/or\n        Additional Condition for external distribution according to ICA-External-EPL.\n        \n        \"Transfer of Contribution Copyright\" means that the Contributors of a\n        Contribution transfer the ownership and the copyright of the Contribution to\n        the INTO-CPS Association, the INTO-CPS Association Copyright owner, for\n        inclusion in the INTO-CPS tool suite. The transfer takes place upon the effective date\n        when the Contribution is made available on the INTO-CPS Association web site under ICAPL, by\n        such Contributors themselves or anyone acting on such Contributors' behalf.\n        The transfer is free of charge. If the Contributors or the INTO-CPS Association so wish,\n        an optional Copyright transfer agreement can be signed between the INTO-CPS Association and the Contributors.\n        \n        \"Contribution License\" means a license from the INTO-CPS Association to the Contributors of the Contribution, effective on the date of the Transfer of Contribution Copyright,\n        where the INTO-CPS Association grants the Contributors a non-exclusive, world-wide, transferable, free of charge, perpetual license, including sublicensing rights, to use,\n        have used, modify, have modified, reproduce and or have reproduced the\n        contributed material, for business and other purposes, including but not\n        limited to evaluation, development, testing, integration and merging with\n        other software and distribution. The warranty and liability disclaimers of\n        ICAPL apply to this license.\n        \n        \"Contributor\" means any person or entity that distributes (part of)\n        the INTO-CPS tool chain.\n        \n        \"The Program\" means the Contributions distributed in accordance with ICAPL.\n        \n        \"The INTO-CPS tool chain\" means the Contributions distributed in accordance with ICAPL.\n        \n        \"Recipient\" means anyone who receives the INTO-CPS tool chain under ICAPL,\n        including all Contributors.\n        \n        \"Licensed Third Party Distributor\" means a reseller/distributor having signed\n        a redistribution/resale agreement in accordance with ICAPL and the INTO-CPS\n        Association Bylaws, with a Gold Level organizational member which is not an\n        Affiliate of the reseller/distributor, for distributing a product containing\n        part(s) of the INTO-CPS tool suite. The Licensed Third Party Distributor shall\n        only be allowed further redistribution to other resellers if the Gold Level\n        member is granting such a right to it in the redistribution/resale agreement\n        between the Gold Level member and the Licensed Third Party Distributor.\n        \n        \"Affiliate\" shall mean any legal entity, directly or indirectly, through one\n        or more intermediaries, controlling or controlled by or under common control\n        with any other legal entity, as the case may be. For purposes of this\n        definition, the term \"control\" (including the terms \"controlling,\"\n        \"controlled by\" and \"under common control with\") means the possession,\n        direct or indirect, of the power to direct or cause the direction of the\n        management and policies of a legal entity, whether through the ownership of\n        voting securities, by contract or otherwise.\n        \n        NO WARRANTY\n        \n        EXCEPT AS EXPRESSLY SET FORTH IN THE BY RECIPIENT SELECTED SUBSIDIARY\n        LICENSE CONDITIONS OF ICAPL, THE INTO-CPS ASSOCIATION IS PROVIDED ON AN \"AS IS\"\n        BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR\n        IMPLIED INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OR CONDITIONS OF\n        TITLE, NON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A PARTICULAR\n        PURPOSE. Each Recipient is solely responsible for determining the\n        appropriateness of using and distributing the INTO-CPS tool suite and assumes all risks\n        associated with its exercise of rights under ICAPL , including but not\n        limited to the risks and costs of program errors, compliance with applicable\n        laws, damage to or loss of data, programs or equipment, and unavailability\n        or interruption of operations.\n        \n        DISCLAIMER OF LIABILITY\n        \n        EXCEPT AS EXPRESSLY SET FORTH IN THE BY RECIPIENT SELECTED SUBSIDIARY\n        LICENSE CONDITIONS OF ICAPL, NEITHER RECIPIENT NOR ANY CONTRIBUTORS\n        SHALL HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n        EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION\n        LOST PROFITS), HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n        CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n        ARISING IN ANY WAY OUT OF THE USE OR DISTRIBUTION OF THE INTO-CPS TOOL\n        SUITE OR THE EXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF ADVISED\n        OF THE POSSIBILITY OF SUCH DAMAGES.\n        \n        A Contributor licensing the INTO-CPS tool suite under ICA-Internal-EPL or\n        ICA-External-EPL may choose to distribute (parts of) the INTO-CPS tool suite\n        in object code form under its own license agreement, provided that:\n        \n        a) it complies with the terms and conditions of ICAPL; or for the case of\n        redistribution of the INTO-CPS tool suite together with proprietary code it is a dual\n        license where the INTO-CPS tool suite parts are distributed under ICAPL compatible\n        conditions and the proprietary code is distributed under proprietary license\n        conditions; and\n        \n        b) its license agreement:\n           i) effectively disclaims on behalf of all Contributors all warranties and\n        conditions, express and implied, including warranties or conditions of title\n        and non-infringement, and implied warranties or conditions of merchantability\n        and fitness for a particular purpose;\n          ii) effectively excludes on behalf of all Contributors all liability for\n        damages, including direct, indirect, special, incidental and consequential\n        damages, such as lost profits;\n         iii) states that any provisions which differ from ICAPL are offered by that\n        Contributor alone and not by any other party; and\n          iv) states from where the source code for the INTO-CPS tool suite is available, and\n        informs licensees how to obtain it in a reasonable manner on or through a\n        medium customarily used for software exchange.\n        \n        When the INTO-CPS tool suite is made available in source code form:\n        \n         a) it must be made available under ICAPL; and\n        \n         b) a copy of ICAPL must be included with each copy of the INTO-CPS tool suite.\n        \n         c) a copy of the subsidiary license associated with the selected mode of\n        ICAPL must be included with each copy of the INTO-CPS tool suite.\n        \n        Contributors may not remove or alter any copyright notices contained within\n        The INTO-CPS tool suite.\n        \n        If there is a conflict between ICAPL and the subsidiary license conditions,\n        ICAPL has priority.\n        \n        This Agreement is governed by the laws of Denmark. The place of jurisdiction\n        for all disagreements related to this Agreement, is Aarhus, Denmark.\n        \n        The EPL 1.0 license definition has been obtained from:\n        http://www.eclipse.org/legal/epl-v10.html. It is also reproduced in the INTO-CPS distribution.\n        \n        The GPL Version 3 license definition has been obtained from\n        http://www.gnu.org/copyleft/gpl.html. It is also reproduced in the INTO-CPS distribution.\n        \n        --- End of Definition of INTO-CPS Association Public License ---\n        ",
  "license_expression": null,
  "home_page": "https://github.com/chengjie-lu/deepluq",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/chengjie-lu/deepluq",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1770205959,
  "project_urls": {
    "homepage": "https://github.com/chengjie-lu/deepluq",
    "repository": "https://github.com/chengjie-lu/deepluq",
    "documentation": "https://github.com/chengjie-lu/deepluq"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}