{
  "name": "idaes-connectivity",
  "version": "0.1.0",
  "summary": "Tools to display and export connectivity within IDAES process models.",
  "license": "License Agreement\n        =================\n        \n        PrOMMiS Copyright © 2024, by the software owners: The Regents of the University of California,\n        through Lawrence Berkeley National Laboratory, et al. All rights reserved.\n        \n        Redistribution and use in source and binary forms, with or without modification, are permitted\n        provided that the following conditions are met:\n        \n        1. Redistributions of source code must retain the above copyright notice, this list of conditions\n           and the following disclaimer.\n        \n        2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions\n           and the following disclaimer in the documentation and/or other materials provided with the\n           distribution.\n        \n        3. Neither the name of the Process Optimization and Modeling for Minerals Sustainability (“PrOMMiS”)\n           initiative, University of California, Lawrence Berkeley National Laboratory, U.S. Dept. of\n           Energy, nor the names of its contributors may be used to endorse or promote products derived from\n           this software without specific prior written permission.\n        \n        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR\n        IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\n        FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR\n        CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n        DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n        DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER\n        IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF\n        THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n        \n        You are under no obligation whatsoever to provide any bug fixes, patches, or upgrades to the\n        features, functionality or performance of the source code (\"Enhancements\") to anyone; however, if\n        you choose to make your Enhancements available either publicly, or directly to Lawrence Berkeley\n        National Laboratory, without imposing a separate written license agreement for such Enhancements,\n        then you hereby grant Lawrence Berkeley National Laboratory the following license: a non-exclusive,\n        royalty-free perpetual license to install, use, modify, prepare derivative works, incorporate into\n        other computer software, distribute, and sublicense such enhancements or derivative works thereof,\n        in binary and source code form.\n        ",
  "license_expression": null,
  "home_page": "https://github.com/prommis/idaes-connectivity",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/prommis/idaes-connectivity",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1771079765,
  "project_urls": {
    "Documentation": "https://prommis.github.io/idaes-connectivity/",
    "Issues": "https://github.com/prommis/idaes-connectivity/issues",
    "Repository": "https://github.com/prommis/idaes-connectivity",
    "Homepage": "https://github.com/prommis/idaes-connectivity"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}