{
  "name": "git-versiointi",
  "version": "1.7rc5",
  "summary": "Git-tietovarastoon perustuva versionumeroinnin hallinta",
  "license": "Tekijänoikeus 2020– Antti Hautaniemi  Tämän käyttöoikeusasiakirjan nojalla annetaan ilmainen käyttöoikeus sen mukana toimitettavaan ohjelmistoon kenelle tahansa henkilölle, joka saa tämän ohjelmiston ja sen mukana toimitettavan dokumentaation haltuunsa. Tämä oikeus sisältää oikeuden mainitun ohjelmiston käyttämiseen, kopiointiin, muokkaamiseen, yhdistämiseen, julkaisemiseen, levittämiseen, edelleen lisensointiin sekä ohjelmiston tai sen osien jälleenmyyntiin. Samoin annetaan oikeus edellä mainittujen oikeuksien luovuttamiseen myös sellaisille kolmansille osapuolille, joiden käyttöön mainittu ohjelmisto on näiden oikeuksien haltijan toimesta luovutettu. Kaikki tässä kappaleessa mainitut oikeudet luovutetaan yksinomaan seuraavalla ehdolla:  Yllä mainittu tekijänoikeusilmoitus sekä tämä käyttöoikeusasiakirja on sisällytettävä sellaisenaan kaikkiin tämän asiakirjan mukana toimitettavasta ohjelmistosta tai kyseisen ohjelmiston merkittävästä osakokonaisuudesta tehtyihin kopioihin.  Ohjelmisto toimitetaan sellaisenaan ilman minkäänlaista, suoraan tai välillisesti, ilmaistua takuuta. Tällaisena takuuna pidetään muun muassa, seuraaviin esimerkkeihin kuitenkaan rajoittumatta, myyntikelpoisuutta, käyttökelpoisuutta mihinkään erityiseen tarkoitukseen tai kolmansien osapuolten oikeuksien loukkaamattomuutta. Missään tapauksessa ohjelmiston tekijöitä tai tekijänoikeuden haltijoita ei voida pitää korvausvelvollisina liittyen mihinkään vahingonkorvaus- tai muuhun sen enempää sopimussuhteesta kuin muustakaan ohjelmistoon itseensä, sen käyttöön tai muuhun ohjelmiston tai sen osien käsittelyyn liittyvästä vahingon tai muun korvausvelvollisuuden aiheutumisesta.  Riippumatta siitä, mitä tämän asiakirjan muissa kohdissa sanotaan, Suomen kansan pakotelistalla (https://github.com/an7oine/suomen-kansan-pakotelista/blob/master/README.md) mainituilla henkilöillä lähipiireineen ei ole oikeutta pitää hallussaan, käyttää taikka suoraan tai välillisesti hyödyntää tätä ohjelmistoa tai mitään sen osaa. ",
  "license_expression": null,
  "home_page": "https://github.com/an7oine/git-versiointi.git",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/an7oine/git-versiointi.git",
  "repository_source": "project_urls.homepage",
  "pub_date": 1768821535,
  "project_urls": {
    "Homepage": "https://github.com/an7oine/git-versiointi.git"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false
}