{
  "name": "gitmeup",
  "version": "1.0.4",
  "summary": "LLM-assisted conventional commits generator for git repositories. Automatically generates git add and commit lines based on git diff and status.",
  "license": "DUAL LICENSE AGREEMENT\n        \n        This software is protected by copyright and is available under two distinct licensing models. \n        Your rights to use, copy, modify, and distribute the software depend on your status as a user.\n        \n        1. FOR INDIVIDUALS (PERSONAL USE)\n        ---------------------------------\n        If you are an individual using this software for personal, non-commercial, or open-source projects, \n        you are granted permission to use this software under the terms of the MIT License:\n        \n            MIT License\n            Copyright (c) 2025 @ikramagix\n        \n            Permission is hereby granted, free of charge, to any person obtaining a copy\n            of this software and associated documentation files (the \"Software\"), to deal\n            in the Software without restriction, including without limitation the rights\n            to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n            copies of the Software, and to permit persons to whom the Software is\n            furnished to do so, subject to the following conditions:\n        \n            The above copyright notice and this permission notice shall be included in all\n            copies or substantial portions of the Software.\n        \n            THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n            IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n            FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n            AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n            LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n            OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n            SOFTWARE.\n        \n        \n        2. FOR ORGANIZATIONS AND COMMERCIAL ENTITIES\n        --------------------------------------------\n        Use of this software by organizations, businesses, or for commercial purposes \n        is NOT covered by the MIT License set forth above.\n        \n        To obtain a license for organizational or commercial use, \n        please contact the author at: hello@ikramagix.com",
  "license_expression": null,
  "home_page": "https://github.com/ikramagix/gitmeup",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/ikramagix/gitmeup",
  "repository_source": "project_urls.source",
  "download": null,
  "download_source": null,
  "pub_date": 1770917465,
  "project_urls": {
    "Homepage": "https://github.com/ikramagix/gitmeup",
    "Issues": "https://github.com/ikramagix/gitmeup/issues",
    "Source": "https://github.com/ikramagix/gitmeup"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}