{
  "name": "torchcodec",
  "version": "0.10.0",
  "summary": "A video decoder for PyTorch",
  "license": "BSD 3-Clause License\n        \n        Copyright 2024 Meta\n        \n        Redistribution and use in source and binary forms, with or without modification,\n        are permitted provided that the following conditions are met:\n        \n        1. Redistributions of source code must retain the above copyright notice,this list\n        of conditions and the following disclaimer.\n        \n        2. Redistributions in binary form must reproduce the above copyright notice, this\n        list of conditions and the following disclaimer in the documentation\n        and/or other materials provided with the distribution.\n        \n        3. Neither the name of the copyright holder nor the names of its contributors may\n        be used to endorse or promote products derived from this software without specific\n        prior written permission.\n        \n        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS “AS IS” AND ANY\n        EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\n        OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT\n        SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\n        INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED\n        TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\n        BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n        CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN\n        ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH\n        DAMAGE.\n        ",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/pytorch/torchcodec",
  "repository_source": "project_urls.github",
  "download": null,
  "download_source": null,
  "pub_date": 1769096494,
  "project_urls": {
    "Documentation": "https://pytorch.org/torchcodec/stable/index.html",
    "GitHub": "https://github.com/pytorch/torchcodec"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": true,
  "has_setup_cfg": false
}