{
  "name": "wilco",
  "version": "0.4.0",
  "summary": "Serve React components from Python backends",
  "license": "# Makersquad Source License 1.0\n        \n        ## Acceptance\n        \n        By using the software, you agree to all of the terms and conditions below.\n        \n        ## Definitions\n        \n        **\"License\"** means this Makersquad Source License.\n        \n        **\"Licensor\"** means Makersquad, the copyright holder offering these terms.\n        \n        **\"Software\"** means the software the Licensor makes available under these terms,\n        including any portion of it.\n        \n        **\"You\"** means the individual or entity agreeing to these terms.\n        \n        **\"Your Company\"** means any legal entity, sole proprietorship, or other kind of\n        organization that you work for, plus all organizations that have control over,\n        are under the control of, or are under common control with that organization.\n        Control means ownership of substantially all the assets of an entity, or the\n        power to direct its management and policies by vote, contract, or otherwise.\n        \n        **\"Commercial Purpose\"** means any use intended for or directed toward commercial\n        advantage or monetary compensation. This includes, but is not limited to:\n        - Using the Software in a product or service you sell\n        - Using the Software to provide paid services to third parties\n        - Using the Software in internal business operations that generate revenue\n        - Using the Software to develop commercial products, even if the Software itself\n          is not distributed\n        \n        **\"Competing Use\"** means making the Software available to third parties as a\n        commercial product or service that substitutes for the Software, or using the\n        Software to develop a product or service that competes with the Software.\n        \n        **\"Change Date\"** means the date that is five (5) years after the release date\n        of each version of the Software.\n        \n        **\"Change License\"** means the Apache License, Version 2.0, as published by the\n        Apache Software Foundation.\n        \n        ## License Grant\n        \n        Subject to the terms and conditions of this License, the Licensor grants you a\n        non-exclusive, royalty-free, worldwide, non-sublicensable, non-transferable\n        license to use, copy, modify, and distribute the Software, for any purpose that\n        is not a Commercial Purpose and is not a Competing Use.\n        \n        ## Permitted Uses\n        \n        You **may**, without a commercial license:\n        \n        1. **Evaluate** the Software to determine whether it meets your needs\n        2. **Use** the Software for personal, educational, or research purposes\n        3. **Read** and study the source code to learn from it\n        4. **Modify** the Software and create derivative works for non-commercial purposes\n        5. **Contribute** patches, bug fixes, and improvements back to the project\n        6. **Use** the Software in non-profit organizations for non-commercial activities\n        \n        ## Prohibited Uses\n        \n        You **may not**, without a commercial license or written exception:\n        \n        1. Use the Software for any Commercial Purpose\n        2. Use the Software for any Competing Use\n        3. Remove or obscure any licensing, copyright, or other notices\n        4. Use the Licensor's trademarks without permission\n        \n        ## Open Source and Non-Profit Exceptions\n        \n        If you wish to use the Software in an open source project or for non-profit\n        purposes that may have indirect commercial implications, you must obtain a\n        written exception from the Licensor. Such exceptions may be granted at the\n        Licensor's sole discretion and may include additional terms.\n        \n        To request an exception, contact: licensing@makersquad.fr\n        \n        ## Commercial Licenses\n        \n        Commercial licenses are available for use of the Software in commercial products\n        and services. Commercial licenses may include:\n        \n        - Technical support\n        - Bug fixes and security updates\n        - Priority feature development\n        \n        For commercial licensing inquiries, contact: licensing@makersquad.fr\n        \n        ## Change Date License Conversion\n        \n        On the Change Date for each version of the Software, this License will\n        automatically convert to the Change License for that version only. After the\n        Change Date:\n        \n        - That specific version becomes available under the Change License\n        - You may use that version for any purpose, including Commercial Purpose\n        - Newer versions released after the Change Date remain under this License until\n          their own Change Date\n        \n        For clarity: if you obtain a commercial license for a version, you may continue\n        using that version indefinitely. Five years after that version's release, you\n        may also use it under the Change License without the commercial license.\n        \n        ## Notices\n        \n        You must ensure that anyone who gets a copy of any part of the Software from\n        you also gets a copy of these terms, or the URL for this License:\n        https://github.com/msqd/wilco/blob/main/LICENSE.md\n        \n        ## No Trademark Rights\n        \n        This License does not grant you any right to use the Licensor's name, logo,\n        or trademarks.\n        \n        ## Patents\n        \n        The Licensor grants you a license, under any patent claims the Licensor can\n        license or becomes able to license, to make, have made, use, sell, offer for\n        sale, import and have imported the Software, only for the purposes permitted\n        under this License. This license does not cover any patent claims that you\n        cause to be infringed by modifications or additions to the Software.\n        \n        ## No Other Rights\n        \n        These terms do not imply any licenses other than those expressly granted in\n        this License.\n        \n        ## Termination\n        \n        If you violate any terms of this License, your rights under it terminate\n        immediately. The Licensor may, at its sole discretion, reinstate your rights\n        upon written notice.\n        \n        ## No Liability\n        \n        ***To the maximum extent permitted by applicable law, the Software is provided\n        \"as is\", without any warranty or condition of any kind, express or implied,\n        including but not limited to warranties of merchantability, fitness for a\n        particular purpose, or non-infringement.***\n        \n        ***To the maximum extent permitted by applicable law, the Licensor shall not be\n        liable for any direct, indirect, incidental, special, consequential, or\n        exemplary damages arising out of or in connection with these terms or the use\n        of the Software, regardless of the cause of action or the theory of liability.***\n        \n        ***Nothing in this License shall limit or exclude liability that cannot be\n        limited or excluded under applicable law, including mandatory consumer\n        protection laws.***\n        \n        ## Moral Rights\n        \n        The Licensor retains all moral rights in the Software as recognized under\n        applicable law, including under French intellectual property law (Code de la\n        propriété intellectuelle). These rights are personal, perpetual, inalienable,\n        and imprescriptible.\n        \n        ## Severability\n        \n        If any provision of this License is held to be invalid, illegal, or\n        unenforceable, the remaining provisions shall continue in full force and\n        effect. The invalid provision shall be modified to the minimum extent necessary\n        to make it valid and enforceable while preserving the parties' original intent.\n        \n        ## Governing Law and Jurisdiction\n        \n        This License shall be governed by and construed in accordance with the laws of\n        France, without regard to its conflict of law provisions. Any dispute arising\n        out of or in connection with this License shall be submitted to the exclusive\n        jurisdiction of the courts of Paris, France.\n        \n        ---\n        \n        Copyright (c) 2025-present Makersquad\n        \n        For licensing inquiries: licensing@makersquad.fr",
  "license_expression": null,
  "home_page": "https://github.com/msqd/wilco",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/msqd/wilco",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1771482059,
  "project_urls": {
    "Documentation": "https://python-wilco.readthedocs.io/",
    "Repository": "https://github.com/msqd/wilco",
    "Issues": "https://github.com/msqd/wilco/issues",
    "Homepage": "https://github.com/msqd/wilco"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}