{
  "name": "mdot-tnt",
  "version": "1.0.0",
  "summary": "A fast, GPU-parallel, PyTorch-compatible optimal transport solver.",
  "license": "# Non-Commercial Research License (NCRL-1.0)\n        \n        Copyright (C) 2025 Mete Kemertas\n        \n        ## 1. License Grant\n        Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the “Software”), to use, copy, modify, merge, publish, and distribute copies of the Software **solely for non-commercial research, educational, and personal purposes**, subject to the following conditions:\n        \n        ## 2. Restrictions\n        ### 2.1 **Non-Commercial Use Only**\n        - The Software **may NOT** be used for any commercial purpose without explicit written permission from the Licensor.\n        - \"Commercial purpose\" includes, but is not limited to:\n          - Selling or licensing the Software.\n          - Using the Software in proprietary products or services.\n          - Offering the Software as part of a paid or revenue-generating service.\n        \n        ### 2.2 **No Warranty & Liability**\n        THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES, OR OTHER LIABILITY ARISING FROM THE USE OF THE SOFTWARE.\n        \n        ### 2.3 **Commercial Licensing**\n        For commercial use, a separate license must be obtained from the Licensor. To inquire about licensing, please contact: **kemertas@cs.toronto.edu**.\n        \n        ## 3. Termination\n        This license automatically terminates if the Licensee breaches any of its terms. Upon termination, all rights granted under this license are revoked, and the Licensee must cease using and distributing the Software.\n        \n        ## 4. Governing Law and Enforcement\n        This license shall be governed by and construed in accordance with the laws of Ontario, Canada. However, violations of this license may also be pursued under applicable copyright laws in the jurisdiction where infringement occurs.\n        \n        ## 5. Contact\n        For licensing inquiries, please contact: **kemertas@cs.toronto.edu**.\n        ",
  "license_expression": null,
  "home_page": "https://github.com/metekemertas/mdot_tnt",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/metekemertas/mdot_tnt",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1770280552,
  "project_urls": {
    "Repository": "https://github.com/metekemertas/mdot_tnt",
    "Homepage": "https://github.com/metekemertas/mdot_tnt",
    "Issues": "https://github.com/metekemertas/mdot_tnt/issues",
    "Documentation": "https://mdot-tnt.readthedocs.io"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}