{
  "name": "pydm",
  "version": "1.28.2",
  "summary": "A Python-Qt based framework for building user interfaces for control systems",
  "license": "Copyright (c) 2017-2025, The Board of Trustees of the Leland Stanford\n        Junior University, through SLAC National Accelerator Laboratory\n        (subject to receipt of any required approvals from the U.S. Dept. of\n        Energy). All rights reserved. Redistribution and use in source and\n        binary forms, with or without modification, are permitted provided\n        that the following conditions are met:\n        \n        (1) Redistributions of source code must retain the above copyright\n        notice, this list of conditions and the following disclaimer.\n        \n        (2) Redistributions in binary form must reproduce the above copyright\n        notice, this list of conditions and the following disclaimer in the\n        documentation and/or other materials provided with the distribution.\n        \n        (3) Neither the name of the Leland Stanford Junior University, SLAC\n        National Accelerator Laboratory, U.S. Dept. of Energy nor the names of\n        its contributors may be used to endorse or promote products derived\n        from this software without specific prior written permission.\n        \n        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n        \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n        LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n        A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n        OWNER, THE UNITED STATES GOVERNMENT, OR CONTRIBUTORS BE LIABLE FOR ANY\n        DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n        DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE\n        GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n        INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER\n        IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR\n        OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF\n        ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n        \n        You are under no obligation whatsoever to provide any bug fixes,\n        patches, or upgrades to the features, functionality or performance of\n        the source code (\"Enhancements\") to anyone; however, if you choose to\n        make your Enhancements available either publicly, or directly to SLAC\n        National Accelerator Laboratory, without imposing a separate written\n        license agreement for such Enhancements, then you hereby grant the\n        following license: a non-exclusive, royalty-free perpetual license to\n        install, use, modify, prepare derivative works, incorporate into other\n        computer software, distribute, and sublicense such Enhancements or\n        derivative works thereof, in binary and source code form.\n        ",
  "license_expression": null,
  "home_page": "https://github.com/slaclab/pydm",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "SLAC National Accelerator Laboratory",
  "repository": "https://github.com/slaclab/pydm",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1770756104,
  "project_urls": {
    "Documentation": "https://slaclab.github.io/pydm/",
    "Homepage": "https://github.com/slaclab/pydm"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}