{
  "name": "pyhannom",
  "version": "0.2.0",
  "summary": "A Python toolkit for the digitization of Han-Nom characters, enabling AI and natural language processing applications with Vietnamese Han-Nom data.",
  "license": "MIT License (for code)\r\n        \r\n        Copyright (c) 2025 Zijie ZHANG\r\n        \r\n        Permission is hereby granted, free of charge, to any person obtaining a copy\r\n        of this software and associated documentation files (the \"Software\"), to deal\r\n        in the Software without restriction, including without limitation the rights\r\n        to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\r\n        copies of the Software, subject to the following conditions:\r\n        \r\n        The above copyright notice and this permission notice shall be included in all\r\n        copies or substantial portions of the Software.\r\n        \r\n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\r\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\r\n        FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\r\n        AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\r\n        LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\r\n        OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\r\n        SOFTWARE.\r\n        \r\n        \r\n        -------------------------------------------------------------------------------\r\n        Data Usage Notice\r\n        \r\n        This project includes data derived from the \"會研究吧應用漢喃 Hội Nghiên cứu và Ứng dụng Hán Nôm\" project:\r\n        \r\n        - https://www.hannom-rcv.org/\r\n        - https://www.hannom-rcv.org/BCHNCTD.html\r\n        - https://www.hannom-rcv.org/Lookup-CHNC.html\r\n        - https://www.hannom-rcv.org/converter\r\n        \r\n        All rights to the original data belong to the \"會研究吧應用漢喃 Hội Nghiên cứu và Ứng dụng Hán Nôm\".\r\n        The data included in this package is provided strictly for research and\r\n        educational purposes. Commercial use of the data is NOT permitted.\r\n        \r\n        Redistribution or modification of the data must include proper attribution\r\n        to the original source and comply with any additional requirements set by\r\n        the \"會研究吧應用漢喃 Hội Nghiên cứu và Ứng dụng Hán Nôm\".",
  "license_expression": null,
  "home_page": "https://pypi.org/project/pyhannom/",
  "maintainer": null,
  "author": null,
  "repository": "https://pypi.org/project/pyhannom/",
  "repository_source": "project_urls.homepage",
  "pub_date": 1768821104,
  "project_urls": {
    "Homepage": "https://pypi.org/project/pyhannom/"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null
}