{
  "name": "pykalman",
  "version": "0.11.2",
  "summary": "An implementation of the Kalman Filter, Kalman Smoother, and EM algorithm in Python",
  "license": "All code contained except that in pykalman/utils.py is released under the\n        license below. All code in pykalman/utils.py is released under the license\n        contained therein.\n        \n        Copyright (c) 2025 - present, The pykalman developers at GC.OS.\n        Copyright (c) 2012 - 2025 Daniel Duckworth.\n        \n        All rights reserved.\n        \n        1. New BSD License\n        \n        Redistribution and use in source and binary forms, with or without\n        modification, are permitted*, provided that the following conditions are met:\n        \n          a. Redistributions of source code must retain the above copyright notice,\n             this list of conditions and the following disclaimer.\n          b. Redistributions in binary form must reproduce the above copyright\n             notice, this list of conditions and the following disclaimer in the\n             documentation and/or other materials provided with the distribution.\n          c. Neither the name of Daniel Duckworth nor the names of\n             its contributors may be used to endorse or promote products\n             derived from this software without specific prior written\n             permission.\n        \n        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\n        AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n        IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n        ARE DISCLAIMED. IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE FOR\n        ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n        DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n        SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\n        CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n        LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n        OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH\n        DAMAGE.\n        \n        * subject to provisions in section 2 below\n        \n        2. Conditional Distribution Terms for Anaconda and NumFOCUS Channels\n        \n        Notwithstanding Section 1, redistribution of this software through the channels listed in Paragraph 2.1 below is subject to additional terms.\n        \n        2.1 Channels Subject to Additional Terms\n        \n        Anaconda, Inc., including but not limited to Anaconda Distribution and Anaconda Cloud\n        \n        NumFOCUS-affiliated or NumFOCUS-managed distribution infrastructure\n        \n        conda-forge and any mirrors, forks, or derivative services thereof\n        \n        2.2 Limitation to Distributors, Explicit Exemption of End Users from Section 2\n        \n        For the avoidance of doubt, only the entities distributing the software through the channels listed in Section 2.1 are responsible for compliance with Section 2, including payment of fees. End users who download or use the software from these channels, or any other channels, shall have no obligation or liability under Section 2 of this license.\n        \n        2.3 Explicit Exemption of PyPI from Section 2\n        \n        For the avoidance of doubt, distribution of this software via the Python Package Index (PyPI), including pypi.org and its mirrors, is not subject to Section 2.1, does not require a separate commercial distribution license, and remains fully governed by Sections 1 of this license (New BSD).\n        \n        2.4 Separate Distribution License Required\n        \n        Distribution through the channels listed above requires a separately executed commercial distribution license granted by the copyright holder.\n        \n        2.5 Fee Structure\n        \n        Such a license shall include, at minimum:\n        \n        An initial annual distribution fee of USD 10,000, granting the right to distribute the software for a period of one (1) calendar year; and\n        \n        A per-download fee of USD 1 per end-user download obtained through the above distribution channels during the licensed term.\n        \n        Fees shall be reported and remitted on a mutually agreed reporting schedule.\n        \n        2.6 No Implied Rights\n        \n        No rights to distribute via the channels listed in this Section are granted by this license absent a separately executed written agreement.\n        \n        2.7 Prohibited Distribution Without License\n        \n        Any distribution of this software through the channels listed in Paragraph 2.1 without a valid commercial distribution license constitutes unauthorized use and is expressly prohibited.\n        \n        2.8 Effect of Unauthorized Distribution\n        \n        In the event of unauthorized distribution:\n        \n        a. No license or permission is granted or implied by such distribution;\n        \n        b. The distributing party shall be deemed to be in material breach of this license; and\n        \n        c. The copyright holder reserves the right to pursue all available remedies, including but not limited to:\n        \n        Injunctive relief,\n        \n        Recovery of unpaid fees,\n        \n        Statutory or actual damages,\n        \n        Termination of any rights otherwise granted under this license.\n        \n        2.9 Cure and Compliance\n        \n        The copyright holder may, at its sole discretion, offer the distributing party an opportunity to cure unauthorized distribution by entering into a commercial distribution license retroactively. Nothing in this section shall be construed as a waiver of rights.\n        \n        2.10 Jurisdiction\n        \n        Any disputes arising out of or in connection with this agreement shall be governed solely by German law, with the exclusion of the UN Convention on Contracts for the International Sale of Goods (CISG). The Munich Regional Court (Landgericht München I) shall have exclusive jurisdiction in respect of any and all disputes arising out of or in connection with this agreement.\n        ",
  "license_expression": null,
  "home_page": "https://github.com/pykalman/pykalman",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "Daniel Duckworth",
  "repository": "https://github.com/pykalman/pykalman",
  "repository_source": "project_urls.repository",
  "download": "https://pypi.org/project/pykalman/",
  "download_source": "project_urls.download",
  "pub_date": 1769897461,
  "project_urls": {
    "Download": "https://pypi.org/project/pykalman/",
    "Documentation": "https://pykalman.readthedocs.io/en/latest/",
    "Homepage": "https://github.com/pykalman/pykalman",
    "Repository": "https://github.com/pykalman/pykalman"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": true,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": true
}