{
  "name": "pysimplemask",
  "version": "0.3.1",
  "summary": "A GUI for creating mask and q-partition maps for scattering patterns in preparation for SAXS/WAXS/XPCS data reduction",
  "license": "Copyright (c) 2026, UChicago Argonne, LLC. All rights reserved.\n        \n        Copyright 2026. UChicago Argonne, LLC. This software was produced\n        under U.S. Government contract DE-AC02-06CH11357 for Argonne National\n        Laboratory (ANL), which is operated by UChicago Argonne, LLC for the\n        U.S. Department of Energy. The U.S. Government has rights to use,\n        reproduce, and distribute this software.  NEITHER THE GOVERNMENT NOR\n        UChicago Argonne, LLC MAKES ANY WARRANTY, EXPRESS OR IMPLIED, OR\n        ASSUMES ANY LIABILITY FOR THE USE OF THIS SOFTWARE.  If software is\n        modified to produce derivative works, such modified software should\n        be clearly marked, so as not to confuse it with the version available\n        from ANL.\n        \n        Additionally, redistribution and use in source and binary forms, with\n        or without modification, are permitted provided that the following\n        conditions are met:\n        \n            * Redistributions of source code must retain the above copyright\n              notice, this list of conditions and the following disclaimer.\n        \n            * Redistributions in binary form must reproduce the above copyright\n              notice, this list of conditions and the following disclaimer in\n              the documentation and/or other materials provided with the\n              distribution.\n        \n            * Neither the name of UChicago Argonne, LLC, Argonne National\n              Laboratory, ANL, the U.S. Government, nor the names of its\n              contributors may be used to endorse or promote products derived\n              from this software without specific prior written permission.\n        \n        THIS SOFTWARE IS PROVIDED BY UChicago Argonne, LLC AND CONTRIBUTORS\n        \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n        LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS\n        FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL UChicago\n        Argonne, LLC OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\n        INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,\n        BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\n        LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\n        CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n        LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN\n        ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\n        POSSIBILITY OF SUCH DAMAGE.",
  "license_expression": null,
  "home_page": "https://github.com/AdvancedPhotonSource/pySimpleMask",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/AdvancedPhotonSource/pySimpleMask",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1769204163,
  "project_urls": {
    "bugs": "https://github.com/AdvancedPhotonSource/pySimpleMask/issues",
    "changelog": "https://github.com/AdvancedPhotonSource/pySimpleMask/blob/master/changelog.md",
    "homepage": "https://github.com/AdvancedPhotonSource/pySimpleMask"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}