{
  "name": "pysweph",
  "version": "2.10.3.6",
  "summary": "Community fork of Pyswisseph, a Python extension to the Swiss Ephemeris",
  "license": "/* Copyright (C) 1997 - 2021 Astrodienst AG, Switzerland.  All rights reserved.\n        \n          License conditions\n          ------------------\n        \n          This file is part of Swiss Ephemeris.\n        \n          Swiss Ephemeris is distributed with NO WARRANTY OF ANY KIND.  No author\n          or distributor accepts any responsibility for the consequences of using it,\n          or for whether it serves any particular purpose or works at all, unless he\n          or she says so in writing.\n        \n          Swiss Ephemeris is made available by its authors under a dual licensing\n          system. The software developer, who uses any part of Swiss Ephemeris\n          in his or her software, must choose between one of the two license models,\n          which are\n          a) GNU Affero General Public License (AGPL)\n          b) Swiss Ephemeris Professional License\n        \n          The choice must be made before the software developer distributes software\n          containing parts of Swiss Ephemeris to others, and before any public\n          service using the developed software is activated.\n        \n          If the developer choses the AGPL software license, he or she must fulfill\n          the conditions of that license, which includes the obligation to place his\n          or her whole software project under the AGPL or a compatible license.\n          See https://www.gnu.org/licenses/agpl-3.0.html\n        \n          If the developer choses the Swiss Ephemeris Professional license,\n          he must follow the instructions as found in http://www.astro.com/swisseph/\n          and purchase the Swiss Ephemeris Professional Edition from Astrodienst\n          and sign the corresponding license contract.\n        \n          The License grants you the right to use, copy, modify and redistribute\n          Swiss Ephemeris, but only under certain conditions described in the License.\n          Among other things, the License requires that the copyright notices and\n          this notice be preserved on all copies.\n        \n          Authors of the Swiss Ephemeris: Dieter Koch and Alois Treindl\n        \n          The authors of Swiss Ephemeris have no control or influence over any of\n          the derived works, i.e. over software or services created by other\n          programmers which use Swiss Ephemeris functions.\n        \n          The names of the authors or of the copyright holder (Astrodienst) must not\n          be used for promoting any software, product or service which uses or contains\n          the Swiss Ephemeris. This copyright notice is the ONLY place where the\n          names of the authors can legally appear, except in cases where they have\n          given special permission in writing.\n        */\n        ",
  "license_expression": null,
  "home_page": "https://sailorfe.github.io/pysweph",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/sailorfe/pysweph",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1771518387,
  "project_urls": {
    "Homepage": "https://sailorfe.github.io/pysweph",
    "Repository": "https://github.com/sailorfe/pysweph",
    "Documentation": "https://sailorfe.github.io/pysweph",
    "Original Project": "https://github.com/astrorigin/pyswisseph",
    "Issues": "https://github.com/sailorfe/pysweph/issues"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": true,
  "has_setup_cfg": false
}