{
  "name": "python-hwpx",
  "version": "2.3",
  "summary": "Hancom HWPX 패키지를 로드하고 편집하기 위한 Python 유틸리티 모음",
  "license": "Non-Commercial License\r\n        \r\n        Copyright (c) 2024 python-hwpx Maintainers\r\n        \r\n        Permission is hereby granted, free of charge, to any person obtaining a copy\r\n        of this software and associated documentation files (the \"Software\"), to use,\r\n        copy, modify, merge, publish, distribute, and sublicense the Software only for\r\n        non-commercial purposes, subject to the following conditions:\r\n        \r\n        1. Non-Commercial Use Only. The Software may be used, copied, modified,\r\n        \tmerged, published, distributed, and sublicensed only for non-commercial\r\n        \tpurposes. \"Non-Commercial\" means use that is not primarily intended for or\r\n        \tdirected toward commercial advantage, monetary compensation, or any form of\r\n        \tdirect or indirect commercial exploitation.\r\n        \r\n        2. Attribution. The above copyright notice and this permission notice shall be\r\n        \tincluded in all copies or substantial portions of the Software.\r\n        \r\n        3. No Warranty of Commercial Support. The maintainers are not obligated to\r\n        \tprovide commercial support, maintenance, or updates.\r\n        \r\n        THIS SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\r\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\r\n        FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT. IN NO EVENT SHALL THE\r\n        AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\r\n        LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\r\n        OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\r\n        SOFTWARE.\r\n        \r\n        If you require permissions to use this Software for commercial purposes,\r\n        please contact the copyright holders to negotiate an alternative licensing\r\n        arrangement.\r\n        ",
  "license_expression": null,
  "home_page": "https://github.com/airmang/python-hwpx",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "python-hwpx Maintainers",
  "repository": "https://github.com/airmang/python-hwpx",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1771949060,
  "project_urls": {
    "Documentation": "https://github.com/airmang/python-hwpx/tree/main/docs",
    "Homepage": "https://github.com/airmang/python-hwpx",
    "Issues": "https://github.com/airmang/python-hwpx/issues"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}