{
  "name": "pyvcad-rendering",
  "version": "1.0.5",
  "summary": "Renderer for OpenVCAD models.",
  "license": "Copyright © 2025 The Regents of the University of Colorado, a body corporate.\n        All Rights Reserved. Contact charles.wade@colorado.edu with any questions or\n        comments.\n        -------------------------------------------------------------------------------\n        \n        The Program is the property of The Regents of the University of Colorado, a\n        body corporate, (CU or the University). CU hereby reserves all rights in the\n        Program (defined below) not expressly granted herein. In addition to being\n        subject to copyright protection, the use of this Program is covered by a\n        pending patent application. Any use, copy, publication, distribution, display,\n        modification, or transmission of the Program in whole or in part in any form or\n        by any means outside the rights expressly granted in this Notice without the\n        written permission of CU is strictly prohibited.\n        \n        The Program consists of the computer software code known as “Systems and\n        Processes for Volumetric Multi-Material 3D Models” also known as “OpenVCAD”,\n        “VCAD” or similar, and the associated documentation, for making volumetric\n        multi-material 3D models.\n        \n        You (the user or recipient of the Program) desire to acquire a license to use\n        the Program in accordance with the terms set forth in this Notice.\n        \n        BY DOWNLOADING AND USING THIS PROGRAM, IN WHOLE OR IN PART, YOU AGREE TO COMPLY\n        WITH AND BE BOUND BY ALL TERMS IN THIS NOTICE. THE TERMS OF THIS NOTICE ALSO\n        APPLY TO ALL YOUR CONTRIBUTIONS (DEFINED BELOW). IN RETURN, THE UNIVERSITY\n        AGREES THAT IT SHALL NOT USE YOUR CONTRIBUTIONS IN A WAY THAT THE UNIVERSITY\n        BELIEVES IS CONTRARY TO THE PUBLIC BENEFIT. IF YOU DO NOT WISH TO COMPLY WITH\n        OR BE BOUND WITH THE TERMS OF THIS NOTICE YOU MUST IMMEDIATELY CEASE USE OF THE\n        PROGRAM AND DELETE ALL COPIES OR MODIFICATIONS OF THE PROGRAM COMPLETELY. If\n        You agree to these terms on behalf of an organization, You hereby represent to\n        CU that You are authorized to accept these terms on its behalf.\n        \n        1.\tDefinitions:\n            “Contributor” means the copyright owner or legal entity authorized by the\n            copyright owner of any Contribution (defined below) submitted to the\n            University. For legal entities, the entity making a Contribution and all\n            other entities that control, are controlled by, or are under common control\n            with that entity are considered to be a single Contributor. For the\n            purposes of this definition, \"control\" means (i) the power, direct or\n            indirect, to cause the direction or management of such entity, whether by\n            contract or otherwise, or (ii) ownership of fifty percent (50%) or more of\n            the outstanding shares, or (iii) beneficial ownership of such entity.\n        \n            “Contribution” means any original work of authorship, including any\n            modifications or additions to the Program, that is intentionally submitted\n            to the University for inclusion in, or documentation of, the Program. For\n            the purposes of this definition, “submitted” means any form of electronic,\n            verbal, or written communication sent to the University or its\n            representatives, including but not limited to communication on electronic\n            mailing lists, source code control systems, and issue tracking systems that\n            are managed by, or on behalf of, the University for the purpose of\n            discussing and improving the Program, but excluding communication that is\n            conspicuously marked and designated in writing as “Not a Contribution”.\n        \n        2.\tGrant of Copyright License for the Program: Subject to the terms and\n            conditions of this Notice, CU hereby grants to You a non-exclusive license\n            under CU’s copyright in the Program to use the Program for Your own\n            noncommercial academic or personal research.\n        \n        3.\tGrant of Patent License for the Program: Subject to the terms and\n            conditions of this Notice, CU hereby grants to You a non-exclusive license\n            under CU’s patent rights covering the Program to make, have made, use\n            import, and otherwise transfer the Program to Your collaborators for Your\n            own noncommercial academic or personal research, provided that the\n            foregoing patent license is granted under only those patent claims that are\n            necessarily infringed by Your Contribution(s). . If You institute patent\n            litigation against any third party (including a cross-claim or counterclaim\n            in a lawsuit) alleging that the Program or a Contribution incorporated\n            within the Program constitutes direct or contributory patent infringement,\n            then any patent licenses granted to You under this Notice for the Program\n            and Your Contributions shall terminate as of the date such litigation is\n            filed.\n        \n        4.\tTerms of Use of the Program. You may only use this Program for Your\n            noncommercial research and development efforts on behalf of a nonprofit\n            organization, or noncommercial research within and on behalf of a nonprofit\n            organization, or your own personal noncommercial activities. You may make\n            derivative works or modifications to the Programs, but only for Your\n            noncommercial research and development efforts within or on behalf of a\n            nonprofit academic or research organization, or your own personal\n            noncommercial activities. You may not remove or modify the copyright,\n            trademarks, or other proprietary notices and disclaimers as they appear in\n            the Program. You may distribute or publish the Program or any derivative\n            works of the Program made by You, provided that You must limit any further\n            use of the Program or derivative works to only noncommercial research and\n            development on behalf of a nonprofit academic or research organization, or\n            personal noncommercial activities. You shall not use the Program, any\n            portion thereof or any derivative works of the Program for any commercial\n            purposes. Commercial purposes for the purpose of this Notice include, but\n            are not limited to, providing services for others, distributing larger\n            programs that contain this Program and exchanging this Program or\n            derivative works of the Program in any manner for any form of compensation,\n            in-kind or otherwise. To the extent that You publish any results from the\n            use of the Program or derivative works of the Program, You must properly\n            acknowledge the Program as developed by the Matter Assembly Computation Lab\n            at the University of Colorado Boulder, and cite the published reference(s).\n            The recommended reference citation(s) for the Program is/are provided in\n            the Program documentation. This Notice is limited to the rights of The\n            Regents of the University of Colorado in the Program and does not include\n            any rights to other intellectual property. Your rights under this Notice\n            will terminate immediately and automatically if You fail to comply with any\n            of the terms and conditions of this Notice. Immediately upon termination,\n            You must cease all use of the Program and any derivative works of the\n            Program, destroy all copies of the Program and any derivative works of the\n            Program in Your possession or control. Termination of this Notice will not\n            limit any of CU’s rights or remedies at law or in equity. You acknowledge\n            that the Program is subject to U.S. export jurisdiction. You agree to\n            comply with all applicable international and national laws that apply to\n            the Program, including the U.S. Export Administration Regulations, as well\n            as end-user, end-use, and destination restrictions issued by U.S. and other\n            governments. The Program is distributed “as-is”, and CU has no obligation\n            to provide any maintenance, updates, additional documentation or services.\n        \n        5.\tGrant of Copyright License to Your Contributions. By submitting\n            Contributions to CU, Contributor grants to CU a non-exclusive, royalty free\n            license under Contributor’s copyright in the Contribution to use, reproduce,\n            modify, distribute, transmit, create derivative works from, publicly display\n            and publicly perform the Contribution for any purpose. CU may, in its sole\n            discretion, include your Contribution when licensing the Program under these or\n            any other license terms. To the extent that CU distributes or publishes a\n            Contribution or incorporates the Contribution into the Program, CU agrees to\n            give appropriate attribution to Contributor as prescribed by Contributor.\n            However, nothing in this Notice obligates CU to incorporate any Contribution\n            into the Program, and CU may elect not to publish or distribute a Contribution\n            in its sole discretion.\n        \n        6.\tWith respect to any of Your Contributions, You represent that you are legally\n            entitled to grant the above license to such Contributions. You represent that\n            each of Your Contributions is Your original creation (see Section 8 for\n            submissions on behalf of others). You represent that Your Contribution\n            submissions include complete details of any third-party license or other\n            restriction (including, but not limited to, related patents and trademarks)\n            of which You are aware and which are associated with any part of Your\n            Contributions. You represent and warrant that You will not submit any\n            materials to University that You know or believe to have components that\n            are malicious or harmful. You represent that, with regard to all\n            representations in Section 6, You will perform a reasonable amount of due\n            diligence in order to be properly informed of third party licenses,\n            infringing materials or harmful content associated with any part of Your\n            Contribution.\n        \n        7.\tYou are not expected to provide support for Your Contributions, except to\n            the extent You desire to provide support. You may provide support for free,\n            for a fee, or not at all.\n        \n        8.\tShould You wish to submit work that is not Your original creation, You may\n            submit it to the University separately from any Contribution, identifying\n            the complete details of its source and of any license or other restriction\n            (including, but not limited to, related patents, trademarks, and license\n            agreements) of which You are personally aware, and conspicuously marking\n            the work as \"Submitted on behalf of a third-party: [named here]\".\n        \n        9.\tYou agree to notify the University of any facts or circumstances of which\n            You become aware that would make Your representations inaccurate in any\n            respect. You agree to notify the University of any administrative or court\n            proceeding that involve Your Contributions.\n        \n        10.\tCU DISCLAIMS, ANY AND ALL OTHER WARRANTIES, CONDITIONS, OR REPRESENTATIONS\n            (EXPRESS OR IMPLIED, ORAL OR WRITTEN), WITH RESPECT TO THE PROGRAM OR ANY\n            PART THEREOF, INCLUDING ANY AND ALL IMPLIED WARRANTIES OR CONDITIONS OF\n            TITLE, NONINFRINGEMENT, MERCHANTABILITY, OR FITNESS OR SUITABILITY FOR ANY\n            PURPOSE (WHETHER OR NOT CU KNOWS, HAS REASON TO KNOW, HAS BEEN ADVISED, OR\n            IS OTHERWISE IN FACT AWARE OF ANY SUCH PURPOSE), WHETHER ALLEGED TO ARISE\n            BY LAW, BY REASON OF CUSTOM OR USAGE IN THE TRADE, OR BY COURSE OF DEALING.\n        \n        11.\tYou are solely responsible for any and all losses or expenses arising from\n            or otherwise in respect of Your use of the Program or derivative works of\n            the Program.\n        \n        12.\tYou agree that this Notice, will be governed and construed in accordance\n            with the laws of the State of Colorado.\n        \n        13.\tYou acknowledge and agree that nothing contained in this Notice shall be\n            construed as an express or implied waiver of any immunity of the\n            University, either sovereign or governmental under the Colorado\n            Governmental Immunity Act.\n        \n        14.\tYou agree that Your Contribution shall not contain any item(s) that are\n            either export-controlled under the International Traffic in Arms\n            Regulations, or that appear on the Commerce Control List (except as\n            EAR99) of the Export Administration Regulations.\n        \n        15.\tThe invalidity, illegality, or unenforceability of any one or more phrases,\n            sentences, clauses, or sections in this Notice does not affect the remaining\n            portions of this Notice.",
  "license_expression": null,
  "home_page": "https://matterassembly.org/openvcad",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://matterassembly.org/openvcad",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1772140680,
  "project_urls": {
    "Homepage": "https://matterassembly.org/openvcad",
    "Documentation": "https://matterassembly.org/openvcad-developer-dev/"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}