{
  "name": "pyxel-dic",
  "version": "2026.2.12",
  "summary": "Finite Element (FE) Digital Image/Volume Correlation (DIC/DVC) library for experimental mechanics",
  "license": "\r\n          CeCILL FREE SOFTWARE LICENSE AGREEMENT\r\n        \r\n        Version 2.1 dated 2013-06-21\r\n        \r\n        \r\n            Notice\r\n        \r\n        This Agreement is a Free Software license agreement that is the result\r\n        of discussions between its authors in order to ensure compliance with\r\n        the two main principles guiding its drafting:\r\n        \r\n          * firstly, compliance with the principles governing the distribution\r\n            of Free Software: access to source code, broad rights granted to users,\r\n          * secondly, the election of a governing law, French law, with which it\r\n            is conformant, both as regards the law of torts and intellectual\r\n            property law, and the protection that it offers to both authors and\r\n            holders of the economic rights over software.\r\n        \r\n        The authors of the CeCILL (for Ce[a] C[nrs] I[nria] L[ogiciel] L[ibre]) \r\n        license are: \r\n        \r\n        Commissariat à l'énergie atomique et aux énergies alternatives - CEA, a\r\n        public scientific, technical and industrial research establishment,\r\n        having its principal place of business at 25 rue Leblanc, immeuble Le\r\n        Ponant D, 75015 Paris, France.\r\n        \r\n        Centre National de la Recherche Scientifique - CNRS, a public scientific\r\n        and technological establishment, having its principal place of business\r\n        at 3 rue Michel-Ange, 75794 Paris cedex 16, France.\r\n        \r\n        Institut National de Recherche en Informatique et en Automatique -\r\n        Inria, a public scientific and technological establishment, having its\r\n        principal place of business at Domaine de Voluceau, Rocquencourt, BP\r\n        105, 78153 Le Chesnay cedex, France.\r\n        \r\n        \r\n            Preamble\r\n        \r\n        The purpose of this Free Software license agreement is to grant users\r\n        the right to modify and redistribute the software governed by this\r\n        license within the framework of an open source distribution model.\r\n        \r\n        The exercising of this right is conditional upon certain obligations for\r\n        users so as to preserve this status for all subsequent redistributions.\r\n        \r\n        In consideration of access to the source code and the rights to copy,\r\n        modify and redistribute granted by the license, users are provided only\r\n        with a limited warranty and the software's author, the holder of the\r\n        economic rights, and the successive licensors only have limited liability.\r\n        \r\n        In this respect, the risks associated with loading, using, modifying\r\n        and/or developing or reproducing the software by the user are brought to\r\n        the user's attention, given its Free Software status, which may make it\r\n        complicated to use, with the result that its use is reserved for\r\n        developers and experienced professionals having in-depth computer\r\n        knowledge. Users are therefore encouraged to load and test the\r\n        suitability of the software as regards their requirements in conditions\r\n        enabling the security of their systems and/or data to be ensured and,\r\n        more generally, to use and operate it in the same conditions of\r\n        security. This Agreement may be freely reproduced and published,\r\n        provided it is not altered, and that no provisions are either added or\r\n        removed herefrom.\r\n        \r\n        This Agreement may apply to any or all software for which the holder of\r\n        the economic rights decides to submit the use thereof to its provisions.\r\n        \r\n        Frequently asked questions can be found on the official website of the\r\n        CeCILL licenses family (http://www.cecill.info/index.en.html) for any \r\n        necessary clarification.\r\n        ",
  "license_expression": null,
  "home_page": "https://github.com/jcpassieux/pyxel",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "Jean-Charles Passieux",
  "repository": "https://github.com/jcpassieux/pyxel",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1770927187,
  "project_urls": {
    "Bug Tracker": "https://github.com/jcpassieux/pyxel/issues",
    "Homepage": "https://github.com/jcpassieux/pyxel"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": true
}