{
  "name": "ledgermind",
  "version": "2.8.5",
  "summary": "Monolithic Autonomous Agent Memory Management System",
  "license": "📜 LICENSE\n        \n        Non-Commercial Source Available License (NCSA)\n        \n        Copyright (c) 2026\n        Stanislav Zotov\n        All rights reserved.\n        \n        \n        ---\n        \n        1. Definitions\n        \n        For the purposes of this License:\n        \n        1.1 “Software”\n        \n        Means all source code, documentation, configuration files, scripts, schemas, models, and any other materials contained in this repository, including any updates, modifications, or derivative works thereof.\n        \n        1.2 “Author”\n        \n        Means Stanislav Zotov, the sole copyright holder of the Software.\n        \n        1.3 “You”\n        \n        Means any natural person or legal entity that accesses, uses, copies, modifies, or otherwise interacts with the Software.\n        \n        1.4 “Commercial Entity”\n        \n        Means any organization, legal entity, or individual entrepreneur (including sole proprietors / individual entrepreneurs) whose activity is directly or indirectly aimed at economic gain, regardless of whether profit is actually achieved.\n        \n        Lack of profit, losses, or ineffective management does not change the commercial nature of an entity.\n        \n        1.5 “Commercial Use”\n        \n        Means any use of the Software that directly or indirectly participates in, supports, enables, or is part of an activity intended to generate revenue, profit, or economic advantage, whether monetary or non-monetary.\n        \n        Commercial Use includes, but is not limited to:\n        \n        use in products or services offered for sale or subscription;\n        \n        use in internal tools, infrastructure, automation, analytics, or decision-making systems of a Commercial Entity;\n        \n        use in SaaS, PaaS, hosted, cloud, or managed services;\n        \n        use in research, development, or prototyping intended for present or future commercial application;\n        \n        use that reduces costs, increases efficiency, or provides competitive advantage to a Commercial Entity;\n        \n        use by individual entrepreneurs or self-employed persons.\n        \n        \n        1.6 “Non-Commercial Use”\n        \n        Means use solely for personal, educational, academic, or experimental purposes, including:\n        \n        personal pet-projects;\n        \n        learning, studying, or experimenting with the Software;\n        \n        academic research;\n        \n        non-commercial demonstrations.\n        \n        \n        Non-Commercial Use must not be connected to any Commercial Entity or commercial intent.\n        \n        \n        ---\n        \n        2. Grant of Rights (Non-Commercial Only)\n        \n        Subject to the terms of this License, the Author grants You a limited, non-exclusive, non-transferable, revocable license to:\n        \n        access and study the source code;\n        \n        run the Software;\n        \n        modify the Software;\n        \n        \n        solely for Non-Commercial Use.\n        \n        \n        ---\n        \n        3. Special Permission for Non-Profit Organizations\n        \n        The following entities are permitted to use the Software without a separate agreement, provided that the use is not connected to any commercial activity:\n        \n        registered non-profit organizations (NPOs);\n        \n        universities and educational institutions;\n        \n        charitable foundations;\n        \n        academic and research institutions.\n        \n        \n        If such an organization participates in or supports commercial activity, directly or indirectly, this permission is void.\n        \n        \n        ---\n        \n        4. Prohibited Uses\n        \n        Unless explicitly authorized in writing by the Author, You may not:\n        \n        1. Use the Software for any Commercial Use.\n        \n        \n        2. Use the Software within or on behalf of any Commercial Entity.\n        \n        \n        3. Integrate the Software into any commercial product, service, or business process.\n        \n        \n        4. Offer the Software or its derivatives as part of paid or revenue-generating activities.\n        \n        \n        5. Use the Software in internal company workflows, even if the Software itself is not sold.\n        \n        \n        6. Redistribute, publish, mirror, or make available the Software or any modified version thereof.\n        \n        \n        7. Create or publish forks of the Software.\n        \n        \n        8. Attempt to bypass or reinterpret the intent of this License.\n        \n        \n        \n        \n        ---\n        \n        5. Commercial Licensing\n        \n        Any Commercial Use of the Software is strictly prohibited unless You obtain a separate, explicit, written commercial license agreement from the Author.\n        \n        The terms of such agreement are defined exclusively by the Author and may include fees, royalties, usage limits, or other conditions.\n        \n        \n        ---\n        \n        6. Contributions and Feedback\n        \n        Any feedback, suggestions, or code contributions provided to the Author are considered voluntary.\n        \n        By submitting them, You grant the Author the right to use, modify, incorporate, or discard them without any obligation, compensation, or attribution, unless otherwise agreed in writing.\n        \n        You do not acquire any ownership or license rights by submitting contributions.\n        \n        \n        ---\n        \n        7. Ownership\n        \n        The Software is licensed, not sold.\n        \n        All rights, title, and interest in the Software, including all intellectual property rights, remain exclusively with the Author.\n        \n        \n        ---\n        \n        8. Disclaimer of Warranty\n        \n        THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT.\n        \n        \n        ---\n        \n        9. Limitation of Liability\n        \n        IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY CLAIM, DAMAGES, OR OTHER LIABILITY ARISING FROM THE USE OR INABILITY TO USE THE SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n        \n        \n        ---\n        \n        10. Termination\n        \n        Any violation of this License results in immediate and automatic termination of the granted rights.\n        \n        Upon termination, You must immediately cease all use of the Software and destroy all copies in Your possession.\n        \n        \n        ---\n        \n        11. Governing Law\n        \n        This License shall be governed by and construed in accordance with the laws of the Republic of Ecuador, without regard to conflict of law principles.\n        \n        \n        ---\n        \n        12. Final Provisions\n        \n        This License constitutes the entire agreement between You and the Author concerning the Software and supersedes all prior understandings.\n        ",
  "license_expression": null,
  "home_page": "https://github.com/sl4m3/ledgermind",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/sl4m3/ledgermind",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1772076111,
  "project_urls": {
    "Repository": "https://github.com/sl4m3/ledgermind",
    "Bug Tracker": "https://github.com/sl4m3/ledgermind/issues",
    "Homepage": "https://github.com/sl4m3/ledgermind"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}