{
  "name": "leep",
  "version": "1.0.1",
  "summary": "LBNL Embedded Ethernet Protocol tooling",
  "license": "LBNL Embedded Ethernet Protocol library (LEEP) Copyright (c) 2025,\n        The Regents of the University of California, through Lawrence Berkeley\n        National Laboratory, Stanford University, through SLAC National\n        Accelerator Laboratory (both subject to receipt of any required\n        approvals from the U.S. Dept. of Energy) and Osprey Distributed\n        Control Systems. All rights reserved.\n        \n        Redistribution and use in source and binary forms, with or without\n        modification, are permitted provided that the following conditions are met:\n        \n        (1) Redistributions of source code must retain the above copyright notice,\n        this list of conditions and the following disclaimer.\n        \n        (2) Redistributions in binary form must reproduce the above copyright\n        notice, this list of conditions and the following disclaimer in the\n        documentation and/or other materials provided with the distribution.\n        \n        (3) Neither the name of the University of California, Lawrence Berkeley\n        National Laboratory, Stanford University, SLAC National Accelerator Laboratory,\n        U.S. Dept. of Energy, Osprey Distributed Control Systems, nor the names of its\n        contributors may be used to endorse or promote products derived from this\n        software without specific prior written permission.\n        \n        \n        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\n        ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\n        WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.\n        IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,\n        INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,\n        BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n        DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY\n        OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\n        NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,\n        EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n        \n        You are under no obligation whatsoever to provide any bug fixes, patches,\n        or upgrades to the features, functionality or performance of the source\n        code (\"Enhancements\") to anyone; however, if you choose to make your\n        Enhancements available either publicly, or directly to Lawrence Berkeley\n        National Laboratory, without imposing a separate written license agreement\n        for such Enhancements, then you hereby grant the following license: a\n        non-exclusive, royalty-free perpetual license to install, use, modify,\n        prepare derivative works, incorporate into other computer software,\n        distribute, and sublicense such enhancements or derivative works thereof,\n        in binary and source code form.\n        \n        ",
  "license_expression": null,
  "home_page": "https://gitlab.lbl.gov/drivers/leep",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://gitlab.lbl.gov/drivers/leep",
  "repository_source": "project_urls.homepage",
  "download": null,
  "download_source": null,
  "pub_date": 1771530157,
  "project_urls": {
    "Homepage": "https://gitlab.lbl.gov/drivers/leep",
    "Issues": "https://gitlab.lbl.gov/drivers/leep/issues"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}