{
  "name": "pcdsdevices",
  "version": "10.2.0",
  "summary": "Ophyd Device definitions for LCLS Beamline components",
  "license": "Copyright (c) 2023, The Board of Trustees of the Leland Stanford Junior\n        University, through SLAC National Accelerator Laboratory (subject to receipt\n        of any required approvals from the U.S. Dept. of Energy). All rights reserved.\n        Redistribution and use in source and binary forms, with or without\n        modification, are permitted provided that the following conditions are met:\n        \n        (1) Redistributions of source code must retain the above copyright notice,\n            this list of conditions and the following disclaimer.\n        \n        (2) Redistributions in binary form must reproduce the above copyright notice,\n            this list of conditions and the following disclaimer in the documentation\n            and/or other materials provided with the distribution.\n        \n        (3) Neither the name of the Leland Stanford Junior University, SLAC National\n            Accelerator Laboratory, U.S. Dept. of Energy nor the names of its\n            contributors may be used to endorse or promote products derived from this\n            software without specific prior written permission.\n        \n        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\n        ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\n        WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n        DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER, THE UNITED STATES GOVERNMENT,\n        OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n        EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT\n        OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n        INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n        CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING\n        IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY\n        OF SUCH DAMAGE.\n        \n        You are under no obligation whatsoever to provide any bug fixes, patches, or\n        upgrades to the features, functionality or performance of the source code\n        (\"Enhancements\") to anyone; however, if you choose to make your Enhancements\n        available either publicly, or directly to SLAC National Accelerator Laboratory,\n        without imposing a separate written license agreement for such Enhancements,\n        then you hereby grant the following license: a non-exclusive, royalty-free\n        perpetual license to install, use, modify, prepare derivative works, incorporate\n        into other computer software, distribute, and sublicense such Enhancements or\n        derivative works thereof, in binary and source code form.\n        ",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": "SLAC National Accelerator Laboratory",
  "repository": null,
  "repository_source": null,
  "download": null,
  "download_source": null,
  "pub_date": 1769458458,
  "project_urls": {},
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}