{
  "name": "superserve",
  "version": "0.1.5",
  "summary": "CLI and SDK for Superserve hosted agent infrastructure",
  "license": "Open Core Ventures Source Available License (OCVSAL) version 1.0\n        \n        Using software and associated documentation files (the \"Software\") in production requires a valid commercial agreement from the copyright holder.\n        \n        The licensor grants you the right to modify the Software, test it, and share modifications to the Software, for non-production use. You must retain this license on any copies of the Software you share with others. If you provide suggestions, contributions, or other feedback about the Software, you grant the licensor an irrevocable, royalty-free, unlimited license to use that feedback without restriction.\n        \n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE. IF THE FOREGOING WARRANTY DISCLAIMER IS UNENFORCEABLE UNDER APPLICABLE LAW, THIS LICENSE IS VOID AND YOU HAVE NO RIGHT TO USE THE SOFTWARE.\n        ",
  "license_expression": null,
  "home_page": "https://superserve.ai",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/superserve-ai/superserve",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1771908029,
  "project_urls": {
    "Repository": "https://github.com/superserve-ai/superserve",
    "Homepage": "https://superserve.ai"
  },
  "has_github_actions": true,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": false,
  "has_setup_cfg": false
}