{
  "name": "stablestack",
  "version": "0.3.4",
  "summary": "Your AI-generated code, double-checked. Catches subtle bugs that AI assistants often introduce.",
  "license": "StableStack Proprietary License\n        \n        Copyright (c) 2026 StableStack. All Rights Reserved.\n        \n        NOTICE: This software and associated documentation files (the \"Software\")\n        are proprietary and confidential. The Software is protected by copyright\n        law and international treaties.\n        \n        LICENSE GRANT\n        \n        Subject to payment of applicable license fees and compliance with this\n        agreement, you are granted a limited, non-exclusive, non-transferable\n        license to:\n        \n        1. Install and use the Software on systems you own or control\n        2. Use the Software for your internal business purposes\n        3. Make a reasonable number of backup copies for archival purposes\n        \n        FREE TIER\n        \n        The free tier of the Software (including security checks SEC001-SEC004)\n        may be used without a paid license, subject to the restrictions below.\n        \n        RESTRICTIONS\n        \n        You may NOT:\n        \n        1. Redistribute, sell, lease, sublicense, or otherwise transfer the\n           Software to any third party without prior written consent\n        2. Modify, adapt, translate, reverse engineer, decompile, disassemble,\n           or create derivative works based on the Software\n        3. Remove or alter any proprietary notices, labels, or marks on the\n           Software\n        4. Use the Software to provide services to third parties (SaaS) without\n           a separate commercial agreement\n        5. Share license keys or authentication credentials with unauthorized\n           users\n        6. Publish or disclose any benchmark or performance results without\n           prior written consent\n        \n        COMMERCIAL USE\n        \n        Full access to all checks requires a valid paid license. For pricing\n        and licensing inquiries, contact: licensing@stablestack.ai\n        \n        WARRANTY DISCLAIMER\n        \n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\n        OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n        FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL\n        THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n        LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\n        FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\n        DEALINGS IN THE SOFTWARE.\n        \n        LIMITATION OF LIABILITY\n        \n        IN NO EVENT SHALL STABLESTACK BE LIABLE FOR ANY INDIRECT, INCIDENTAL,\n        SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED\n        TO LOSS OF PROFITS, DATA, OR BUSINESS INTERRUPTION) HOWEVER CAUSED,\n        WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT, EVEN IF ADVISED OF THE\n        POSSIBILITY OF SUCH DAMAGE.\n        \n        TERMINATION\n        \n        This license is effective until terminated. Your rights under this license\n        will terminate automatically without notice if you fail to comply with any\n        of its terms. Upon termination, you must destroy all copies of the Software\n        in your possession.\n        \n        GOVERNING LAW\n        \n        This agreement shall be governed by and construed in accordance with the\n        laws of the United States, without regard to conflict of law principles.\n        \n        For licensing inquiries: licensing@stablestack.ai",
  "license_expression": null,
  "home_page": "https://github.com/stablestack/stablestack",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": "vibecheck contributors",
  "repository": "https://github.com/stablestack/stablestack",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1770871138,
  "project_urls": {
    "Repository": "https://github.com/stablestack/stablestack",
    "Homepage": "https://github.com/stablestack/stablestack",
    "Documentation": "https://github.com/stablestack/stablestack#readme"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}