{
  "name": "kallyai-cli",
  "version": "1.0.2",
  "summary": "CLI for KallyAI - AI phone assistant that makes calls to businesses",
  "license": "Kally Intelligence, Inc. Software License Agreement\n        \n        Copyright (c) 2026 Kally Intelligence, Inc. All Rights Reserved.\n        \n        IMPORTANT: READ CAREFULLY BEFORE USING THIS SOFTWARE.\n        \n        This Software License Agreement (\"Agreement\") is a legal agreement between you\n        (\"User\") and Kally Intelligence, Inc. (\"Licensor\") for the use of the KallyAI\n        CLI software and associated documentation (\"Software\").\n        \n        By installing, copying, or otherwise using the Software, you agree to be bound\n        by the terms of this Agreement.\n        \n        1. GRANT OF LICENSE\n        \n        Subject to the terms of this Agreement, Licensor grants you a limited,\n        non-exclusive, non-transferable, revocable license to:\n        \n           a) Install and use the Software solely for personal or internal business\n              purposes in connection with KallyAI services.\n        \n           b) Make copies of the Software solely for backup purposes.\n        \n        2. RESTRICTIONS\n        \n        You shall NOT:\n        \n           a) Reverse engineer, decompile, disassemble, or otherwise attempt to derive\n              the source code, algorithms, or data structures of the Software.\n        \n           b) Modify, adapt, translate, or create derivative works based on the Software.\n        \n           c) Remove, alter, or obscure any proprietary notices, labels, or marks on\n              the Software.\n        \n           d) Rent, lease, lend, sell, sublicense, or transfer the Software to any\n              third party.\n        \n           e) Use the Software for any unlawful purpose or in violation of any\n              applicable laws or regulations.\n        \n           f) Conduct security testing, penetration testing, vulnerability scanning,\n              or any form of security research on the Software without prior written\n              consent from Licensor.\n        \n           g) Attempt to bypass, disable, or circumvent any security features,\n              authentication mechanisms, or access controls in the Software.\n        \n           h) Use the Software to access KallyAI services in any manner that violates\n              the KallyAI Terms of Service.\n        \n           i) Distribute, publish, or make the Software available to third parties\n              except as expressly permitted herein.\n        \n        3. INTELLECTUAL PROPERTY\n        \n        The Software is protected by copyright laws and international treaty provisions.\n        Licensor retains all right, title, and interest in and to the Software, including\n        all intellectual property rights therein. This Agreement does not grant you any\n        rights to trademarks or service marks of Licensor.\n        \n        4. NO WARRANTY\n        \n        THE SOFTWARE IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,\n        INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A\n        PARTICULAR PURPOSE, AND NONINFRINGEMENT. LICENSOR DOES NOT WARRANT THAT THE\n        SOFTWARE WILL BE ERROR-FREE OR UNINTERRUPTED.\n        \n        5. LIMITATION OF LIABILITY\n        \n        IN NO EVENT SHALL LICENSOR BE LIABLE FOR ANY INDIRECT, INCIDENTAL, SPECIAL,\n        EXEMPLARY, OR CONSEQUENTIAL DAMAGES ARISING OUT OF OR IN CONNECTION WITH THIS\n        AGREEMENT OR THE USE OF THE SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n        SUCH DAMAGES.\n        \n        6. TERMINATION\n        \n        This license is effective until terminated. It will terminate automatically\n        without notice if you fail to comply with any term of this Agreement. Upon\n        termination, you must destroy all copies of the Software in your possession.\n        \n        7. GOVERNING LAW\n        \n        This Agreement shall be governed by and construed in accordance with the laws\n        of the State of Delaware, United States, without regard to its conflict of\n        law principles.\n        \n        8. ENTIRE AGREEMENT\n        \n        This Agreement constitutes the entire agreement between you and Licensor\n        regarding the Software and supersedes all prior agreements and understandings.\n        \n        9. CONTACT\n        \n        For licensing inquiries or permissions: legal@kallyintelligence.com\n        \n        By using this Software, you acknowledge that you have read, understood, and\n        agree to be bound by the terms and conditions of this Agreement.",
  "license_expression": null,
  "home_page": "https://kallyai.com",
  "home_page_source": "project_urls.homepage",
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/KallyAI/kallyai-cli",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1769348204,
  "project_urls": {
    "Documentation": "https://github.com/KallyAI/kallyai-cli",
    "Homepage": "https://kallyai.com",
    "Repository": "https://github.com/KallyAI/kallyai-cli",
    "Issues": "https://github.com/KallyAI/kallyai-cli/issues"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}