{
  "name": "pvradar-sdk",
  "version": "2.15.2",
  "summary": "PVRADAR SDK",
  "license": "Copyright (c) 2025 PVRADAR Labs GmbH <info@pvradar.com> (https://pvradar.com)\n        \n        Permission is hereby granted, free of charge, to any person obtaining a copy\n        of this software and associated documentation files (the “Software”) via a\n        publicly accessible package repository (such as PyPI), to download, install,\n        and use the Software for internal purposes, subject to the following\n        conditions:\n        \n        1. The Software may not be modified, merged, adapted, reverse-engineered,\n           or altered in any way.\n        2. The Software may not be sublicensed, resold, or distributed outside the\n           original package repository from which it was obtained.\n        3. The Software may only be used within the legal entity that downloaded\n           it and may not be shared with or used on behalf of third parties.\n        4. Any use of the Software outside these terms requires a separate license\n           agreement.\n        5. All copies must retain the above copyright notice and this permission\n           notice.\n        \n        THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n        FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n        AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n        LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n        OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\n        THE SOFTWARE.\n        ",
  "license_expression": null,
  "home_page": null,
  "maintainer": null,
  "author": null,
  "repository": null,
  "repository_source": null,
  "pub_date": 1768901860,
  "project_urls": {
    "homepage": "https://pvradar.com"
  },
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null
}