{
  "name": "ndtkit-api",
  "version": "0.0.23",
  "summary": "This Python API provides a high-level interface to interact with the NDTkit desktop application. It allows developers to script and automate NDTkit features remotely, leveraging the full power of the underlying Java application through a simple and pythonic library.",
  "license": "Copyright (c) 2025 TESTIA SAS. All Rights Reserved.\n        \n        ==============================================================================\n        PROPRIETARY SOFTWARE LICENSE\n        for the ndtkit_api\n        ==============================================================================\n        \n        This Application Programming Interface, including its documentation, data structures, and all related materials (collectively, the \"API\"), is proprietary software and the confidential intellectual property of TESTIA SAS (\"Licensor\").\n        \n        **1. LICENSE REQUIREMENT**\n        \n        Access to, and use of, this API is strictly conditional upon and requires that you (or the legal entity you represent) hold a valid, active, and fully paid commercial software license for the \"NDTkit\" software (the \"NDTkit License\").\n        \n        Any access or use of this API without a valid NDTkit License is unauthorized, constitutes a material breach of this agreement, and is a violation of Licensor's intellectual property rights.\n        \n        **2. GOVERNING AGREEMENT**\n        \n        Your use of this API is governed by the terms and conditions of your NDTkit License agreement, or a separate API Terms of Service provided by Licensor, whichever is applicable (the \"Governing Agreement\"). By accessing or using this API, you represent and warrant that you hold a valid NDTkit License and you agree to be bound by the terms of the Governing Agreement.\n        \n        **3. TERMINATION OF RIGHTS**\n        \n        Your right to use this API will terminate immediately and automatically, without notice, if your NDTkit License expires, is terminated, or is otherwise no longer valid. Upon such termination, you must cease all use of the API and destroy any related materials in your possession.\n        \n        **4. RESTRICTIONS**\n        \n        You may not, without express written permission from Licensor:\n        a) Sublicense, sell, rent, lease, or otherwise distribute the API to any third party.\n        b) Reverse engineer, decompile, disassemble, or attempt to derive the source code of the API.\n        c) Use the API to create a product or service that competes with the NDTkit software or the API itself.\n        d) Use the API for any purpose not expressly permitted by your Governing Agreement.\n        \n        **5. NO OTHER RIGHTS GRANTED**\n        \n        This license file does not grant you any rights to use, copy, modify, or distribute the API. All rights not expressly granted herein are reserved by TESTIA SAS.\n        \n        **6. DISCLAIMER OF WARRANTY**\n        \n        THE API IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NONINFRINGEMENT.\n        \n        **7. LIMITATION OF LIABILITY**\n        \n        IN NO EVENT SHALL TESTIA SAS BE LIABLE FOR ANY CLAIM, DAMAGES, OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT, OR OTHERWISE, ARISING FROM, OUT OF, OR IN CONNECTION WITH THE API OR THE USE OR OTHER DEALINGS IN THE API.\n        ",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": null,
  "repository": null,
  "repository_source": null,
  "download": null,
  "download_source": null,
  "pub_date": 1770324409,
  "project_urls": {},
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}