{
  "name": "geone",
  "version": "1.3.2",
  "summary": "Geostatistics tools and Multiple Point Statistics",
  "license": "LICENSE\n        \n        Copyright (c) 2023 - University of Neuchâtel\n        \n        \n        PREAMBLE\n        \n        GEONE is a python package providing a set of tools for geostatistical\n        and multiple-point statistics modeling. It contains the DEESSE library\n        in the sub-package deesse_core.\n        \n        DEESSE is a commercial product which is not provided as an open source\n        software and belongs to the University of Neuchâtel. GEONE includes a\n        wrapper allowing to launch DEESSE directly in python.\n        \n        GEONE is provided as an open source code with an open access license\n        applicable for all the code except the deesse_core subpackage (see\n        details below).\n        \n        DEESSE and therefore the deesse_core subpackage requires a specific\n        license agreement for commercial use only.  The use of  DEESSE is free\n        (royalty free) and unlimited for academic research and teaching\n        activities. Its use for industrial and commercial activities is\n        authorized only under a specific license agreement to be concluded\n        with the University of Neuchâtel. Such commercial license must be\n        obtained before any commercial or industrial use to take place and\n        fees will be charged. To obtain such a commercial license from the\n        University of Neuchâtel, the users shall contact directly Prof.\n        Philippe Renard (philippe.renard@unine.ch).\n        \n        \n        LICENSE TERMS FOR THE SOFTWARE GEONE\n        \n        Permission is hereby granted, free of charge, to any person obtaining\n        a copy of this software and associated documentation files, to deal in\n        the software GEONE (“The Software”) excluding the software DEESSE,\n        without restriction, including without limitation the rights to use,\n        copy, modify, merge, publish, distribute, sublicense, and/or sell\n        copies of the Software, and to permit persons to whom the Software is\n        furnished to do so, subject to the following condition:\n        \n        The above copyright notice and this permission notice shall be\n        included in all copies or substantial portions of the Software.\n        \n        The permission granted herehover is related to the Software only and\n        does not imply any commercial or industrial license grant concerning\n        DEESSE software also made available by the copyright owners and the\n        University of Neuchâtel on the GitHub platform.\n        \n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n        EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n        MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\n        IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\n        CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\n        TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\n        SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n        \n        ",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": null,
  "repository": "https://github.com/randlab/geone",
  "repository_source": "project_urls.repository",
  "download": null,
  "download_source": null,
  "pub_date": 1770228230,
  "project_urls": {
    "Repository": "https://github.com/randlab/geone",
    "Issues": "https://github.com/randlab/geone/issues"
  },
  "has_github_actions": false,
  "has_gitlab_pipeline": null,
  "has_dependabot": false,
  "has_pyproject_toml": true,
  "has_setup_py": true,
  "has_setup_cfg": false
}