{
  "name": "kozax",
  "version": "0.0.13",
  "summary": "Genetic programming library in JAX.",
  "license": "kozax: Genetic programming framework in JAX\n        \n        Copyright (c) 2024 sdevries0\n        \n        This work is licensed under the Creative Commons Attribution-NonCommercial-NoDerivs 4.0 International License.\n        \n        You are free to:\n        Share — copy and redistribute the material in any medium or format\n        The licensor cannot revoke these freedoms as long as you follow the license terms.\n        \n        Under the following terms:\n        Attribution — You must give appropriate credit , provide a link to the license, and indicate if changes were made . You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.\n        NonCommercial — You may not use the material for commercial purposes .\n        NoDerivatives — If you remix, transform, or build upon the material, you may not distribute the modified material.\n        No additional restrictions — You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits.\n        \n        Notices:\n        You do not have to comply with the license for elements of the material in the public domain or where your use is permitted by an applicable exception or limitation .\n        No warranties are given. The license may not give you all of the permissions necessary for your intended use. For example, other rights such as publicity, privacy, or moral rights may limit how you use the material.\n        \n        License Details:\n        This work is licensed under the Creative Commons Attribution-NonCommercial-NoDerivs 4.0 International License. To view a copy of this license, visit https://creativecommons.org/licenses/by-nc-nd/4.0/",
  "license_expression": null,
  "home_page": null,
  "home_page_source": null,
  "maintainer": null,
  "author": null,
  "repository": null,
  "repository_source": null,
  "download": null,
  "download_source": null,
  "pub_date": 1771925628,
  "project_urls": {},
  "has_github_actions": null,
  "has_gitlab_pipeline": null,
  "has_dependabot": null,
  "has_pyproject_toml": null,
  "has_setup_py": null,
  "has_setup_cfg": null
}